export var cityattachlist_default_steam = {
    荒原站: "修格里城",
    淘金乐园: "曼德矿场",
    维蒂林场: "贡露城",
    黑月游乐城: "雪金城",
    阿妮塔战备工厂: "澄明数据中心",
    阿妮塔能源研究所: "七号自由港",
    云岫桥基地: "铁山城",
    栖羽站: "岚心城",
    远星大桥: "贡露城",
    汇流塔: "海角城",
    铁盟哨站: "修格里城"
}
export var resonanceskills_default_steam = {
    朱利安: {
        "1": {
            buyMore: {
                product: {
                    斑节虾: 20
                }
            }
        },
        "4": {
            buyMore: {
                product: {
                    斑节虾: 20
                },
                city: {
                    七号自由港: 20
                }
            }
        }
    },
    狮鬃: {
        "1": {
            buyMore: {
                product: {
                    荧光棒: 20
                }
            }
        },
        "4": {
            buyMore: {
                product: {
                    荧光棒: 20,
                    扬声器: 20
                }
            }
        }
    },
    魇: {
        "1": {
            buyMore: {
                product: {
                    刀具: 20
                }
            }
        },
        "5": {
            buyMore: {
                product: {
                    刀具: 30
                }
            }
        }
    },
    塞西尔: {
        "4": {
            buyMore: {
                product: {
                    香水: 20
                }
            }
        },
        "5": {
            buyMore: {
                product: {
                    香水: 30
                }
            }
        }
    },
    雷火: {
        "4": {
            buyMore: {
                product: {
                    曼德工具箱: 20
                }
            }
        }
    },
    黛丝莉: {
        "4": {
            buyMore: {
                product: {
                    毛绒玩具: 20
                }
            }
        },
        "5": {
            buyMore: {
                product: {
                    毛绒玩具: 30
                }
            }
        }
    },
    艾略特: {
        "4": {
            buyMore: {
                product: {
                    游戏卡带: 20,
                    游戏机: 20
                }
            }
        }
    },
    静流: {
        "4": {
            buyMore: {
                city: {
                    海角城: 20
                }
            }
        }
    },
    多萝西: {
        "4": {
            buyMore: {
                product: {
                    弹丸加速装置: 20
                }
            }
        },
        "5": {
            buyMore: {
                product: {
                    弹丸加速装置: 30
                }
            }
        }
    },
    卡莲: {
        "4": {
            buyMore: {
                city: {
                    贡露城: 20
                }
            }
        }
    },
    星花: {
        "1": {
            buyMore: {
                product: {
                    人工晶花: 20
                }
            }
        }
    },
    瑞秋: {
        "4": {
            buyMore: {
                product: {
                    医药品: 20
                }
            }
        }
    },
    菲妮娅: {
        "4": {
            buyMore: {
                product: {
                    大龙虾: 20
                }
            }
        },
        "5": {
            buyMore: {
                product: {
                    大龙虾: 30
                }
            }
        }
    },
    瓦伦汀: {
        "4": {
            buyMore: {
                product: {
                    学会书籍: 20
                }
            }
        },
        "5": {
            buyMore: {
                product: {
                    学会书籍: 30
                }
            }
        }
    },
    阿知波: {
        "4": {
            buyMore: {
                product: {
                    拼装模型: 20
                }
            }
        },
        "5": {
            buyMore: {
                product: {
                    拼装模型: 30
                }
            }
        }
    },
    闻笙: {
        "4": {
            buyMore: {
                product: {
                    限定公仔: 20
                }
            }
        },
        "5": {
            buyMore: {
                product: {
                    限定公仔: 30
                }
            }
        }
    },
    山岚: {
        "4": {
            buyMore: {
                product: {
                    折扇: 20
                }
            }
        }
    },
    叶珏: {
        "1": {
            buyMore: {
                product: {
                    红茶: 20
                }
            }
        },
        "4": {
            buyMore: {
                product: {
                    红茶: 20,
                    家用太阳能电池组: 20
                }
            }
        },
        "5": {
            buyMore: {
                product: {
                    红茶: 30,
                    家用太阳能电池组: 20
                }
            }
        }
    },
    奈弥: {
        "1": {
            buyMore: {
                product: {
                    金箔酒: 20
                }
            }
        },
        "5": {
            buyMore: {
                product: {
                    金箔酒: 30
                }
            }
        }
    },
    伊尔: {
        "1": {
            buyMore: {
                product: {
                    阿妮塔101民用无人机: 20
                }
            }
        },
        "5": {
            buyMore: {
                product: {
                    阿妮塔101民用无人机: 30
                }
            }
        }
    },
    甘雅: {
        "4": {
            buyMore: {
                city: {
                    曼德矿场: 20
                }
            }
        },
        "5": {
            buyMore: {
                city: {
                    曼德矿场: 30
                }
            }
        }
    },
    妮蔻拉: {
        "4": {
            buyMore: {
                city: {
                    阿妮塔能源研究所: 20
                }
            }
        },
        "5": {
            buyMore: {
                city: {
                    阿妮塔能源研究所: 30
                }
            }
        }
    },
    卡洛琳: {
        "4": {
            buyMore: {
                product: {
                    石墨烯: 20
                }
            }
        },
        "5": {
            buyMore: {
                product: {
                    石墨烯: 30
                }
            }
        }
    },
    苔妮: {
        "1": {
            buyMore: {
                product: {
                    蜂窝防热烧蚀材料: 20,
                    钛矿石: 20
                }
            }
        },
        "5": {
            buyMore: {
                product: {
                    蜂窝防热烧蚀材料: 30,
                    钛矿石: 30
                }
            }
        }
    },
    安菲娅: {
        "1": {
            buyMore: {
                city: {
                    荒原站: 20
                }
            }
        },
        "5": {
            buyMore: {
                city: {
                    荒原站: 30
                }
            }
        }
    },
    帕拉笛: {
        "4": {
            buyMore: {
                city: {
                    云岫桥基地: 20
                }
            }
        }
    },
    金子小姐: {
        "4": {
            buyMore: {
                city: {
                    淘金乐园: 20
                }
            }
        }
    }
}
export var role_resonanceskills_steam = {
    朱利安: {
        resonance: 4
    },
    狮鬃: {
        resonance: 4
    },
    魇: {
        resonance: 5
    },
    塞西尔: {
        resonance: 5
    },
    雷火: {
        resonance: 4
    },
    黛丝莉: {
        resonance: 5
    },
    艾略特: {
        resonance: 4
    },
    静流: {
        resonance: 4
    },
    多萝西: {
        resonance: 5
    },
    卡莲: {
        resonance: 4
    },
    星花: {
        resonance: 1
    },
    瑞秋: {
        resonance: 4
    },
    菲妮娅: {
        resonance: 5
    },
    瓦伦汀: {
        resonance: 5
    },
    阿知波: {
        resonance: 5
    },
    闻笙: {
        resonance: 5
    },
    山岚: {
        resonance: 4
    },
    叶珏: {
        resonance: 5
    },
    奈弥: {
        resonance: 5
    },
    伊尔: {
        resonance: 5
    },
    甘雅: {
        resonance: 5
    },
    妮蔻拉: {
        resonance: 5
    },
    卡洛琳: {
        resonance: 5
    },
    苔妮: {
        resonance: 5
    },
    安菲娅: {
        resonance: 5
    },
    帕拉笛: {
        resonance: 4
    },
    金子小姐: {
        resonance: 4
    }
}
export var products_default_steam = [
    {
        name: "啤酒",
        buyPrices: {
            七号自由港: 118
        },
        buyLot: {
            七号自由港: 56
        },
        sellPrices: {
            荒原站: 142,
            阿妮塔能源研究所: 127,
            淘金乐园: 148,
            曼德矿场: 149,
            海角城: 143,
            贡露城: 142,
            澄明数据中心: 133,
            修格里城: 133,
            岚心城: 175,
            铁盟哨站: 146,
            阿妮塔战备工厂: 124,
            阿妮塔发射中心: 130,
            云岫桥基地: 155,
            汇流塔: 142,
            远星大桥: 143,
            栖羽站: 165,
            塔图站: 159,
            黑月游乐城: 145,
            维蒂林场: 155,
            七号自由港: null
        },
        type: "Normal"
    },
    {
        name: "坚果",
        buyPrices: {
            七号自由港: 210
        },
        buyLot: {
            七号自由港: 42
        },
        sellPrices: {
            淘金乐园: 275,
            曼德矿场: 265,
            荒原站: 252,
            海角城: 242,
            阿妮塔能源研究所: 221,
            澄明数据中心: 237,
            修格里城: 237,
            贡露城: 265,
            岚心城: 317,
            铁盟哨站: 254,
            阿妮塔战备工厂: 221,
            阿妮塔发射中心: 231,
            云岫桥基地: 263,
            汇流塔: 252,
            远星大桥: 242,
            栖羽站: 307,
            塔图站: 290,
            黑月游乐城: 258,
            维蒂林场: 263,
            七号自由港: null
        },
        type: "Normal"
    },
    {
        name: "海盐",
        buyPrices: {
            七号自由港: 88
        },
        buyLot: {
            七号自由港: 70
        },
        sellPrices: {
            淘金乐园: 114,
            阿妮塔能源研究所: 93,
            修格里城: 99,
            海角城: 104,
            曼德矿场: 109,
            贡露城: 109,
            澄明数据中心: 101,
            荒原站: 109,
            岚心城: 138,
            铁盟哨站: 104,
            阿妮塔战备工厂: 93,
            阿妮塔发射中心: 99,
            云岫桥基地: 114,
            汇流塔: 109,
            远星大桥: 104,
            栖羽站: 130,
            塔图站: 125,
            黑月游乐城: 109,
            维蒂林场: 114,
            七号自由港: null
        },
        type: "Normal"
    },
    {
        name: "斑节虾",
        buyPrices: {
            七号自由港: 588
        },
        buyLot: {
            七号自由港: 35
        },
        sellPrices: {
            荒原站: 958,
            淘金乐园: 1047,
            曼德矿场: 958,
            修格里城: 782,
            阿妮塔能源研究所: 694,
            澄明数据中心: 782,
            海角城: 870,
            贡露城: 976,
            岚心城: 1417,
            铁盟哨站: 870,
            阿妮塔战备工厂: 694,
            阿妮塔发射中心: 782,
            云岫桥基地: 1064,
            汇流塔: 958,
            远星大桥: 870,
            栖羽站: 1329,
            塔图站: 1258,
            黑月游乐城: 976,
            维蒂林场: 1064,
            七号自由港: null
        },
        type: "Special"
    },
    {
        name: "航天纪念品",
        buyPrices: {
            七号自由港: 777
        },
        buyLot: {
            七号自由港: 28
        },
        sellPrices: {
            修格里城: 862,
            荒原站: 901,
            阿妮塔能源研究所: 808,
            澄明数据中心: 862,
            贡露城: 948,
            淘金乐园: 932,
            曼德矿场: 925,
            海角城: 917,
            岚心城: 1103,
            铁盟哨站: 894,
            阿妮塔战备工厂: 808,
            阿妮塔发射中心: 839,
            云岫桥基地: 932,
            汇流塔: 948,
            远星大桥: 870,
            栖羽站: 1026,
            塔图站: 995,
            黑月游乐城: 925,
            维蒂林场: 932,
            七号自由港: null
        },
        type: "Normal"
    },
    {
        name: "电子配件",
        buyPrices: {
            七号自由港: 1024
        },
        buyLot: {
            七号自由港: 21
        },
        sellPrices: {
            修格里城: 1137,
            阿妮塔能源研究所: 1096,
            曼德矿场: 1249,
            荒原站: 1219,
            贡露城: 1219,
            海角城: 1178,
            澄明数据中心: 1167,
            淘金乐园: 1260,
            岚心城: 1454,
            铁盟哨站: 1208,
            阿妮塔战备工厂: 1096,
            阿妮塔发射中心: 1137,
            云岫桥基地: 1260,
            汇流塔: 1219,
            远星大桥: 1178,
            栖羽站: 1382,
            塔图站: 1341,
            黑月游乐城: 1219,
            维蒂林场: 1260,
            七号自由港: null
        },
        type: "Normal"
    },
    {
        name: "铁轨用特种钢材",
        buyPrices: {
            曼德矿场: 1080
        },
        buyLot: {
            曼德矿场: 24
        },
        sellPrices: {
            贡露城: 1274,
            荒原站: 1166,
            修格里城: 1166,
            阿妮塔能源研究所: 1382,
            淘金乐园: 1166,
            七号自由港: 1328,
            海角城: 1382,
            澄明数据中心: 1220,
            岚心城: 1436,
            铁盟哨站: 1112,
            阿妮塔战备工厂: 1274,
            阿妮塔发射中心: 1436,
            云岫桥基地: 1220,
            汇流塔: 1436,
            远星大桥: 1307,
            栖羽站: 1382,
            塔图站: 1274,
            黑月游乐城: 1328,
            维蒂林场: 1166,
            曼德矿场: null
        },
        type: "Normal",
        craft: {
            铁矿石: 0.375
        }
    },
    {
        name: "砂石",
        buyPrices: {
            曼德矿场: 30
        },
        buyLot: {
            曼德矿场: 72
        },
        sellPrices: {
            七号自由港: 36,
            海角城: 38,
            荒原站: 32,
            阿妮塔能源研究所: 38,
            修格里城: 32,
            贡露城: 35,
            澄明数据中心: 33,
            岚心城: 39,
            淘金乐园: 32,
            铁盟哨站: 30,
            阿妮塔战备工厂: 35,
            阿妮塔发射中心: 39,
            云岫桥基地: 33,
            汇流塔: 39,
            远星大桥: 35,
            栖羽站: 38,
            塔图站: 35,
            黑月游乐城: 36,
            维蒂林场: 32,
            曼德矿场: null
        },
        type: "Normal"
    },
    {
        name: "黄铜",
        buyPrices: {
            曼德矿场: 620
        },
        buyLot: {
            曼德矿场: 30
        },
        sellPrices: {
            荒原站: 639,
            阿妮塔能源研究所: 732,
            淘金乐园: 639,
            海角城: 713,
            七号自由港: 694,
            贡露城: 676,
            修格里城: 657,
            澄明数据中心: 676,
            岚心城: 732,
            铁盟哨站: 639,
            阿妮塔战备工厂: 694,
            阿妮塔发射中心: 750,
            云岫桥基地: 657,
            汇流塔: 732,
            远星大桥: 676,
            栖羽站: 713,
            塔图站: 676,
            黑月游乐城: 694,
            维蒂林场: 639,
            曼德矿场: null
        },
        type: "Normal"
    },
    {
        name: "建材",
        buyPrices: {
            曼德矿场: 450
        },
        buyLot: {
            曼德矿场: 30
        },
        sellPrices: {
            澄明数据中心: 500,
            修格里城: 482,
            贡露城: 518,
            七号自由港: 522,
            阿妮塔能源研究所: 554,
            淘金乐园: 468,
            荒原站: 482,
            海角城: 540,
            岚心城: 558,
            铁盟哨站: 464,
            阿妮塔战备工厂: 504,
            阿妮塔发射中心: 558,
            云岫桥基地: 500,
            汇流塔: 558,
            远星大桥: 518,
            栖羽站: 540,
            塔图站: 504,
            黑月游乐城: 522,
            维蒂林场: 482,
            曼德矿场: null
        },
        type: "Normal"
    },
    {
        name: "铁矿石",
        buyPrices: {
            曼德矿场: 350,
            淘金乐园: 361
        },
        buyLot: {
            曼德矿场: 36,
            淘金乐园: 36
        },
        sellPrices: {
            荒原站: 361,
            贡露城: 382,
            阿妮塔能源研究所: 413,
            七号自由港: 392,
            修格里城: 361,
            海角城: 403,
            澄明数据中心: 371,
            岚心城: 413,
            铁盟哨站: 361,
            阿妮塔战备工厂: 392,
            阿妮塔发射中心: 413,
            云岫桥基地: 371,
            汇流塔: 413,
            远星大桥: 382,
            栖羽站: 403,
            塔图站: 382,
            黑月游乐城: 392,
            维蒂林场: 361,
            曼德矿场: null,
            淘金乐园: null
        },
        type: "Normal"
    },
    {
        name: "石材",
        buyPrices: {
            曼德矿场: 180
        },
        buyLot: {
            曼德矿场: 45
        },
        sellPrices: {
            七号自由港: 216,
            荒原站: 189,
            修格里城: 189,
            阿妮塔能源研究所: 225,
            贡露城: 207,
            海角城: 225,
            澄明数据中心: 203,
            岚心城: 234,
            淘金乐园: 189,
            铁盟哨站: 180,
            阿妮塔战备工厂: 207,
            阿妮塔发射中心: 234,
            云岫桥基地: 203,
            汇流塔: 234,
            远星大桥: 212,
            栖羽站: 225,
            塔图站: 207,
            黑月游乐城: 216,
            维蒂林场: 189,
            曼德矿场: null
        },
        type: "Normal"
    },
    {
        name: "曼德工具箱",
        buyPrices: {
            曼德矿场: 880
        },
        buyLot: {
            曼德矿场: 27
        },
        sellPrices: {
            荒原站: 994,
            七号自由港: 1285,
            淘金乐园: 994,
            阿妮塔能源研究所: 1373,
            贡露城: 1197,
            海角城: 1373,
            澄明数据中心: 1109,
            修格里城: 1021,
            岚心城: 1461,
            铁盟哨站: 933,
            阿妮塔战备工厂: 1197,
            阿妮塔发射中心: 1461,
            云岫桥基地: 1109,
            汇流塔: 1461,
            远星大桥: 1197,
            栖羽站: 1373,
            塔图站: 1197,
            黑月游乐城: 1285,
            维蒂林场: 1021,
            曼德矿场: null
        },
        type: "Special"
    },
    {
        name: "水晶工艺品",
        buyPrices: {
            贡露城: 800
        },
        buyLot: {
            贡露城: 21
        },
        sellPrices: {
            七号自由港: 896,
            荒原站: 896,
            淘金乐园: 848,
            澄明数据中心: 920,
            阿妮塔能源研究所: 848,
            曼德矿场: 872,
            海角城: 872,
            修格里城: 896,
            岚心城: 1064,
            铁盟哨站: 896,
            阿妮塔战备工厂: 896,
            阿妮塔发射中心: 896,
            云岫桥基地: 920,
            汇流塔: 896,
            远星大桥: 800,
            栖羽站: 1016,
            塔图站: 968,
            黑月游乐城: 992,
            维蒂林场: 848,
            贡露城: null
        },
        type: "Normal"
    },
    {
        name: "化妆品",
        buyPrices: {
            贡露城: 710
        },
        buyLot: {
            贡露城: 24
        },
        sellPrices: {
            修格里城: 817,
            曼德矿场: 774,
            淘金乐园: 753,
            阿妮塔能源研究所: 753,
            七号自由港: 795,
            荒原站: 795,
            海角城: 774,
            澄明数据中心: 817,
            岚心城: 966,
            铁盟哨站: 795,
            阿妮塔战备工厂: 795,
            阿妮塔发射中心: 795,
            云岫桥基地: 817,
            汇流塔: 795,
            远星大桥: 710,
            栖羽站: 923,
            塔图站: 838,
            黑月游乐城: 880,
            维蒂林场: 731,
            贡露城: null
        },
        type: "Normal"
    },
    {
        name: "轻奢女装",
        buyPrices: {
            贡露城: 1350
        },
        buyLot: {
            贡露城: 15
        },
        sellPrices: {
            海角城: 1485,
            曼德矿场: 1553,
            阿妮塔能源研究所: 1485,
            淘金乐园: 1485,
            七号自由港: 1661,
            澄明数据中心: 1769,
            修格里城: 1661,
            荒原站: 1620,
            岚心城: 2106,
            铁盟哨站: 1620,
            阿妮塔战备工厂: 1620,
            阿妮塔发射中心: 1620,
            云岫桥基地: 1728,
            汇流塔: 1553,
            远星大桥: 1350,
            栖羽站: 1971,
            塔图站: 1688,
            黑月游乐城: 1863,
            维蒂林场: 1458,
            贡露城: null
        },
        type: "Normal",
        craft: {
            纯棉布料: 0.1875,
            绣线: 0.1875,
            雪纺: 0.1875
        }
    },
    {
        name: "日化用品",
        buyPrices: {
            贡露城: 170
        },
        buyLot: {
            贡露城: 54
        },
        sellPrices: {
            荒原站: 196,
            七号自由港: 190,
            阿妮塔能源研究所: 180,
            澄明数据中心: 201,
            淘金乐园: 185,
            修格里城: 190,
            海角城: 180,
            曼德矿场: 190,
            岚心城: 221,
            铁盟哨站: 190,
            阿妮塔战备工厂: 190,
            阿妮塔发射中心: 190,
            云岫桥基地: 201,
            汇流塔: 185,
            远星大桥: 175,
            栖羽站: 211,
            塔图站: 201,
            黑月游乐城: 206,
            维蒂林场: 180,
            贡露城: null
        },
        type: "Normal"
    },
    {
        name: "火腿",
        buyPrices: {
            贡露城: 1680
        },
        buyLot: {
            贡露城: 12
        },
        sellPrices: {
            荒原站: 2318,
            阿妮塔能源研究所: 2050,
            淘金乐园: 2050,
            海角城: 2050,
            澄明数据中心: 2453,
            修格里城: 2318,
            七号自由港: 2318,
            曼德矿场: 2184,
            岚心城: 3125,
            铁盟哨站: 2318,
            阿妮塔战备工厂: 2318,
            阿妮塔发射中心: 2318,
            云岫桥基地: 2453,
            汇流塔: 2184,
            远星大桥: 1781,
            栖羽站: 2856,
            塔图站: 2352,
            黑月游乐城: 2722,
            维蒂林场: 1915,
            贡露城: null
        },
        type: "Special"
    },
    {
        name: "香水",
        buyPrices: {
            贡露城: 1180
        },
        buyLot: {
            贡露城: 18
        },
        sellPrices: {
            阿妮塔能源研究所: 1357,
            修格里城: 1534,
            荒原站: 1499,
            七号自由港: 1499,
            海角城: 1392,
            淘金乐园: 1357,
            曼德矿场: 1428,
            澄明数据中心: 1569,
            岚心城: 1959,
            铁盟哨站: 1499,
            阿妮塔战备工厂: 1499,
            阿妮塔发射中心: 1499,
            云岫桥基地: 1605,
            汇流塔: 1463,
            远星大桥: 1215,
            栖羽站: 1817,
            塔图站: 1605,
            黑月游乐城: 1711,
            维蒂林场: 1286,
            贡露城: null
        },
        type: "Special"
    },
    {
        name: "鱼子酱",
        buyPrices: {
            贡露城: 3780
        },
        buyLot: {
            贡露城: 6
        },
        sellPrices: {
            澄明数据中心: 4857,
            荒原站: 4574,
            修格里城: 4687,
            七号自由港: 4574,
            淘金乐园: 4234,
            海角城: 4234,
            曼德矿场: 4404,
            阿妮塔能源研究所: 4234,
            岚心城: 5708,
            铁盟哨站: 4574,
            阿妮塔战备工厂: 4574,
            阿妮塔发射中心: 4574,
            云岫桥基地: 4857,
            汇流塔: 4404,
            远星大桥: 3893,
            栖羽站: 5481,
            塔图站: 4971,
            黑月游乐城: 5198,
            维蒂林场: 4064,
            贡露城: null
        },
        type: "Special"
    },
    {
        name: "高端护肤品",
        buyPrices: {
            贡露城: 2980
        },
        buyLot: {
            贡露城: 9
        },
        sellPrices: {
            澄明数据中心: 3665,
            海角城: 3397,
            阿妮塔能源研究所: 3308,
            修格里城: 3636,
            七号自由港: 3546,
            淘金乐园: 3308,
            曼德矿场: 3427,
            荒原站: 3546,
            岚心城: 4351,
            铁盟哨站: 3546,
            阿妮塔战备工厂: 3546,
            阿妮塔发射中心: 3546,
            云岫桥基地: 3665,
            汇流塔: 3516,
            远星大桥: 3069,
            栖羽站: 4112,
            塔图站: 3665,
            黑月游乐城: 3904,
            维蒂林场: 3189,
            贡露城: null
        },
        type: "Special"
    },
    {
        name: "珍珠",
        buyPrices: {
            海角城: 4000
        },
        buyLot: {
            海角城: 8
        },
        sellPrices: {
            修格里城: 4920,
            曼德矿场: 4920,
            阿妮塔能源研究所: 4440,
            七号自由港: 4600,
            澄明数据中心: 4920,
            荒原站: 5240,
            淘金乐园: 5040,
            贡露城: 4560,
            岚心城: 6160,
            铁盟哨站: 5080,
            阿妮塔战备工厂: 4600,
            阿妮塔发射中心: 4600,
            云岫桥基地: 5520,
            汇流塔: 4120,
            远星大桥: 4440,
            栖羽站: 6000,
            塔图站: 5480,
            黑月游乐城: 5360,
            维蒂林场: 4760,
            海角城: null
        },
        type: "Special"
    },
    {
        name: "大龙虾",
        buyPrices: {
            海角城: 1000
        },
        buyLot: {
            海角城: 24
        },
        sellPrices: {
            七号自由港: 1270,
            修格里城: 1460,
            曼德矿场: 1460,
            澄明数据中心: 1460,
            淘金乐园: 1460,
            贡露城: 1250,
            阿妮塔能源研究所: 1220,
            荒原站: 1620,
            岚心城: 2020,
            铁盟哨站: 1540,
            阿妮塔战备工厂: 1300,
            阿妮塔发射中心: 1300,
            云岫桥基地: 1700,
            汇流塔: 1030,
            远星大桥: 1220,
            栖羽站: 1940,
            塔图站: 1650,
            黑月游乐城: 1620,
            维蒂林场: 1350,
            海角城: null
        },
        type: "Special"
    },
    {
        name: "海角辣椒",
        buyPrices: {
            海角城: 80
        },
        buyLot: {
            海角城: 48
        },
        sellPrices: {
            荒原站: 125,
            修格里城: 117,
            曼德矿场: 114,
            淘金乐园: 112,
            阿妮塔能源研究所: 93,
            七号自由港: 104,
            澄明数据中心: 114,
            贡露城: 98,
            岚心城: 162,
            铁盟哨站: 123,
            阿妮塔战备工厂: 99,
            阿妮塔发射中心: 99,
            云岫桥基地: 134,
            汇流塔: 80,
            远星大桥: 93,
            栖羽站: 155,
            塔图站: 130,
            黑月游乐城: 127,
            维蒂林场: 106,
            海角城: null
        },
        type: "Normal"
    },
    {
        name: "鱿鱼",
        buyPrices: {
            海角城: 200
        },
        buyLot: {
            海角城: 48
        },
        sellPrices: {
            淘金乐园: 280,
            贡露城: 244,
            荒原站: 312,
            修格里城: 280,
            七号自由港: 248,
            阿妮塔能源研究所: 232,
            曼德矿场: 280,
            澄明数据中心: 286,
            岚心城: 404,
            铁盟哨站: 296,
            阿妮塔战备工厂: 248,
            阿妮塔发射中心: 248,
            云岫桥基地: 340,
            汇流塔: 200,
            远星大桥: 232,
            栖羽站: 388,
            塔图站: 324,
            黑月游乐城: 318,
            维蒂林场: 264,
            海角城: null
        },
        type: "Normal"
    },
    {
        name: "带鱼",
        buyPrices: {
            海角城: 240
        },
        buyLot: {
            海角城: 48
        },
        sellPrices: {
            修格里城: 360,
            贡露城: 302,
            荒原站: 408,
            曼德矿场: 360,
            阿妮塔能源研究所: 288,
            七号自由港: 312,
            澄明数据中心: 367,
            淘金乐园: 360,
            岚心城: 542,
            铁盟哨站: 384,
            阿妮塔战备工厂: 312,
            阿妮塔发射中心: 312,
            云岫桥基地: 439,
            汇流塔: 240,
            远星大桥: 288,
            栖羽站: 518,
            塔图站: 422,
            黑月游乐城: 415,
            维蒂林场: 336,
            海角城: null
        },
        type: "Normal"
    },
    {
        name: "行李箱包",
        buyPrices: {
            海角城: 480
        },
        buyLot: {
            海角城: 32
        },
        sellPrices: {
            修格里城: 590,
            七号自由港: 552,
            荒原站: 614,
            曼德矿场: 590,
            阿妮塔能源研究所: 518,
            澄明数据中心: 576,
            淘金乐园: 576,
            贡露城: 533,
            岚心城: 725,
            铁盟哨站: 610,
            阿妮塔战备工厂: 538,
            阿妮塔发射中心: 538,
            云岫桥基地: 634,
            汇流塔: 480,
            远星大桥: 518,
            栖羽站: 706,
            塔图站: 629,
            黑月游乐城: 629,
            维蒂林场: 571,
            海角城: null
        },
        type: "Normal"
    },
    {
        name: "桦石发财树",
        buyPrices: {
            七号自由港: 4888
        },
        buyLot: {
            七号自由港: 7
        },
        sellPrices: {
            海角城: 5401,
            贡露城: 5670,
            曼德矿场: 5523,
            修格里城: 5279,
            澄明数据中心: 5279,
            淘金乐园: 5792,
            阿妮塔能源研究所: 5157,
            荒原站: 5523,
            岚心城: 6281,
            铁盟哨站: 5401,
            阿妮塔战备工厂: 5157,
            阿妮塔发射中心: 5279,
            云岫桥基地: 5792,
            汇流塔: 5670,
            远星大桥: 5401,
            栖羽站: 6159,
            塔图站: 6183,
            黑月游乐城: 5670,
            维蒂林场: 5646,
            七号自由港: null
        },
        type: "Special"
    },
    {
        name: "石墨烯",
        buyPrices: {
            七号自由港: 2304
        },
        buyLot: {
            七号自由港: 7
        },
        sellPrices: {
            阿妮塔能源研究所: 2534,
            澄明数据中心: 2627,
            荒原站: 2742,
            海角城: 2650,
            曼德矿场: 2811,
            贡露城: 2811,
            淘金乐园: 2834,
            修格里城: 2557,
            岚心城: 3272,
            铁盟哨站: 2719,
            阿妮塔战备工厂: 2465,
            阿妮塔发射中心: 2557,
            云岫桥基地: 2903,
            汇流塔: 2811,
            远星大桥: 2650,
            栖羽站: 3180,
            塔图站: 3087,
            黑月游乐城: 2811,
            维蒂林场: 2834,
            七号自由港: null
        },
        type: "Special",
        craft: {
            石墨: 0.375
        }
    },
    {
        name: "人工晶花",
        buyPrices: {
            七号自由港: 1777
        },
        buyLot: {
            七号自由港: 14
        },
        sellPrices: {
            荒原站: 2164,
            海角城: 2081,
            阿妮塔能源研究所: 1914,
            修格里城: 1997,
            淘金乐园: 2301,
            贡露城: 2218,
            澄明数据中心: 1997,
            曼德矿场: 2164,
            岚心城: 2635,
            铁盟哨站: 2081,
            阿妮塔战备工厂: 1914,
            阿妮塔发射中心: 1997,
            云岫桥基地: 2301,
            汇流塔: 2218,
            远星大桥: 2081,
            栖羽站: 2552,
            塔图站: 2522,
            黑月游乐城: 2218,
            维蒂林场: 2248,
            七号自由港: null
        },
        type: "Special"
    },
    {
        name: "发动机",
        buyPrices: {
            修格里城: 3363
        },
        buyLot: {
            修格里城: 9
        },
        sellPrices: {
            荒原站: 3565,
            曼德矿场: 3565,
            阿妮塔能源研究所: 3867,
            海角城: 4069,
            淘金乐园: 3767,
            澄明数据中心: 3565,
            贡露城: 3968,
            七号自由港: 3666,
            岚心城: 4271,
            铁盟哨站: 3464,
            阿妮塔战备工厂: 3666,
            阿妮塔发射中心: 3867,
            云岫桥基地: 3666,
            汇流塔: 4170,
            远星大桥: 4069,
            栖羽站: 4170,
            塔图站: 4069,
            黑月游乐城: 3666,
            维蒂林场: 3867,
            修格里城: null
        },
        type: "Special"
    },
    {
        name: "弹丸加速装置",
        buyPrices: {
            修格里城: 2147,
            铁盟哨站: 2147
        },
        buyLot: {
            修格里城: 18,
            铁盟哨站: 18
        },
        sellPrices: {
            荒原站: 2297,
            阿妮塔能源研究所: 2469,
            曼德矿场: 2297,
            澄明数据中心: 2297,
            海角城: 2705,
            淘金乐园: 2448,
            贡露城: 2619,
            七号自由港: 2383,
            岚心城: 2877,
            阿妮塔战备工厂: 2448,
            阿妮塔发射中心: 2555,
            云岫桥基地: 2448,
            汇流塔: 2791,
            远星大桥: 2705,
            栖羽站: 2791,
            塔图站: 2705,
            黑月游乐城: 2383,
            维蒂林场: 2533,
            修格里城: null,
            铁盟哨站: null
        },
        type: "Special"
    },
    {
        name: "家电",
        buyPrices: {
            修格里城: 1088
        },
        buyLot: {
            修格里城: 21
        },
        sellPrices: {
            淘金乐园: 1186,
            七号自由港: 1153,
            荒原站: 1153,
            阿妮塔能源研究所: 1186,
            澄明数据中心: 1153,
            曼德矿场: 1121,
            海角城: 1251,
            贡露城: 1219,
            岚心城: 1349,
            铁盟哨站: 1088,
            阿妮塔战备工厂: 1153,
            阿妮塔发射中心: 1219,
            云岫桥基地: 1186,
            汇流塔: 1284,
            远星大桥: 1251,
            栖羽站: 1316,
            塔图站: 1316,
            黑月游乐城: 1186,
            维蒂林场: 1186,
            修格里城: null
        },
        type: "Normal"
    },
    {
        name: "汽配零件",
        buyPrices: {
            修格里城: 720
        },
        buyLot: {
            修格里城: 24
        },
        sellPrices: {
            淘金乐园: 792,
            贡露城: 886,
            荒原站: 778,
            阿妮塔能源研究所: 828,
            海角城: 922,
            澄明数据中心: 756,
            七号自由港: 814,
            曼德矿场: 756,
            岚心城: 1015,
            铁盟哨站: 742,
            阿妮塔战备工厂: 792,
            阿妮塔发射中心: 886,
            云岫桥基地: 792,
            汇流塔: 958,
            远星大桥: 922,
            栖羽站: 936,
            塔图站: 922,
            黑月游乐城: 792,
            维蒂林场: 828,
            修格里城: null
        },
        type: "Normal"
    },
    {
        name: "红茶",
        buyPrices: {
            修格里城: 688
        },
        buyLot: {
            修格里城: 30
        },
        sellPrices: {
            淘金乐园: 874,
            澄明数据中心: 791,
            七号自由港: 874,
            荒原站: 791,
            曼德矿场: 791,
            阿妮塔能源研究所: 956,
            海角城: 1142,
            贡露城: 1060,
            岚心城: 1307,
            铁盟哨站: 709,
            阿妮塔战备工厂: 874,
            阿妮塔发射中心: 1039,
            云岫桥基地: 894,
            汇流塔: 1225,
            远星大桥: 1142,
            栖羽站: 1225,
            塔图站: 1163,
            黑月游乐城: 894,
            维蒂林场: 977,
            修格里城: null
        },
        type: "Special"
    },
    {
        name: "高档餐具",
        buyPrices: {
            修格里城: 368
        },
        buyLot: {
            修格里城: 36
        },
        sellPrices: {
            曼德矿场: 383,
            淘金乐园: 397,
            七号自由港: 397,
            荒原站: 383,
            阿妮塔能源研究所: 412,
            贡露城: 449,
            澄明数据中心: 383,
            海角城: 442,
            岚心城: 482,
            铁盟哨站: 368,
            阿妮塔战备工厂: 397,
            阿妮塔发射中心: 427,
            云岫桥基地: 397,
            汇流塔: 456,
            远星大桥: 442,
            栖羽站: 467,
            塔图站: 453,
            黑月游乐城: 408,
            维蒂林场: 412,
            修格里城: null
        },
        type: "Normal"
    },
    {
        name: "沃德烤鸡",
        buyPrices: {
            修格里城: 298
        },
        buyLot: {
            修格里城: 39
        },
        sellPrices: {
            淘金乐园: 465,
            荒原站: 381,
            七号自由港: 465,
            贡露城: 614,
            曼德矿场: 390,
            阿妮塔能源研究所: 539,
            澄明数据中心: 381,
            海角城: 688,
            岚心城: 837,
            铁盟哨站: 316,
            阿妮塔战备工厂: 456,
            阿妮塔发射中心: 614,
            云岫桥基地: 465,
            汇流塔: 763,
            远星大桥: 688,
            栖羽站: 763,
            塔图站: 697,
            黑月游乐城: 474,
            维蒂林场: 548,
            修格里城: null
        },
        type: "Special"
    },
    {
        name: "罐头",
        buyPrices: {
            修格里城: 105
        },
        buyLot: {
            修格里城: 45
        },
        sellPrices: {
            阿妮塔能源研究所: 124,
            曼德矿场: 113,
            贡露城: 126,
            七号自由港: 116,
            荒原站: 110,
            澄明数据中心: 113,
            淘金乐园: 119,
            海角城: 131,
            岚心城: 145,
            铁盟哨站: 108,
            阿妮塔战备工厂: 116,
            阿妮塔发射中心: 129,
            云岫桥基地: 119,
            汇流塔: 137,
            远星大桥: 134,
            栖羽站: 140,
            塔图站: 131,
            黑月游乐城: 119,
            维蒂林场: 124,
            修格里城: null
        },
        type: "Normal"
    },
    {
        name: "沃德山泉",
        buyPrices: {
            修格里城: 50
        },
        buyLot: {
            修格里城: 60
        },
        sellPrices: {
            淘金乐园: 70,
            澄明数据中心: 62,
            七号自由港: 70,
            曼德矿场: 60,
            荒原站: 60,
            阿妮塔能源研究所: 80,
            贡露城: 93,
            海角城: 100,
            岚心城: 123,
            铁盟哨站: 52,
            阿妮塔战备工厂: 70,
            阿妮塔发射中心: 90,
            云岫桥基地: 73,
            汇流塔: 110,
            远星大桥: 100,
            栖羽站: 113,
            塔图站: 105,
            黑月游乐城: 73,
            维蒂林场: 82,
            修格里城: null
        },
        type: "Normal"
    },
    {
        name: "钢筋混凝土轨枕",
        buyPrices: {
            曼德矿场: 540
        },
        buyLot: {
            曼德矿场: 36
        },
        sellPrices: {
            荒原站: 583,
            阿妮塔能源研究所: 691,
            修格里城: 583,
            淘金乐园: 583,
            贡露城: 637,
            七号自由港: 664,
            海角城: 691,
            澄明数据中心: 610,
            岚心城: 718,
            铁盟哨站: 556,
            阿妮塔战备工厂: 637,
            阿妮塔发射中心: 718,
            云岫桥基地: 610,
            汇流塔: 718,
            远星大桥: 653,
            栖羽站: 691,
            塔图站: 637,
            黑月游乐城: 664,
            维蒂林场: 583,
            曼德矿场: null
        },
        type: "Normal"
    },
    {
        name: "橄榄油",
        buyPrices: {
            贡露城: 280
        },
        buyLot: {
            贡露城: 45
        },
        sellPrices: {
            荒原站: 336,
            阿妮塔能源研究所: 308,
            海角城: 316,
            曼德矿场: 322,
            澄明数据中心: 358,
            修格里城: 344,
            淘金乐园: 308,
            七号自由港: 344,
            岚心城: 428,
            铁盟哨站: 336,
            阿妮塔战备工厂: 336,
            阿妮塔发射中心: 336,
            云岫桥基地: 358,
            汇流塔: 330,
            远星大桥: 280,
            栖羽站: 400,
            塔图站: 350,
            黑月游乐城: 386,
            维蒂林场: 302,
            贡露城: null
        },
        type: "Normal"
    },
    {
        name: "单晶硅",
        buyPrices: {
            海角城: 1600
        },
        buyLot: {
            海角城: 16
        },
        sellPrices: {
            荒原站: 2320,
            曼德矿场: 2176,
            淘金乐园: 2128,
            七号自由港: 1984,
            阿妮塔能源研究所: 1936,
            澄明数据中心: 2224,
            贡露城: 1840,
            修格里城: 2176,
            岚心城: 2896,
            铁盟哨站: 2272,
            阿妮塔战备工厂: 1984,
            阿妮塔发射中心: 1984,
            云岫桥基地: 2464,
            汇流塔: 1696,
            远星大桥: 1840,
            栖羽站: 2800,
            塔图站: 2368,
            黑月游乐城: 2368,
            维蒂林场: 2032,
            海角城: null
        },
        type: "Special"
    },
    {
        name: "学会书籍",
        buyPrices: {
            海角城: 600
        },
        buyLot: {
            海角城: 32
        },
        sellPrices: {
            曼德矿场: 978,
            淘金乐园: 978,
            七号自由港: 834,
            荒原站: 1122,
            澄明数据中心: 996,
            阿妮塔能源研究所: 762,
            修格里城: 978,
            贡露城: 762,
            岚心城: 1500,
            铁盟哨站: 1050,
            阿妮塔战备工厂: 834,
            阿妮塔发射中心: 834,
            云岫桥基地: 1212,
            汇流塔: 618,
            远星大桥: 762,
            栖羽站: 1428,
            塔图站: 1158,
            黑月游乐城: 1140,
            维蒂林场: 906,
            海角城: null
        },
        type: "Special"
    },
    {
        name: "户外用品",
        buyPrices: {
            海角城: 360
        },
        buyLot: {
            海角城: 32
        },
        sellPrices: {
            修格里城: 443,
            淘金乐园: 432,
            阿妮塔能源研究所: 389,
            七号自由港: 403,
            荒原站: 461,
            澄明数据中心: 432,
            贡露城: 400,
            曼德矿场: 443,
            岚心城: 544,
            铁盟哨站: 457,
            阿妮塔战备工厂: 403,
            阿妮塔发射中心: 403,
            云岫桥基地: 475,
            汇流塔: 360,
            远星大桥: 389,
            栖羽站: 529,
            塔图站: 472,
            黑月游乐城: 472,
            维蒂林场: 428,
            海角城: null
        },
        type: "Normal"
    },
    {
        name: "白兰地",
        buyPrices: {
            贡露城: 780
        },
        buyLot: {
            贡露城: 24
        },
        sellPrices: {
            荒原站: 936,
            七号自由港: 959,
            淘金乐园: 858,
            修格里城: 959,
            澄明数据中心: 975,
            阿妮塔能源研究所: 881,
            曼德矿场: 944,
            海角城: 881,
            岚心城: 1217,
            铁盟哨站: 983,
            阿妮塔战备工厂: 936,
            阿妮塔发射中心: 936,
            云岫桥基地: 975,
            汇流塔: 920,
            远星大桥: 780,
            栖羽站: 1139,
            塔图站: 975,
            黑月游乐城: 1076,
            维蒂林场: 842,
            贡露城: null
        },
        type: "Normal"
    },
    {
        name: "琥珀",
        buyPrices: {
            荒原站: 2240
        },
        buyLot: {
            荒原站: 13
        },
        sellPrices: {
            海角城: 3158,
            曼德矿场: 2419,
            阿妮塔能源研究所: 2867,
            贡露城: 2822,
            修格里城: 2419,
            淘金乐园: 2598,
            澄明数据中心: 2598,
            七号自由港: 2822,
            岚心城: 2934,
            铁盟哨站: 2307,
            阿妮塔战备工厂: 2643,
            阿妮塔发射中心: 2979,
            云岫桥基地: 2486,
            汇流塔: 3226,
            远星大桥: 2755,
            栖羽站: 2822,
            塔图站: 2890,
            黑月游乐城: 2822,
            维蒂林场: 2531,
            荒原站: null
        },
        type: "Special"
    },
    {
        name: "孔雀石",
        buyPrices: {
            荒原站: 1650
        },
        buyLot: {
            荒原站: 17
        },
        sellPrices: {
            修格里城: 1782,
            贡露城: 2079,
            七号自由港: 2079,
            海角城: 2327,
            澄明数据中心: 1865,
            曼德矿场: 1782,
            阿妮塔能源研究所: 2112,
            淘金乐园: 1865,
            岚心城: 2162,
            铁盟哨站: 1700,
            阿妮塔战备工厂: 1947,
            阿妮塔发射中心: 2195,
            云岫桥基地: 1832,
            汇流塔: 2376,
            远星大桥: 2030,
            栖羽站: 2079,
            塔图站: 2079,
            黑月游乐城: 2079,
            维蒂林场: 1865,
            荒原站: null
        },
        type: "Special"
    },
    {
        name: "绿松石",
        buyPrices: {
            荒原站: 1144
        },
        buyLot: {
            荒原站: 19
        },
        sellPrices: {
            贡露城: 1487,
            七号自由港: 1487,
            修格里城: 1247,
            海角城: 1693,
            曼德矿场: 1247,
            淘金乐园: 1316,
            澄明数据中心: 1316,
            阿妮塔能源研究所: 1522,
            岚心城: 1556,
            铁盟哨站: 1178,
            阿妮塔战备工厂: 1384,
            阿妮塔发射中心: 1590,
            云岫桥基地: 1281,
            汇流塔: 1727,
            远星大桥: 1453,
            栖羽站: 1487,
            塔图站: 1487,
            黑月游乐城: 1487,
            维蒂林场: 1316,
            荒原站: null
        },
        type: "Special"
    },
    {
        name: "铅矿石",
        buyPrices: {
            荒原站: 678
        },
        buyLot: {
            荒原站: 29
        },
        sellPrices: {
            修格里城: 719,
            曼德矿场: 698,
            海角城: 841,
            七号自由港: 780,
            贡露城: 759,
            阿妮塔能源研究所: 820,
            淘金乐园: 739,
            澄明数据中心: 739,
            岚心城: 780,
            铁盟哨站: 698,
            阿妮塔战备工厂: 759,
            阿妮塔发射中心: 800,
            云岫桥基地: 698,
            汇流塔: 841,
            远星大桥: 800,
            栖羽站: 759,
            塔图站: 759,
            黑月游乐城: 759,
            维蒂林场: 739,
            荒原站: null
        },
        type: "Normal"
    },
    {
        name: "石墨",
        buyPrices: {
            荒原站: 384
        },
        buyLot: {
            荒原站: 37
        },
        sellPrices: {
            曼德矿场: 396,
            七号自由港: 453,
            澄明数据中心: 419,
            阿妮塔能源研究所: 465,
            修格里城: 407,
            淘金乐园: 419,
            贡露城: 442,
            海角城: 476,
            岚心城: 465,
            铁盟哨站: 396,
            阿妮塔战备工厂: 430,
            阿妮塔发射中心: 465,
            云岫桥基地: 396,
            汇流塔: 476,
            远星大桥: 442,
            栖羽站: 453,
            塔图站: 430,
            黑月游乐城: 430,
            维蒂林场: 419,
            荒原站: null
        },
        type: "Normal"
    },
    {
        name: "靛红五月军用食品",
        buyPrices: {
            铁盟哨站: 177
        },
        buyLot: {
            铁盟哨站: 47
        },
        sellPrices: {
            澄明数据中心: 191,
            七号自由港: 204,
            阿妮塔能源研究所: 218,
            修格里城: 182,
            淘金乐园: 195,
            海角城: 235,
            曼德矿场: 177,
            贡露城: 212,
            岚心城: 241,
            荒原站: 177,
            阿妮塔战备工厂: 200,
            阿妮塔发射中心: 227,
            云岫桥基地: 200,
            汇流塔: 244,
            远星大桥: 218,
            栖羽站: 221,
            塔图站: 212,
            黑月游乐城: 204,
            维蒂林场: 200,
            铁盟哨站: null
        },
        type: "Normal"
    },
    {
        name: "土豆",
        buyPrices: {
            荒原站: 61
        },
        buyLot: {
            荒原站: 53
        },
        sellPrices: {
            曼德矿场: 66,
            七号自由港: 82,
            海角城: 99,
            淘金乐园: 71,
            修格里城: 66,
            阿妮塔能源研究所: 87,
            贡露城: 84,
            澄明数据中心: 73,
            岚心城: 85,
            铁盟哨站: 63,
            阿妮塔战备工厂: 76,
            阿妮塔发射中心: 90,
            云岫桥基地: 66,
            汇流塔: 99,
            远星大桥: 82,
            栖羽站: 81,
            塔图站: 82,
            黑月游乐城: 81,
            维蒂林场: 73,
            荒原站: null
        },
        type: "Normal"
    },
    {
        name: "沙金",
        buyPrices: {
            淘金乐园: 2700
        },
        buyLot: {
            淘金乐园: 11
        },
        sellPrices: {
            修格里城: 2943,
            七号自由港: 3186,
            海角城: 3186,
            荒原站: 2943,
            曼德矿场: 2862,
            贡露城: 3024,
            阿妮塔能源研究所: 3267,
            澄明数据中心: 3024,
            岚心城: 3429,
            铁盟哨站: 2943,
            阿妮塔战备工厂: 3105,
            阿妮塔发射中心: 3348,
            云岫桥基地: 3024,
            汇流塔: 3348,
            远星大桥: 3024,
            栖羽站: 3348,
            塔图站: 2943,
            黑月游乐城: 3186,
            维蒂林场: 2862,
            淘金乐园: null
        },
        type: "Special"
    },
    {
        name: "玛瑙",
        buyPrices: {
            淘金乐园: 1728
        },
        buyLot: {
            淘金乐园: 17
        },
        sellPrices: {
            七号自由港: 2212,
            海角城: 2264,
            荒原站: 1953,
            曼德矿场: 1866,
            澄明数据中心: 2039,
            修格里城: 1953,
            贡露城: 2004,
            阿妮塔能源研究所: 2212,
            岚心城: 2436,
            铁盟哨站: 1953,
            阿妮塔战备工厂: 2125,
            阿妮塔发射中心: 2385,
            云岫桥基地: 2039,
            汇流塔: 2402,
            远星大桥: 2039,
            栖羽站: 2350,
            塔图站: 1953,
            黑月游乐城: 2212,
            维蒂林场: 1866,
            淘金乐园: null
        },
        type: "Special"
    },
    {
        name: "石英砂",
        buyPrices: {
            淘金乐园: 233
        },
        buyLot: {
            淘金乐园: 47
        },
        sellPrices: {
            荒原站: 266,
            七号自由港: 322,
            曼德矿场: 249,
            澄明数据中心: 289,
            海角城: 322,
            阿妮塔能源研究所: 315,
            修格里城: 266,
            贡露城: 266,
            岚心城: 347,
            铁盟哨站: 273,
            阿妮塔战备工厂: 298,
            阿妮塔发射中心: 347,
            云岫桥基地: 282,
            汇流塔: 338,
            远星大桥: 289,
            栖羽站: 331,
            塔图站: 266,
            黑月游乐城: 315,
            维蒂林场: 249,
            淘金乐园: null
        },
        type: "Normal"
    },
    {
        name: "金箔酒",
        buyPrices: {
            岚心城: 2333
        },
        buyLot: {
            岚心城: 15
        },
        sellPrices: {
            贡露城: 3639,
            阿妮塔能源研究所: 3569,
            七号自由港: 3453,
            淘金乐园: 3220,
            修格里城: 3290,
            荒原站: 2986,
            海角城: 3803,
            曼德矿场: 3103,
            澄明数据中心: 3336,
            铁盟哨站: 3173,
            阿妮塔战备工厂: 3453,
            阿妮塔发射中心: 3686,
            云岫桥基地: 2870,
            汇流塔: 3919,
            远星大桥: 3569,
            栖羽站: 2520,
            塔图站: 3500,
            黑月游乐城: 3569,
            维蒂林场: 3336,
            岚心城: null
        },
        type: "Special"
    },
    {
        name: "刀具",
        buyPrices: {
            岚心城: 1873
        },
        buyLot: {
            岚心城: 18
        },
        sellPrices: {
            淘金乐园: 2585,
            海角城: 3053,
            贡露城: 2922,
            阿妮塔能源研究所: 2866,
            七号自由港: 2772,
            荒原站: 2397,
            修格里城: 2641,
            曼德矿场: 2491,
            澄明数据中心: 2678,
            铁盟哨站: 2547,
            阿妮塔战备工厂: 2828,
            阿妮塔发射中心: 2959,
            云岫桥基地: 2304,
            汇流塔: 3147,
            远星大桥: 2866,
            栖羽站: 2023,
            塔图站: 2922,
            黑月游乐城: 2866,
            维蒂林场: 2735,
            岚心城: null
        },
        type: "Special"
    },
    {
        name: "折扇",
        buyPrices: {
            岚心城: 733
        },
        buyLot: {
            岚心城: 27
        },
        sellPrices: {
            曼德矿场: 1195,
            七号自由港: 1415,
            淘金乐园: 1268,
            阿妮塔能源研究所: 1488,
            荒原站: 1121,
            海角城: 1635,
            修格里城: 1290,
            澄明数据中心: 1341,
            贡露城: 1532,
            铁盟哨站: 1195,
            阿妮塔战备工厂: 1415,
            阿妮塔发射中心: 1561,
            云岫桥基地: 1048,
            汇流塔: 1708,
            远星大桥: 1488,
            栖羽站: 828,
            塔图站: 1532,
            黑月游乐城: 1488,
            维蒂林场: 1341,
            岚心城: null
        },
        type: "Special"
    },
    {
        name: "画材",
        buyPrices: {
            岚心城: 563
        },
        buyLot: {
            岚心城: 36
        },
        sellPrices: {
            曼德矿场: 698,
            七号自由港: 799,
            海角城: 884,
            荒原站: 676,
            阿妮塔能源研究所: 788,
            贡露城: 822,
            修格里城: 721,
            澄明数据中心: 743,
            淘金乐园: 721,
            铁盟哨站: 698,
            阿妮塔战备工厂: 766,
            阿妮塔发射中心: 811,
            云岫桥基地: 653,
            汇流塔: 906,
            远星大桥: 788,
            栖羽站: 586,
            塔图站: 788,
            黑月游乐城: 788,
            维蒂林场: 743,
            岚心城: null
        },
        type: "Normal"
    },
    {
        name: "荧光棒",
        buyPrices: {
            澄明数据中心: 416
        },
        buyLot: {
            澄明数据中心: 35
        },
        sellPrices: {
            海角城: 532,
            贡露城: 532,
            修格里城: 449,
            七号自由港: 470,
            荒原站: 458,
            曼德矿场: 470,
            阿妮塔能源研究所: 478,
            岚心城: 595,
            淘金乐园: 478,
            铁盟哨站: 449,
            阿妮塔战备工厂: 437,
            阿妮塔发射中心: 499,
            云岫桥基地: 499,
            汇流塔: 532,
            远星大桥: 520,
            栖羽站: 574,
            塔图站: 541,
            黑月游乐城: 470,
            维蒂林场: 499,
            澄明数据中心: null
        },
        type: "Normal"
    },
    {
        name: "录像带",
        buyPrices: {
            澄明数据中心: 512
        },
        buyLot: {
            澄明数据中心: 30
        },
        sellPrices: {
            修格里城: 543,
            贡露城: 589,
            海角城: 589,
            阿妮塔能源研究所: 558,
            荒原站: 543,
            曼德矿场: 543,
            七号自由港: 543,
            淘金乐园: 558,
            岚心城: 666,
            铁盟哨站: 543,
            阿妮塔战备工厂: 527,
            阿妮塔发射中心: 573,
            云岫桥基地: 573,
            汇流塔: 589,
            远星大桥: 589,
            栖羽站: 650,
            塔图站: 635,
            黑月游乐城: 543,
            维蒂林场: 573,
            澄明数据中心: null
        },
        type: "Normal"
    },
    {
        name: "录音带",
        buyPrices: {
            澄明数据中心: 256
        },
        buyLot: {
            澄明数据中心: 50
        },
        sellPrices: {
            海角城: 294,
            修格里城: 271,
            贡露城: 294,
            荒原站: 271,
            曼德矿场: 271,
            阿妮塔能源研究所: 279,
            七号自由港: 271,
            淘金乐园: 279,
            岚心城: 333,
            铁盟哨站: 271,
            阿妮塔战备工厂: 264,
            阿妮塔发射中心: 287,
            云岫桥基地: 287,
            汇流塔: 294,
            远星大桥: 294,
            栖羽站: 325,
            塔图站: 317,
            黑月游乐城: 271,
            维蒂林场: 287,
            澄明数据中心: null
        },
        type: "Normal"
    },
    {
        name: "纳豆",
        buyPrices: {
            岚心城: 163
        },
        buyLot: {
            岚心城: 45
        },
        sellPrices: {
            荒原站: 245,
            淘金乐园: 277,
            修格里城: 277,
            贡露城: 331,
            七号自由港: 315,
            曼德矿场: 261,
            海角城: 359,
            澄明数据中心: 293,
            阿妮塔能源研究所: 326,
            铁盟哨站: 261,
            阿妮塔战备工厂: 310,
            阿妮塔发射中心: 342,
            云岫桥基地: 228,
            汇流塔: 375,
            远星大桥: 326,
            栖羽站: 184,
            塔图站: 326,
            黑月游乐城: 326,
            维蒂林场: 293,
            岚心城: null
        },
        type: "Normal"
    },
    {
        name: "杯面",
        buyPrices: {
            岚心城: 53
        },
        buyLot: {
            岚心城: 60
        },
        sellPrices: {
            七号自由港: 82,
            修格里城: 75,
            淘金乐园: 77,
            曼德矿场: 74,
            阿妮塔能源研究所: 86,
            荒原站: 70,
            贡露城: 85,
            海角城: 91,
            澄明数据中心: 82,
            铁盟哨站: 74,
            阿妮塔战备工厂: 83,
            阿妮塔发射中心: 90,
            云岫桥基地: 67,
            汇流塔: 94,
            远星大桥: 86,
            栖羽站: 56,
            塔图站: 88,
            黑月游乐城: 85,
            维蒂林场: 80,
            岚心城: null
        },
        type: "Normal"
    },
    {
        name: "阿妮塔小型桦树发电机",
        buyPrices: {
            阿妮塔能源研究所: 6912
        },
        buyLot: {
            阿妮塔能源研究所: 1
        },
        sellPrices: {
            曼德矿场: 8018,
            修格里城: 7741,
            淘金乐园: 8018,
            七号自由港: 7465,
            荒原站: 8018,
            澄明数据中心: 7741,
            海角城: 7603,
            贡露城: 7603,
            岚心城: 8916,
            铁盟哨站: 7880,
            阿妮塔战备工厂: 7465,
            阿妮塔发射中心: 7465,
            云岫桥基地: 8364,
            汇流塔: 7603,
            远星大桥: 7603,
            栖羽站: 8778,
            塔图站: 8502,
            黑月游乐城: 8225,
            维蒂林场: 7880,
            阿妮塔能源研究所: null
        },
        type: "Special"
    },
    {
        name: "石墨烯电池",
        buyPrices: {
            阿妮塔能源研究所: 3840
        },
        buyLot: {
            阿妮塔能源研究所: 7
        },
        sellPrices: {
            曼德矿场: 4646,
            修格里城: 4416,
            荒原站: 4531,
            澄明数据中心: 4416,
            海角城: 4301,
            贡露城: 4301,
            七号自由港: 4070,
            淘金乐园: 4646,
            岚心城: 5338,
            铁盟哨站: 4531,
            阿妮塔战备工厂: 4070,
            阿妮塔发射中心: 4070,
            云岫桥基地: 4762,
            汇流塔: 4301,
            远星大桥: 4186,
            栖羽站: 5222,
            塔图站: 4877,
            黑月游乐城: 4646,
            维蒂林场: 4531,
            阿妮塔能源研究所: null
        },
        type: "Special",
        craft: {
            石墨烯: 0.25,
            锂电池: 0.75
        }
    },
    {
        name: "阿妮塔101民用无人机",
        buyPrices: {
            阿妮塔能源研究所: 1536
        },
        buyLot: {
            阿妮塔能源研究所: 14
        },
        sellPrices: {
            曼德矿场: 2012,
            荒原站: 1966,
            七号自由港: 1659,
            修格里城: 1859,
            淘金乐园: 2012,
            贡露城: 1782,
            海角城: 1782,
            澄明数据中心: 1859,
            岚心城: 2396,
            铁盟哨站: 1935,
            阿妮塔战备工厂: 1659,
            阿妮塔发射中心: 1659,
            云岫桥基地: 2135,
            汇流塔: 1782,
            远星大桥: 1782,
            栖羽站: 2319,
            塔图站: 2166,
            黑月游乐城: 2012,
            维蒂林场: 1935,
            阿妮塔能源研究所: null
        },
        type: "Special"
    },
    {
        name: "家用太阳能电池组",
        buyPrices: {
            阿妮塔能源研究所: 1152
        },
        buyLot: {
            阿妮塔能源研究所: 21
        },
        sellPrices: {
            修格里城: 1394,
            贡露城: 1336,
            淘金乐园: 1475,
            荒原站: 1475,
            澄明数据中心: 1394,
            七号自由港: 1244,
            海角城: 1302,
            曼德矿场: 1475,
            岚心城: 1797,
            铁盟哨站: 1452,
            阿妮塔战备工厂: 1244,
            阿妮塔发射中心: 1244,
            云岫桥基地: 1567,
            汇流塔: 1302,
            远星大桥: 1302,
            栖羽站: 1740,
            塔图站: 1659,
            黑月游乐城: 1544,
            维蒂林场: 1452,
            阿妮塔能源研究所: null
        },
        type: "Special"
    },
    {
        name: "锂电池",
        buyPrices: {
            阿妮塔能源研究所: 768
        },
        buyLot: {
            阿妮塔能源研究所: 28
        },
        sellPrices: {
            贡露城: 829,
            七号自由港: 822,
            修格里城: 860,
            淘金乐园: 945,
            曼德矿场: 922,
            荒原站: 922,
            海角城: 829,
            澄明数据中心: 906,
            岚心城: 1121,
            铁盟哨站: 914,
            阿妮塔战备工厂: 799,
            阿妮塔发射中心: 799,
            云岫桥基地: 975,
            汇流塔: 829,
            远星大桥: 829,
            栖羽站: 1091,
            塔图站: 1006,
            黑月游乐城: 945,
            维蒂林场: 914,
            阿妮塔能源研究所: null
        },
        type: "Normal"
    },
    {
        name: "充电电池",
        buyPrices: {
            阿妮塔能源研究所: 288
        },
        buyLot: {
            阿妮塔能源研究所: 42
        },
        sellPrices: {
            七号自由港: 308,
            曼德矿场: 346,
            贡露城: 311,
            荒原站: 346,
            澄明数据中心: 340,
            修格里城: 323,
            淘金乐园: 354,
            海角城: 311,
            岚心城: 420,
            铁盟哨站: 343,
            阿妮塔战备工厂: 300,
            阿妮塔发射中心: 300,
            云岫桥基地: 366,
            汇流塔: 311,
            远星大桥: 320,
            栖羽站: 409,
            塔图站: 377,
            黑月游乐城: 354,
            维蒂林场: 334,
            阿妮塔能源研究所: null
        },
        type: "Normal"
    },
    {
        name: "金箔",
        buyPrices: {},
        buyLot: {},
        sellPrices: {
            澄明数据中心: 3978,
            阿妮塔能源研究所: 4266,
            贡露城: 3996,
            海角城: 4158,
            荒原站: 3888,
            岚心城: 4446,
            曼德矿场: 3798,
            七号自由港: 4158,
            淘金乐园: 3600,
            铁盟哨站: 3888,
            修格里城: 3888,
            阿妮塔战备工厂: 4068,
            阿妮塔发射中心: 4338,
            云岫桥基地: 3978,
            汇流塔: 4356,
            远星大桥: 3978,
            栖羽站: 4356,
            塔图站: 3888,
            黑月游乐城: 4158,
            维蒂林场: 3798
        },
        type: "Craft",
        craft: {
            沙金: 0.5
        }
    },
    {
        name: "游戏卡带",
        buyPrices: {
            澄明数据中心: 648
        },
        buyLot: {
            澄明数据中心: 30
        },
        sellPrices: {
            淘金乐园: 881,
            修格里城: 732,
            海角城: 1011,
            曼德矿场: 816,
            七号自由港: 797,
            贡露城: 1011,
            阿妮塔能源研究所: 881,
            荒原站: 816,
            岚心城: 1205,
            铁盟哨站: 732,
            阿妮塔战备工厂: 752,
            阿妮塔发射中心: 946,
            云岫桥基地: 966,
            汇流塔: 1011,
            远星大桥: 991,
            栖羽站: 1140,
            塔图站: 1095,
            黑月游乐城: 816,
            维蒂林场: 927,
            澄明数据中心: null
        },
        type: "Special"
    },
    {
        name: "游戏机",
        buyPrices: {
            澄明数据中心: 3200
        },
        buyLot: {
            澄明数据中心: 10
        },
        sellPrices: {
            淘金乐园: 3776,
            修格里城: 3424,
            阿妮塔能源研究所: 3776,
            曼德矿场: 3648,
            海角城: 4032,
            荒原站: 3648,
            七号自由港: 3552,
            贡露城: 4032,
            岚心城: 4416,
            铁盟哨站: 3424,
            阿妮塔战备工厂: 3520,
            阿妮塔发射中心: 3904,
            云岫桥基地: 4000,
            汇流塔: 4032,
            远星大桥: 3936,
            栖羽站: 4288,
            塔图站: 4256,
            黑月游乐城: 3648,
            维蒂林场: 3808,
            澄明数据中心: null
        },
        type: "Special"
    },
    {
        name: "扬声器",
        buyPrices: {
            澄明数据中心: 960
        },
        buyLot: {
            澄明数据中心: 20
        },
        sellPrices: {
            修格里城: 1037,
            曼德矿场: 1085,
            贡露城: 1229,
            荒原站: 1085,
            阿妮塔能源研究所: 1133,
            七号自由港: 1085,
            淘金乐园: 1133,
            海角城: 1229,
            岚心城: 1402,
            铁盟哨站: 1037,
            阿妮塔战备工厂: 1037,
            阿妮塔发射中心: 1181,
            云岫桥基地: 1181,
            汇流塔: 1229,
            远星大桥: 1229,
            栖羽站: 1354,
            塔图站: 1306,
            黑月游乐城: 1085,
            维蒂林场: 1181,
            澄明数据中心: null
        },
        type: "Special"
    },
    {
        name: "火车玩具",
        buyPrices: {
            澄明数据中心: 320
        },
        buyLot: {
            澄明数据中心: 40
        },
        sellPrices: {
            贡露城: 400,
            淘金乐园: 378,
            修格里城: 336,
            荒原站: 352,
            七号自由港: 362,
            阿妮塔能源研究所: 368,
            曼德矿场: 362,
            海角城: 400,
            岚心城: 467,
            铁盟哨站: 336,
            阿妮塔战备工厂: 336,
            阿妮塔发射中心: 384,
            云岫桥基地: 384,
            汇流塔: 400,
            远星大桥: 400,
            栖羽站: 442,
            塔图站: 416,
            黑月游乐城: 371,
            维蒂林场: 384,
            澄明数据中心: null
        },
        type: "Normal"
    },
    {
        name: "漆黑矿渣",
        buyPrices: {
            淘金乐园: 555
        },
        buyLot: {
            淘金乐园: 37
        },
        sellPrices: {
            贡露城: 622,
            修格里城: 622,
            七号自由港: 738,
            海角城: 722,
            曼德矿场: 588,
            荒原站: 622,
            阿妮塔能源研究所: 738,
            澄明数据中心: 672,
            岚心城: 788,
            铁盟哨站: 655,
            阿妮塔战备工厂: 705,
            阿妮塔发射中心: 805,
            云岫桥基地: 655,
            汇流塔: 771,
            远星大桥: 655,
            栖羽站: 755,
            塔图站: 622,
            黑月游乐城: 722,
            维蒂林场: 588,
            淘金乐园: null
        },
        type: "Normal"
    },
    {
        name: "图形加速卡",
        buyPrices: {
            曼德矿场: 3072
        },
        buyLot: {
            曼德矿场: 12
        },
        sellPrices: {
            贡露城: 3717,
            修格里城: 3410,
            阿妮塔能源研究所: 3932,
            七号自由港: 3871,
            淘金乐园: 3318,
            澄明数据中心: 3564,
            海角城: 4024,
            荒原站: 3318,
            岚心城: 4270,
            铁盟哨站: 3256,
            阿妮塔战备工厂: 3625,
            阿妮塔发射中心: 4086,
            云岫桥基地: 3564,
            汇流塔: 4270,
            远星大桥: 3625,
            栖羽站: 4116,
            塔图站: 3717,
            黑月游乐城: 3871,
            维蒂林场: 3318,
            曼德矿场: null
        },
        type: "Special"
    },
    {
        name: "随身听",
        buyPrices: {
            岚心城: 1193
        },
        buyLot: {
            岚心城: 21
        },
        sellPrices: {
            七号自由港: 1801,
            修格里城: 1682,
            曼德矿场: 1622,
            贡露城: 1861,
            海角城: 1980,
            荒原站: 1527,
            淘金乐园: 1646,
            阿妮塔能源研究所: 1825,
            澄明数据中心: 1778,
            铁盟哨站: 1622,
            阿妮塔战备工厂: 1766,
            阿妮塔发射中心: 1885,
            云岫桥基地: 1467,
            汇流塔: 2040,
            远星大桥: 1825,
            栖羽站: 1288,
            塔图站: 1861,
            黑月游乐城: 1825,
            维蒂林场: 1742,
            岚心城: null
        },
        type: "Special"
    },
    {
        name: "银矿石",
        buyPrices: {
            澄明数据中心: 2500
        },
        buyLot: {
            澄明数据中心: 10
        },
        sellPrices: {
            阿妮塔能源研究所: 2875,
            贡露城: 3025,
            海角城: 3025,
            荒原站: 2725,
            岚心城: 3250,
            曼德矿场: 2725,
            七号自由港: 2725,
            淘金乐园: 2800,
            修格里城: 2650,
            铁盟哨站: 2650,
            阿妮塔战备工厂: 2650,
            阿妮塔发射中心: 2875,
            云岫桥基地: 2950,
            汇流塔: 3100,
            远星大桥: 2950,
            栖羽站: 3175,
            塔图站: 3100,
            黑月游乐城: 2800,
            维蒂林场: 2875,
            澄明数据中心: null
        },
        type: "Special"
    },
    {
        name: "青金石",
        buyPrices: {
            淘金乐园: 1920
        },
        buyLot: {
            淘金乐园: 13
        },
        sellPrices: {
            七号自由港: 2458,
            阿妮塔能源研究所: 2458,
            澄明数据中心: 2266,
            修格里城: 2170,
            荒原站: 2170,
            曼德矿场: 2074,
            贡露城: 2227,
            海角城: 2515,
            岚心城: 2707,
            铁盟哨站: 2170,
            阿妮塔战备工厂: 2362,
            阿妮塔发射中心: 2650,
            云岫桥基地: 2266,
            汇流塔: 2669,
            远星大桥: 2266,
            栖羽站: 2611,
            塔图站: 2170,
            黑月游乐城: 2458,
            维蒂林场: 2074,
            淘金乐园: null
        },
        type: "Special"
    },
    {
        name: "精钢",
        buyPrices: {
            铁盟哨站: 1370
        },
        buyLot: {
            铁盟哨站: 17
        },
        sellPrices: {
            七号自由港: 1658,
            修格里城: 1411,
            曼德矿场: 1452,
            澄明数据中心: 1480,
            荒原站: 1411,
            淘金乐园: 1589,
            阿妮塔能源研究所: 1726,
            贡露城: 1726,
            海角城: 1863,
            岚心城: 1863,
            阿妮塔战备工厂: 1589,
            阿妮塔发射中心: 1795,
            云岫桥基地: 1589,
            汇流塔: 1932,
            远星大桥: 1726,
            栖羽站: 1795,
            塔图站: 1726,
            黑月游乐城: 1617,
            维蒂林场: 1548,
            铁盟哨站: null
        },
        type: "Special",
        craft: {
            铁矿石: 0.375
        }
    },
    {
        name: "火澄石",
        buyPrices: {
            阿妮塔战备工厂: 7000
        },
        buyLot: {
            阿妮塔战备工厂: 2
        },
        sellPrices: {
            七号自由港: 7385,
            修格里城: 7560,
            曼德矿场: 7735,
            澄明数据中心: 7385,
            贡露城: 8120,
            海角城: 7735,
            荒原站: 7735,
            淘金乐园: 8120,
            阿妮塔能源研究所: 7595,
            铁盟哨站: 7770,
            阿妮塔发射中心: 7770,
            岚心城: 8995,
            云岫桥基地: 8120,
            汇流塔: 8120,
            远星大桥: 7735,
            栖羽站: 8820,
            塔图站: 8855,
            黑月游乐城: 7945,
            维蒂林场: 8085,
            阿妮塔战备工厂: null
        },
        type: "Special"
    },
    {
        name: "防弹背心",
        buyPrices: {
            铁盟哨站: 2847
        },
        buyLot: {
            铁盟哨站: 10
        },
        sellPrices: {
            七号自由港: 3359,
            修格里城: 2932,
            曼德矿场: 2932,
            澄明数据中心: 3132,
            荒原站: 2932,
            淘金乐园: 3246,
            阿妮塔能源研究所: 3473,
            贡露城: 3473,
            海角城: 3701,
            岚心城: 3701,
            阿妮塔战备工厂: 3246,
            阿妮塔发射中心: 3587,
            云岫桥基地: 3246,
            汇流塔: 3815,
            远星大桥: 3473,
            栖羽站: 3587,
            塔图站: 3473,
            黑月游乐城: 3359,
            维蒂林场: 3246,
            铁盟哨站: null
        },
        type: "Special",
        craft: {
            尼龙: 0.1875,
            芳纶纤维: 0.1875,
            钛合金: 0.1875,
            缝纫工具包: 0.1875
        }
    },
    {
        name: "炮弹",
        buyPrices: {
            铁盟哨站: 1710
        },
        buyLot: {
            铁盟哨站: 15
        },
        sellPrices: {
            七号自由港: 1915,
            修格里城: 1710,
            曼德矿场: 1761,
            澄明数据中心: 1813,
            荒原站: 1761,
            淘金乐园: 1864,
            阿妮塔能源研究所: 1967,
            贡露城: 1967,
            海角城: 2069,
            岚心城: 2120,
            阿妮塔战备工厂: 1915,
            阿妮塔发射中心: 2069,
            云岫桥基地: 1915,
            汇流塔: 2120,
            远星大桥: 2018,
            栖羽站: 2069,
            塔图站: 2018,
            黑月游乐城: 1915,
            维蒂林场: 1915,
            铁盟哨站: null
        },
        type: "Normal"
    },
    {
        name: "塑胶炸药",
        buyPrices: {
            铁盟哨站: 827
        },
        buyLot: {
            铁盟哨站: 20
        },
        sellPrices: {
            七号自由港: 951,
            修格里城: 827,
            曼德矿场: 852,
            澄明数据中心: 885,
            荒原站: 852,
            淘金乐园: 943,
            阿妮塔能源研究所: 984,
            贡露城: 1009,
            海角城: 1075,
            岚心城: 1075,
            阿妮塔战备工厂: 943,
            阿妮塔发射中心: 1042,
            云岫桥基地: 918,
            汇流塔: 1108,
            远星大桥: 1009,
            栖羽站: 1017,
            塔图站: 1009,
            黑月游乐城: 951,
            维蒂林场: 943,
            铁盟哨站: null
        },
        type: "Normal"
    },
    {
        name: "子弹",
        buyPrices: {
            铁盟哨站: 677
        },
        buyLot: {
            铁盟哨站: 20
        },
        sellPrices: {
            七号自由港: 758,
            修格里城: 677,
            曼德矿场: 697,
            澄明数据中心: 718,
            荒原站: 697,
            淘金乐园: 758,
            阿妮塔能源研究所: 779,
            贡露城: 799,
            海角城: 839,
            岚心城: 839,
            阿妮塔战备工厂: 758,
            阿妮塔发射中心: 819,
            云岫桥基地: 758,
            汇流塔: 860,
            远星大桥: 799,
            栖羽站: 819,
            塔图站: 799,
            黑月游乐城: 758,
            维蒂林场: 758,
            铁盟哨站: null
        },
        type: "Normal"
    },
    {
        name: "汽油",
        buyPrices: {
            铁盟哨站: 570
        },
        buyLot: {
            铁盟哨站: 27
        },
        sellPrices: {
            七号自由港: 656,
            修格里城: 587,
            曼德矿场: 587,
            澄明数据中心: 604,
            荒原站: 587,
            淘金乐园: 638,
            阿妮塔能源研究所: 673,
            贡露城: 673,
            海角城: 707,
            岚心城: 707,
            阿妮塔战备工厂: 638,
            阿妮塔发射中心: 707,
            云岫桥基地: 638,
            汇流塔: 724,
            远星大桥: 673,
            栖羽站: 690,
            塔图站: 638,
            黑月游乐城: 638,
            维蒂林场: 638,
            铁盟哨站: null
        },
        type: "Normal"
    },
    {
        name: "纯金线材",
        buyPrices: {},
        buyLot: {},
        sellPrices: {
            澄明数据中心: 7891,
            阿妮塔能源研究所: 8208,
            贡露城: 7949,
            海角城: 8208,
            荒原站: 7733,
            岚心城: 8525,
            曼德矿场: 7574,
            七号自由港: 8208,
            淘金乐园: 7200,
            铁盟哨站: 7733,
            修格里城: 7733,
            阿妮塔战备工厂: 8050,
            阿妮塔发射中心: 8525,
            云岫桥基地: 7891,
            汇流塔: 8582,
            远星大桥: 7891,
            栖羽站: 8366,
            塔图站: 7733,
            黑月游乐城: 8208,
            维蒂林场: 7574
        },
        type: "Craft",
        craft: {
            金箔: 1.5
        }
    },
    {
        name: "阿妮塔202军用无人机",
        buyPrices: {
            阿妮塔战备工厂: 3500
        },
        buyLot: {
            阿妮塔战备工厂: 7
        },
        sellPrices: {
            七号自由港: 3710,
            修格里城: 3815,
            曼德矿场: 3920,
            澄明数据中心: 3710,
            贡露城: 4025,
            海角城: 3920,
            荒原站: 3920,
            淘金乐园: 4025,
            阿妮塔能源研究所: 3710,
            铁盟哨站: 3920,
            阿妮塔发射中心: 3815,
            岚心城: 4655,
            云岫桥基地: 4130,
            汇流塔: 4025,
            远星大桥: 4025,
            栖羽站: 4550,
            塔图站: 4550,
            黑月游乐城: 4025,
            维蒂林场: 4130,
            阿妮塔战备工厂: null
        },
        type: "Special"
    },
    {
        name: "负片炮弹",
        buyPrices: {
            阿妮塔战备工厂: 4200
        },
        buyLot: {
            阿妮塔战备工厂: 4
        },
        sellPrices: {
            七号自由港: 4431,
            修格里城: 4536,
            曼德矿场: 4641,
            澄明数据中心: 4431,
            贡露城: 4746,
            海角城: 4641,
            荒原站: 4641,
            淘金乐园: 4746,
            阿妮塔能源研究所: 4431,
            铁盟哨站: 4662,
            阿妮塔发射中心: 4536,
            岚心城: 5397,
            云岫桥基地: 4872,
            汇流塔: 4746,
            远星大桥: 4641,
            栖羽站: 5292,
            塔图站: 5313,
            黑月游乐城: 4767,
            维蒂林场: 4851,
            阿妮塔战备工厂: null
        },
        type: "Special"
    },
    {
        name: "碳纤维",
        buyPrices: {
            阿妮塔战备工厂: 1401
        },
        buyLot: {
            阿妮塔战备工厂: 18
        },
        sellPrices: {
            七号自由港: 1499,
            修格里城: 1555,
            曼德矿场: 1611,
            澄明数据中心: 1499,
            贡露城: 1667,
            海角城: 1611,
            荒原站: 1611,
            淘金乐园: 1667,
            阿妮塔能源研究所: 1541,
            铁盟哨站: 1597,
            阿妮塔发射中心: 1597,
            岚心城: 1989,
            云岫桥基地: 1709,
            汇流塔: 1709,
            远星大桥: 1653,
            栖羽站: 1933,
            塔图站: 1919,
            黑月游乐城: 1653,
            维蒂林场: 1723,
            阿妮塔战备工厂: null
        },
        type: "Special"
    },
    {
        name: "抗污染防护服",
        buyPrices: {
            阿妮塔战备工厂: 2800
        },
        buyLot: {
            阿妮塔战备工厂: 11
        },
        sellPrices: {
            七号自由港: 2996,
            修格里城: 3108,
            曼德矿场: 3220,
            澄明数据中心: 3080,
            贡露城: 3332,
            海角城: 3220,
            荒原站: 3304,
            淘金乐园: 3416,
            阿妮塔能源研究所: 2996,
            铁盟哨站: 3192,
            阿妮塔发射中心: 3108,
            岚心城: 3976,
            云岫桥基地: 3416,
            汇流塔: 3416,
            远星大桥: 3304,
            栖羽站: 3864,
            塔图站: 3836,
            黑月游乐城: 3304,
            维蒂林场: 3444,
            阿妮塔战备工厂: null
        },
        type: "Special",
        craft: {
            无纺布: 0.375,
            碳纤维: 0.375,
            缝纫工具包: 0.1875
        }
    },
    {
        name: "形态共振瞄准器",
        buyPrices: {
            阿妮塔战备工厂: 1050
        },
        buyLot: {
            阿妮塔战备工厂: 18
        },
        sellPrices: {
            七号自由港: 1103,
            修格里城: 1155,
            曼德矿场: 1208,
            澄明数据中心: 1103,
            贡露城: 1260,
            海角城: 1208,
            荒原站: 1239,
            淘金乐园: 1292,
            阿妮塔能源研究所: 1103,
            铁盟哨站: 1187,
            阿妮塔发射中心: 1155,
            岚心城: 1523,
            云岫桥基地: 1260,
            汇流塔: 1260,
            远星大桥: 1239,
            栖羽站: 1470,
            塔图站: 1449,
            黑月游乐城: 1208,
            维蒂林场: 1313,
            阿妮塔战备工厂: null
        },
        type: "Normal"
    },
    {
        name: "高导磁硅钢片",
        buyPrices: {
            阿妮塔战备工厂: 840
        },
        buyLot: {
            阿妮塔战备工厂: 29
        },
        sellPrices: {
            七号自由港: 907,
            修格里城: 949,
            曼德矿场: 1016,
            澄明数据中心: 907,
            贡露城: 1008,
            海角城: 966,
            荒原站: 966,
            淘金乐园: 1033,
            阿妮塔能源研究所: 907,
            铁盟哨站: 949,
            阿妮塔发射中心: 949,
            岚心城: 1268,
            云岫桥基地: 1008,
            汇流塔: 1008,
            远星大桥: 991,
            栖羽站: 1226,
            塔图站: 1134,
            黑月游乐城: 966,
            维蒂林场: 1050,
            阿妮塔战备工厂: null
        },
        type: "Normal"
    },
    {
        name: "黄铜线圈",
        buyPrices: {
            阿妮塔战备工厂: 700
        },
        buyLot: {
            阿妮塔战备工厂: 47
        },
        sellPrices: {
            七号自由港: 756,
            修格里城: 791,
            曼德矿场: 805,
            澄明数据中心: 756,
            贡露城: 840,
            海角城: 805,
            荒原站: 805,
            淘金乐园: 840,
            阿妮塔能源研究所: 756,
            铁盟哨站: 770,
            阿妮塔发射中心: 791,
            岚心城: 1036,
            云岫桥基地: 840,
            汇流塔: 840,
            远星大桥: 826,
            栖羽站: 1001,
            塔图站: 945,
            黑月游乐城: 805,
            维蒂林场: 875,
            阿妮塔战备工厂: null
        },
        type: "Normal",
        craft: {
            黄铜: 0.25
        }
    },
    {
        name: "火箭拼装玩具",
        buyPrices: {
            阿妮塔发射中心: 561
        },
        buyLot: {
            阿妮塔发射中心: 55
        },
        sellPrices: {
            七号自由港: 640,
            修格里城: 668,
            曼德矿场: 696,
            澄明数据中心: 651,
            贡露城: 651,
            海角城: 628,
            荒原站: 712,
            淘金乐园: 752,
            阿妮塔能源研究所: 617,
            铁盟哨站: 673,
            阿妮塔战备工厂: 640,
            岚心城: 842,
            云岫桥基地: 735,
            汇流塔: 651,
            远星大桥: 628,
            栖羽站: 819,
            塔图站: 780,
            黑月游乐城: 729,
            维蒂林场: 673,
            阿妮塔发射中心: null
        },
        type: "Normal"
    },
    {
        name: "蜂窝防热烧蚀材料",
        buyPrices: {
            阿妮塔发射中心: 3741
        },
        buyLot: {
            阿妮塔发射中心: 8
        },
        sellPrices: {
            七号自由港: 4190,
            修格里城: 4302,
            曼德矿场: 4527,
            澄明数据中心: 4414,
            贡露城: 4302,
            海角城: 4190,
            荒原站: 4527,
            淘金乐园: 4751,
            阿妮塔能源研究所: 4078,
            铁盟哨站: 4527,
            阿妮塔战备工厂: 4190,
            岚心城: 5200,
            云岫桥基地: 4751,
            汇流塔: 4302,
            远星大桥: 4190,
            栖羽站: 5088,
            塔图站: 4976,
            黑月游乐城: 4639,
            维蒂林场: 4414,
            阿妮塔发射中心: null
        },
        type: "Special"
    },
    {
        name: "液氧甲烷燃料",
        buyPrices: {
            阿妮塔发射中心: 841
        },
        buyLot: {
            阿妮塔发射中心: 21
        },
        sellPrices: {
            七号自由港: 908,
            修格里城: 1001,
            曼德矿场: 1043,
            澄明数据中心: 976,
            贡露城: 976,
            海角城: 942,
            荒原站: 1043,
            淘金乐园: 1076,
            阿妮塔能源研究所: 875,
            铁盟哨站: 1034,
            阿妮塔战备工厂: 934,
            岚心城: 1211,
            云岫桥基地: 1076,
            汇流塔: 976,
            远星大桥: 942,
            栖羽站: 1177,
            塔图站: 1169,
            黑月游乐城: 1043,
            维蒂林场: 1009,
            阿妮塔发射中心: null
        },
        type: "Normal"
    },
    {
        name: "航天半导体",
        buyPrices: {
            阿妮塔发射中心: 7741
        },
        buyLot: {
            阿妮塔发射中心: 3
        },
        sellPrices: {
            七号自由港: 8577,
            修格里城: 8716,
            曼德矿场: 9088,
            澄明数据中心: 8949,
            贡露城: 8716,
            海角城: 8531,
            荒原站: 9088,
            淘金乐园: 9274,
            阿妮塔能源研究所: 8391,
            铁盟哨站: 9134,
            阿妮塔战备工厂: 8577,
            岚心城: 10017,
            云岫桥基地: 9506,
            汇流塔: 8716,
            远星大桥: 8531,
            栖羽站: 9831,
            塔图站: 9645,
            黑月游乐城: 9088,
            维蒂林场: 8902,
            阿妮塔发射中心: null
        },
        type: "Special"
    },
    {
        name: "无刷电机",
        buyPrices: {
            阿妮塔发射中心: 741
        },
        buyLot: {
            阿妮塔发射中心: 34
        },
        sellPrices: {
            七号自由港: 845,
            修格里城: 904,
            曼德矿场: 963,
            澄明数据中心: 882,
            贡露城: 882,
            海角城: 852,
            荒原站: 941,
            淘金乐园: 993,
            阿妮塔能源研究所: 815,
            铁盟哨站: 934,
            阿妮塔战备工厂: 845,
            岚心城: 1089,
            云岫桥基地: 993,
            汇流塔: 882,
            远星大桥: 852,
            栖羽站: 1060,
            塔图站: 1030,
            黑月游乐城: 941,
            维蒂林场: 911,
            阿妮塔发射中心: null
        },
        type: "Normal"
    },
    {
        name: "太阳电池阵",
        buyPrices: {
            阿妮塔发射中心: 5291
        },
        buyLot: {
            阿妮塔发射中心: 5
        },
        sellPrices: {
            七号自由港: 5873,
            修格里城: 5979,
            曼德矿场: 6243,
            澄明数据中心: 5979,
            贡露城: 5979,
            海角城: 5847,
            荒原站: 6402,
            淘金乐园: 6534,
            阿妮塔能源研究所: 5741,
            铁盟哨站: 6270,
            阿妮塔战备工厂: 5873,
            岚心城: 7063,
            云岫桥基地: 6534,
            汇流塔: 5979,
            远星大桥: 5847,
            栖羽站: 6931,
            塔图站: 6958,
            黑月游乐城: 6402,
            维蒂林场: 6111,
            阿妮塔发射中心: null
        },
        type: "Special"
    },
    {
        name: "镍基高温合金",
        buyPrices: {
            阿妮塔发射中心: 1421
        },
        buyLot: {
            阿妮塔发射中心: 21
        },
        sellPrices: {
            七号自由港: 1620,
            修格里城: 1691,
            曼德矿场: 1805,
            澄明数据中心: 1691,
            贡露城: 1691,
            海角城: 1634,
            荒原站: 1805,
            淘金乐园: 1862,
            阿妮塔能源研究所: 1563,
            铁盟哨站: 1790,
            阿妮塔战备工厂: 1620,
            岚心城: 2132,
            云岫桥基地: 1904,
            汇流塔: 1691,
            远星大桥: 1634,
            栖羽站: 2075,
            塔图站: 1975,
            黑月游乐城: 1847,
            维蒂林场: 1748,
            阿妮塔发射中心: null
        },
        type: "Normal"
    },
    {
        name: "钛合金",
        buyPrices: {
            阿妮塔战备工厂: 2520
        },
        buyLot: {
            阿妮塔战备工厂: 11
        },
        sellPrices: {
            七号自由港: 2772,
            修格里城: 2797,
            曼德矿场: 2898,
            澄明数据中心: 2696,
            贡露城: 2999,
            海角城: 2898,
            荒原站: 2898,
            淘金乐园: 2999,
            阿妮塔能源研究所: 2772,
            铁盟哨站: 2873,
            岚心城: 3578,
            阿妮塔发射中心: 2873,
            云岫桥基地: 3074,
            汇流塔: 3074,
            远星大桥: 2974,
            栖羽站: 3478,
            塔图站: 3301,
            黑月游乐城: 2974,
            维蒂林场: 3100,
            阿妮塔战备工厂: null
        },
        type: "Special",
        craft: {
            钛矿石: 0.25
        }
    },
    {
        name: "年货大礼包",
        buyPrices: {},
        buyLot: {},
        sellPrices: {
            澄明数据中心: 3177,
            阿妮塔能源研究所: 3408,
            阿妮塔发射中心: 3523,
            贡露城: 3523,
            海角城: 3639,
            荒原站: 3177,
            岚心城: 3870,
            曼德矿场: 3177,
            七号自由港: 3292,
            淘金乐园: 3292,
            铁盟哨站: 3061,
            修格里城: 2888,
            阿妮塔战备工厂: 3292,
            云岫桥基地: 3292,
            汇流塔: 3754,
            远星大桥: 3639,
            栖羽站: 3754,
            塔图站: 3726,
            黑月游乐城: 3379,
            维蒂林场: 3494
        },
        type: "Craft",
        craft: {
            修格里严选礼包: 0.3333333333333333,
            坚果: 0.3333333333333333,
            斑节虾: 0.3333333333333333
        }
    },
    {
        name: "水产甄选礼盒",
        buyPrices: {},
        buyLot: {},
        sellPrices: {
            澄明数据中心: 8266,
            阿妮塔能源研究所: 7687,
            阿妮塔发射中心: 8073,
            贡露城: 7880,
            海角城: 7095,
            荒原站: 8651,
            岚心城: 10015,
            曼德矿场: 8458,
            七号自由港: 8073,
            淘金乐园: 8458,
            铁盟哨站: 8651,
            修格里城: 8458,
            阿妮塔战备工厂: 8073,
            云岫桥基地: 9244,
            汇流塔: 6888,
            远星大桥: 7687,
            栖羽站: 9822,
            塔图站: 9051,
            黑月游乐城: 8651,
            维蒂林场: 8266
        },
        type: "Craft",
        craft: {
            海角水产礼盒: 0.5,
            帝王蟹: 0.5
        }
    },
    {
        name: "海角水产礼盒",
        buyPrices: {},
        buyLot: {},
        sellPrices: {
            澄明数据中心: 4802,
            阿妮塔能源研究所: 4393,
            阿妮塔发射中心: 4530,
            贡露城: 4393,
            海角城: 3888,
            荒原站: 5074,
            岚心城: 5871,
            曼德矿场: 4802,
            七号自由港: 4530,
            淘金乐园: 4802,
            铁盟哨站: 4938,
            修格里城: 4802,
            阿妮塔战备工厂: 4530,
            云岫桥基地: 5327,
            汇流塔: 4005,
            远星大桥: 4393,
            栖羽站: 5735,
            塔图站: 5190,
            黑月游乐城: 5074,
            维蒂林场: 4666
        },
        type: "Craft",
        craft: {
            大龙虾: 0.5,
            带鱼: 1.0,
            鱿鱼: 1.0
        }
    },
    {
        name: "修格里严选礼包",
        buyPrices: {},
        buyLot: {},
        sellPrices: {
            澄明数据中心: 2096,
            阿妮塔能源研究所: 2284,
            阿妮塔发射中心: 2379,
            贡露城: 2379,
            海角城: 2473,
            荒原站: 2096,
            岚心城: 2662,
            曼德矿场: 2096,
            七号自由港: 2190,
            淘金乐园: 2190,
            铁盟哨站: 2001,
            修格里城: 1888,
            阿妮塔战备工厂: 2190,
            云岫桥基地: 2190,
            汇流塔: 2568,
            远星大桥: 2473,
            栖羽站: 2568,
            塔图站: 2530,
            黑月游乐城: 2247,
            维蒂林场: 2341
        },
        type: "Craft",
        craft: {
            红茶: 0.3333333333333333,
            沃德烤鸡: 0.3333333333333333,
            罐头: 0.3333333333333333,
            沃德山泉: 0.3333333333333333
        }
    },
    {
        name: "西大陆甄选礼盒",
        buyPrices: {},
        buyLot: {},
        sellPrices: {
            澄明数据中心: 8162,
            阿妮塔能源研究所: 7646,
            阿妮塔发射中心: 7990,
            贡露城: 6888,
            海角城: 7646,
            荒原站: 7990,
            岚心城: 9023,
            曼德矿场: 7818,
            七号自由港: 7990,
            淘金乐园: 7646,
            铁盟哨站: 7990,
            修格里城: 7990,
            阿妮塔战备工厂: 7990,
            云岫桥基地: 8162,
            汇流塔: 7818,
            远星大桥: 7301,
            栖羽站: 8679,
            塔图站: 8162,
            黑月游乐城: 8507,
            维蒂林场: 7473
        },
        type: "Craft",
        craft: {
            年货大礼包: 1.0,
            鱼子酱: 0.3333333333333333,
            火腿: 0.3333333333333333
        }
    },
    {
        name: "宝石工艺品",
        buyPrices: {},
        buyLot: {},
        sellPrices: {
            七号自由港: 5782,
            修格里城: 5341,
            曼德矿场: 5194,
            贡露城: 5782,
            海角城: 6223,
            荒原站: 5047,
            淘金乐园: 5341,
            阿妮塔能源研究所: 5782,
            澄明数据中心: 5488,
            岚心城: 5635,
            铁盟哨站: 5194,
            阿妮塔战备工厂: 5488,
            阿妮塔发射中心: 5929,
            云岫桥基地: 5047,
            汇流塔: 6517,
            远星大桥: 5782,
            栖羽站: 5635,
            塔图站: 6076,
            黑月游乐城: 5782,
            维蒂林场: 5488
        },
        type: "Craft",
        craft: {
            玛瑙: 0.25,
            绿松石: 0.25,
            孔雀石: 0.25,
            银矿石: 0.25,
            曼德工具箱: 0.25
        }
    },
    {
        name: "手工编织地毯",
        buyPrices: {},
        buyLot: {},
        sellPrices: {
            七号自由港: 1730,
            修格里城: 1472,
            曼德矿场: 1436,
            贡露城: 1693,
            海角城: 1988,
            荒原站: 1350,
            淘金乐园: 1521,
            阿妮塔能源研究所: 1779,
            澄明数据中心: 1607,
            岚心城: 1644,
            铁盟哨站: 1436,
            阿妮塔战备工厂: 1607,
            阿妮塔发射中心: 1865,
            云岫桥基地: 1264,
            汇流塔: 2074,
            远星大桥: 1779,
            栖羽站: 1558,
            塔图站: 1853,
            黑月游乐城: 1730,
            维蒂林场: 1607
        },
        type: "Craft",
        craft: {
            棉花: 0.125,
            亚麻: 0.125,
            缝纫工具包: 0.125
        }
    },
    {
        name: "羽绒服",
        buyPrices: {},
        buyLot: {},
        sellPrices: {
            七号自由港: 2395,
            修格里城: 2216,
            曼德矿场: 2156,
            贡露城: 2455,
            海角城: 2635,
            荒原站: 2076,
            淘金乐园: 2236,
            阿妮塔能源研究所: 2535,
            澄明数据中心: 2375,
            岚心城: 2435,
            铁盟哨站: 2216,
            阿妮塔战备工厂: 2375,
            阿妮塔发射中心: 2615,
            云岫桥基地: 2056,
            汇流塔: 2715,
            远星大桥: 2475,
            栖羽站: 2355,
            塔图站: 2475,
            黑月游乐城: 2515,
            维蒂林场: 2375
        },
        type: "Craft",
        craft: {
            尼龙: 0.1875,
            羽绒: 0.1875,
            缝纫工具包: 0.1875
        }
    },
    {
        name: "钛矿石",
        buyPrices: {
            曼德矿场: 1620
        },
        buyLot: {
            曼德矿场: 15
        },
        sellPrices: {
            澄明数据中心: 1831,
            阿妮塔能源研究所: 2122,
            阿妮塔发射中心: 2203,
            贡露城: 1912,
            海角城: 2074,
            荒原站: 1750,
            岚心城: 2203,
            七号自由港: 2041,
            淘金乐园: 1750,
            铁盟哨站: 1717,
            修格里城: 1750,
            阿妮塔战备工厂: 1960,
            云岫桥基地: 1879,
            汇流塔: 2203,
            远星大桥: 1912,
            栖羽站: 2122,
            塔图站: 1912,
            黑月游乐城: 1993,
            维蒂林场: 1750,
            曼德矿场: null
        },
        type: "Special"
    },
    {
        name: "高导热陶瓷",
        buyPrices: {
            阿妮塔发射中心: 1631
        },
        buyLot: {
            阿妮塔发射中心: 13
        },
        sellPrices: {
            澄明数据中心: 1941,
            阿妮塔能源研究所: 1794,
            贡露城: 1941,
            海角城: 1876,
            荒原站: 2071,
            岚心城: 2447,
            曼德矿场: 2071,
            七号自由港: 1859,
            淘金乐园: 2137,
            铁盟哨站: 2055,
            修格里城: 1941,
            阿妮塔战备工厂: 1859,
            云岫桥基地: 2186,
            汇流塔: 1941,
            远星大桥: 1876,
            栖羽站: 2381,
            塔图站: 2267,
            黑月游乐城: 2120,
            维蒂林场: 2006,
            阿妮塔发射中心: null
        },
        type: "Normal",
        craft: {
            石英砂: 0.375,
            石墨: 0.375
        }
    },
    {
        name: "毛绒玩具",
        buyPrices: {
            黑月游乐城: 441
        },
        buyLot: {
            黑月游乐城: 36
        },
        sellPrices: {
            七号自由港: 542,
            阿妮塔发射中心: 573,
            阿妮塔能源研究所: 578,
            阿妮塔战备工厂: 507,
            澄明数据中心: 498,
            贡露城: 622,
            海角城: 622,
            荒原站: 529,
            汇流塔: 595,
            岚心城: 688,
            曼德矿场: 542,
            栖羽站: 617,
            塔图站: 617,
            淘金乐园: 564,
            铁盟哨站: 507,
            修格里城: 512,
            远星大桥: 595,
            云岫桥基地: 551,
            维蒂林场: 573,
            黑月游乐城: null
        },
        type: "Normal"
    },
    {
        name: "锦缎",
        buyPrices: {},
        buyLot: {},
        sellPrices: {
            七号自由港: 3460,
            阿妮塔能源研究所: 3560,
            澄明数据中心: 3445,
            修格里城: 3244,
            荒原站: 3058,
            曼德矿场: 3158,
            淘金乐园: 3259,
            贡露城: 3546,
            海角城: 3847,
            岚心城: 3445,
            铁盟哨站: 3158,
            阿妮塔发射中心: 3661,
            阿妮塔战备工厂: 3359,
            云岫桥基地: 2957,
            汇流塔: 3861,
            远星大桥: 3560,
            栖羽站: 3345,
            塔图站: 3646,
            黑月游乐城: 3460,
            维蒂林场: 3359
        },
        type: "Craft",
        craft: {
            蚕丝: 0.5625,
            绣线: 0.1875
        }
    },
    {
        name: "棉花",
        buyPrices: {
            荒原站: 750
        },
        buyLot: {
            荒原站: 23
        },
        sellPrices: {
            澄明数据中心: 923,
            阿妮塔能源研究所: 1193,
            阿妮塔发射中心: 1268,
            贡露城: 1118,
            海角城: 1343,
            岚心城: 1193,
            曼德矿场: 848,
            七号自由港: 1095,
            淘金乐园: 945,
            铁盟哨站: 773,
            修格里城: 848,
            阿妮塔战备工厂: 1020,
            云岫桥基地: 848,
            汇流塔: 1343,
            远星大桥: 1073,
            栖羽站: 1118,
            塔图站: 1095,
            黑月游乐城: 1118,
            维蒂林场: 923,
            荒原站: null
        },
        type: "Special"
    },
    {
        name: "高级女装",
        buyPrices: {},
        buyLot: {},
        sellPrices: {
            七号自由港: 4089,
            阿妮塔能源研究所: 4193,
            澄明数据中心: 4089,
            修格里城: 3881,
            荒原站: 3673,
            曼德矿场: 3777,
            淘金乐园: 3881,
            贡露城: 4193,
            海角城: 4505,
            岚心城: 4089,
            铁盟哨站: 3777,
            阿妮塔发射中心: 4297,
            阿妮塔战备工厂: 3985,
            云岫桥基地: 3569,
            汇流塔: 4505,
            远星大桥: 4193,
            栖羽站: 3985,
            塔图站: 4193,
            黑月游乐城: 4193,
            维蒂林场: 3985
        },
        type: "Craft",
        craft: {
            丝绸布料: 0.1875,
            锦缎: 0.1875,
            缝纫工具包: 0.375
        }
    },
    {
        name: "法兰绒靠垫",
        buyPrices: {},
        buyLot: {},
        sellPrices: {
            七号自由港: 2070,
            阿妮塔能源研究所: 2137,
            澄明数据中心: 2053,
            修格里城: 1919,
            荒原站: 1801,
            曼德矿场: 1868,
            淘金乐园: 1935,
            贡露城: 2121,
            海角城: 2323,
            岚心城: 2003,
            铁盟哨站: 1868,
            阿妮塔发射中心: 2205,
            阿妮塔战备工厂: 2003,
            云岫桥基地: 1683,
            汇流塔: 2390,
            远星大桥: 2137,
            栖羽站: 1935,
            塔图站: 2137,
            黑月游乐城: 2070,
            维蒂林场: 2053
        },
        type: "Craft",
        craft: {
            法兰绒: 0.1875,
            绣线: 0.1875,
            棉花: 0.1875
        }
    },
    {
        name: "羊毛布料",
        buyPrices: {},
        buyLot: {},
        sellPrices: {
            七号自由港: 1544,
            阿妮塔能源研究所: 1596,
            澄明数据中心: 1532,
            修格里城: 1429,
            荒原站: 1338,
            曼德矿场: 1390,
            淘金乐园: 1441,
            贡露城: 1583,
            海角城: 1737,
            岚心城: 1493,
            铁盟哨站: 1390,
            阿妮塔发射中心: 1647,
            阿妮塔战备工厂: 1493,
            云岫桥基地: 1287,
            汇流塔: 1789,
            远星大桥: 1596,
            栖羽站: 1441,
            塔图站: 1634,
            黑月游乐城: 1544,
            维蒂林场: 1532
        },
        type: "Craft",
        craft: {
            羊毛: 0.375
        }
    },
    {
        name: "法兰绒",
        buyPrices: {
            云岫桥基地: 1386
        },
        buyLot: {
            云岫桥基地: 20
        },
        sellPrices: {
            七号自由港: 1705,
            阿妮塔能源研究所: 1760,
            澄明数据中心: 1691,
            修格里城: 1580,
            荒原站: 1483,
            曼德矿场: 1538,
            淘金乐园: 1594,
            贡露城: 1746,
            海角城: 1913,
            岚心城: 1649,
            铁盟哨站: 1538,
            阿妮塔发射中心: 1816,
            阿妮塔战备工厂: 1649,
            云岫桥基地: null,
            汇流塔: 1968,
            远星大桥: 1760,
            栖羽站: 1594,
            塔图站: 1760,
            黑月游乐城: 1705,
            维蒂林场: 1691
        },
        type: "Special",
        craft: {
            羊毛: 0.6
        }
    },
    {
        name: "西服面料",
        buyPrices: {},
        buyLot: {},
        sellPrices: {
            七号自由港: 2557,
            阿妮塔能源研究所: 2640,
            澄明数据中心: 2536,
            修格里城: 2370,
            荒原站: 2225,
            曼德矿场: 2308,
            淘金乐园: 2391,
            贡露城: 2620,
            海角城: 2869,
            岚心城: 2536,
            铁盟哨站: 2308,
            阿妮塔发射中心: 2723,
            阿妮塔战备工厂: 2474,
            云岫桥基地: 2141,
            汇流塔: 2890,
            远星大桥: 2640,
            栖羽站: 2453,
            塔图站: 2640,
            黑月游乐城: 2620,
            维蒂林场: 2474
        },
        type: "Craft",
        craft: {
            羊毛: 0.5625,
            缝纫工具包: 0.1875
        }
    },
    {
        name: "雪金锦袍",
        buyPrices: {},
        buyLot: {},
        sellPrices: {
            七号自由港: 5965,
            阿妮塔能源研究所: 6138,
            修格里城: 5594,
            铁盟哨站: 5594,
            荒原站: 5272,
            曼德矿场: 5445,
            淘金乐园: 5618,
            澄明数据中心: 5792,
            阿妮塔战备工厂: 5792,
            阿妮塔发射中心: 6311,
            海角城: 6485,
            汇流塔: 6658,
            远星大桥: 6138,
            云岫桥基地: 5099,
            贡露城: 6262,
            岚心城: 5940,
            栖羽站: 5767,
            塔图站: 6287,
            黑月游乐城: 5965,
            维蒂林场: 5792
        },
        type: "Craft",
        craft: {
            织锦缎: 0.375,
            金丝: 0.1875,
            缝纫工具包: 0.1875
        }
    },
    {
        name: "蕾丝花边",
        buyPrices: {},
        buyLot: {},
        sellPrices: {
            七号自由港: 2006,
            阿妮塔能源研究所: 1972,
            澄明数据中心: 2176,
            修格里城: 2176,
            荒原站: 2397,
            曼德矿场: 2176,
            淘金乐园: 2227,
            贡露城: 1972,
            海角城: 1700,
            岚心城: 2873,
            铁盟哨站: 2261,
            阿妮塔发射中心: 2057,
            阿妮塔战备工厂: 2057,
            云岫桥基地: 2482,
            汇流塔: 1751,
            远星大桥: 1921,
            栖羽站: 2788,
            塔图站: 2448,
            黑月游乐城: 2448,
            维蒂林场: 2091
        },
        type: "Craft",
        craft: {
            亚麻: 0.375,
            缝纫工具包: 0.1875
        }
    },
    {
        name: "冲锋衣",
        buyPrices: {},
        buyLot: {},
        sellPrices: {
            七号自由港: 1198,
            阿妮塔能源研究所: 1267,
            澄明数据中心: 1188,
            修格里城: 1108,
            荒原站: 1038,
            曼德矿场: 1078,
            淘金乐园: 1118,
            贡露城: 1228,
            海角城: 1317,
            岚心城: 1218,
            铁盟哨站: 1108,
            阿妮塔发射中心: 1307,
            阿妮塔战备工厂: 1188,
            云岫桥基地: 1028,
            汇流塔: 1357,
            远星大桥: 1267,
            栖羽站: 1178,
            塔图站: 1267,
            黑月游乐城: 1257,
            维蒂林场: 1188
        },
        type: "Craft",
        craft: {
            尼龙: 0.3,
            缝纫工具包: 0.15
        }
    },
    {
        name: "亚麻",
        buyPrices: {
            云岫桥基地: 850
        },
        buyLot: {
            云岫桥基地: 28
        },
        sellPrices: {
            七号自由港: 1088,
            阿妮塔能源研究所: 1131,
            澄明数据中心: 1071,
            修格里城: 986,
            荒原站: 918,
            曼德矿场: 961,
            淘金乐园: 1003,
            贡露城: 1114,
            海角城: 1241,
            岚心城: 1046,
            铁盟哨站: 961,
            阿妮塔发射中心: 1173,
            阿妮塔战备工厂: 1046,
            汇流塔: 1284,
            远星大桥: 1131,
            栖羽站: 1003,
            塔图站: 1131,
            黑月游乐城: 1088,
            维蒂林场: 1071,
            云岫桥基地: null
        },
        type: "Special"
    },
    {
        name: "蕾丝连衣裙",
        buyPrices: {
            海角城: 2295
        },
        buyLot: {
            海角城: 8
        },
        sellPrices: {
            七号自由港: 2708,
            阿妮塔能源研究所: 2662,
            澄明数据中心: 2938,
            修格里城: 2938,
            荒原站: 3236,
            曼德矿场: 2938,
            淘金乐园: 3006,
            贡露城: 2662,
            岚心城: 3879,
            铁盟哨站: 3052,
            阿妮塔发射中心: 2777,
            阿妮塔战备工厂: 2777,
            云岫桥基地: 3351,
            汇流塔: 2364,
            远星大桥: 2593,
            栖羽站: 3764,
            塔图站: 3305,
            黑月游乐城: 3305,
            维蒂林场: 2823,
            海角城: null
        },
        type: "Special",
        craft: {
            蕾丝花边: 0.1875,
            缝纫工具包: 0.1875
        }
    },
    {
        name: "灯芯绒休闲裤",
        buyPrices: {},
        buyLot: {},
        sellPrices: {
            七号自由港: 1753,
            阿妮塔能源研究所: 1767,
            澄明数据中心: 1696,
            修格里城: 1582,
            荒原站: 1482,
            曼德矿场: 1582,
            淘金乐园: 1596,
            贡露城: 1753,
            海角城: 1924,
            岚心城: 1739,
            铁盟哨站: 1582,
            阿妮塔发射中心: 1867,
            阿妮塔战备工厂: 1696,
            云岫桥基地: 1468,
            汇流塔: 1981,
            远星大桥: 1767,
            栖羽站: 1682,
            塔图站: 1767,
            黑月游乐城: 1796,
            维蒂林场: 1653
        },
        type: "Craft",
        craft: {
            灯芯绒: 0.1875,
            缝纫工具包: 0.1875
        }
    },
    {
        name: "灯芯绒",
        buyPrices: {},
        buyLot: {},
        sellPrices: {
            七号自由港: 1384,
            阿妮塔能源研究所: 1395,
            澄明数据中心: 1339,
            修格里城: 1249,
            荒原站: 1170,
            曼德矿场: 1249,
            淘金乐园: 1260,
            贡露城: 1384,
            海角城: 1519,
            岚心城: 1373,
            铁盟哨站: 1249,
            阿妮塔发射中心: 1474,
            阿妮塔战备工厂: 1339,
            云岫桥基地: 1159,
            汇流塔: 1564,
            远星大桥: 1395,
            栖羽站: 1328,
            塔图站: 1395,
            黑月游乐城: 1418,
            维蒂林场: 1305
        },
        type: "Craft",
        craft: {
            棉花: 0.375
        }
    },
    {
        name: "缝纫工具包",
        buyPrices: {
            云岫桥基地: 701
        },
        buyLot: {
            云岫桥基地: 32
        },
        sellPrices: {
            七号自由港: 897,
            阿妮塔能源研究所: 932,
            澄明数据中心: 862,
            修格里城: 792,
            荒原站: 757,
            曼德矿场: 792,
            淘金乐园: 827,
            贡露城: 897,
            海角城: 1023,
            岚心城: 883,
            铁盟哨站: 792,
            阿妮塔发射中心: 967,
            阿妮塔战备工厂: 862,
            汇流塔: 1037,
            远星大桥: 932,
            栖羽站: 848,
            塔图站: 932,
            黑月游乐城: 897,
            维蒂林场: 862,
            云岫桥基地: null
        },
        type: "Special"
    },
    {
        name: "尼龙",
        buyPrices: {
            云岫桥基地: 601
        },
        buyLot: {
            云岫桥基地: 36
        },
        sellPrices: {
            七号自由港: 709,
            阿妮塔能源研究所: 727,
            澄明数据中心: 691,
            修格里城: 655,
            荒原站: 637,
            曼德矿场: 655,
            淘金乐园: 673,
            贡露城: 709,
            海角城: 763,
            岚心城: 691,
            铁盟哨站: 655,
            阿妮塔发射中心: 745,
            阿妮塔战备工厂: 709,
            汇流塔: 781,
            远星大桥: 727,
            栖羽站: 673,
            塔图站: 727,
            黑月游乐城: 709,
            维蒂林场: 673,
            云岫桥基地: null
        },
        type: "Normal"
    },
    {
        name: "绣线",
        buyPrices: {
            云岫桥基地: 401
        },
        buyLot: {
            云岫桥基地: 40
        },
        sellPrices: {
            七号自由港: 461,
            阿妮塔能源研究所: 473,
            澄明数据中心: 449,
            修格里城: 425,
            荒原站: 413,
            曼德矿场: 425,
            淘金乐园: 437,
            贡露城: 461,
            海角城: 509,
            岚心城: 461,
            铁盟哨站: 425,
            阿妮塔发射中心: 485,
            阿妮塔战备工厂: 449,
            汇流塔: 509,
            远星大桥: 473,
            栖羽站: 449,
            塔图站: 473,
            黑月游乐城: 461,
            维蒂林场: 449,
            云岫桥基地: null
        },
        type: "Normal"
    },
    {
        name: "牛仔布",
        buyPrices: {
            云岫桥基地: 301
        },
        buyLot: {
            云岫桥基地: 40
        },
        sellPrices: {
            七号自由港: 346,
            阿妮塔能源研究所: 355,
            澄明数据中心: 337,
            修格里城: 319,
            荒原站: 310,
            曼德矿场: 319,
            淘金乐园: 346,
            贡露城: 346,
            海角城: 373,
            岚心城: 337,
            铁盟哨站: 319,
            阿妮塔发射中心: 364,
            阿妮塔战备工厂: 337,
            汇流塔: 382,
            远星大桥: 355,
            栖羽站: 328,
            塔图站: 355,
            黑月游乐城: 346,
            维蒂林场: 337,
            云岫桥基地: null
        },
        type: "Normal",
        craft: {
            亚麻: 0.075
        }
    },
    {
        name: "绵羊",
        buyPrices: {
            云岫桥基地: 297
        },
        buyLot: {
            云岫桥基地: 40
        },
        sellPrices: {
            七号自由港: 416,
            阿妮塔能源研究所: 440,
            澄明数据中心: 392,
            修格里城: 345,
            荒原站: 321,
            曼德矿场: 345,
            淘金乐园: 368,
            贡露城: 425,
            海角城: 496,
            岚心城: 392,
            铁盟哨站: 345,
            阿妮塔发射中心: 463,
            阿妮塔战备工厂: 392,
            汇流塔: 511,
            远星大桥: 440,
            栖羽站: 368,
            塔图站: 448,
            黑月游乐城: 416,
            维蒂林场: 401,
            云岫桥基地: null
        },
        type: "Normal"
    },
    {
        name: "涤纶",
        buyPrices: {
            云岫桥基地: 201
        },
        buyLot: {
            云岫桥基地: 44
        },
        sellPrices: {
            七号自由港: 237,
            阿妮塔能源研究所: 243,
            澄明数据中心: 231,
            修格里城: 219,
            荒原站: 213,
            曼德矿场: 219,
            淘金乐园: 225,
            贡露城: 237,
            海角城: 255,
            岚心城: 231,
            铁盟哨站: 219,
            阿妮塔发射中心: 249,
            阿妮塔战备工厂: 237,
            汇流塔: 261,
            远星大桥: 243,
            栖羽站: 225,
            塔图站: 243,
            黑月游乐城: 237,
            维蒂林场: 231,
            云岫桥基地: null
        },
        type: "Normal"
    },
    {
        name: "鸭",
        buyPrices: {
            云岫桥基地: 123,
            栖羽站: 99
        },
        buyLot: {
            云岫桥基地: 45,
            栖羽站: 45
        },
        sellPrices: {
            七号自由港: 165,
            阿妮塔能源研究所: 170,
            澄明数据中心: 154,
            修格里城: 149,
            荒原站: 131,
            曼德矿场: 139,
            淘金乐园: 147,
            贡露城: 165,
            海角城: 189,
            岚心城: 107,
            铁盟哨站: 139,
            阿妮塔发射中心: 178,
            阿妮塔战备工厂: 162,
            汇流塔: 194,
            远星大桥: 170,
            塔图站: 173,
            黑月游乐城: 162,
            维蒂林场: 157,
            云岫桥基地: null,
            栖羽站: null
        },
        type: "Normal"
    },
    {
        name: "肥皂",
        buyPrices: {
            云岫桥基地: 62
        },
        buyLot: {
            云岫桥基地: 56
        },
        sellPrices: {
            七号自由港: 71,
            阿妮塔能源研究所: 73,
            澄明数据中心: 69,
            修格里城: 66,
            荒原站: 64,
            曼德矿场: 66,
            淘金乐园: 68,
            贡露城: 71,
            海角城: 77,
            岚心城: 69,
            铁盟哨站: 68,
            阿妮塔发射中心: 75,
            阿妮塔战备工厂: 69,
            汇流塔: 79,
            远星大桥: 73,
            栖羽站: 68,
            塔图站: 73,
            黑月游乐城: 71,
            维蒂林场: 69,
            云岫桥基地: null
        },
        type: "Normal"
    },
    {
        name: "尼龙晴雨伞",
        buyPrices: {},
        buyLot: {},
        sellPrices: {
            七号自由港: 853,
            阿妮塔能源研究所: 866,
            澄明数据中心: 801,
            修格里城: 736,
            荒原站: 703,
            曼德矿场: 736,
            淘金乐园: 788,
            贡露城: 833,
            海角城: 950,
            岚心城: 801,
            铁盟哨站: 736,
            阿妮塔发射中心: 898,
            阿妮塔战备工厂: 820,
            云岫桥基地: 651,
            汇流塔: 983,
            远星大桥: 885,
            栖羽站: 768,
            塔图站: 885,
            黑月游乐城: 833,
            维蒂林场: 801
        },
        type: "Craft",
        craft: {
            尼龙: 0.125,
            缝纫工具包: 0.125
        }
    },
    {
        name: "羊毛",
        buyPrices: {},
        buyLot: {},
        sellPrices: {
            七号自由港: 1238,
            阿妮塔能源研究所: 1287,
            澄明数据中心: 1218,
            修格里城: 1119,
            荒原站: 1040,
            曼德矿场: 1089,
            淘金乐园: 1139,
            贡露城: 1267,
            海角城: 1416,
            岚心城: 1188,
            铁盟哨站: 1089,
            阿妮塔发射中心: 1337,
            阿妮塔战备工厂: 1188,
            云岫桥基地: 990,
            汇流塔: 1465,
            远星大桥: 1287,
            栖羽站: 1139,
            塔图站: 1317,
            黑月游乐城: 1238,
            维蒂林场: 1218
        },
        type: "Craft",
        craft: {
            绵羊: 0.25
        }
    },
    {
        name: "棉花枕头",
        buyPrices: {},
        buyLot: {},
        sellPrices: {
            七号自由港: 1062,
            阿妮塔能源研究所: 1062,
            澄明数据中心: 1035,
            修格里城: 981,
            荒原站: 927,
            曼德矿场: 954,
            淘金乐园: 981,
            贡露城: 1062,
            海角城: 1143,
            岚心城: 1035,
            铁盟哨站: 954,
            阿妮塔发射中心: 1089,
            阿妮塔战备工厂: 1008,
            云岫桥基地: 900,
            汇流塔: 1170,
            远星大桥: 1062,
            栖羽站: 1008,
            塔图站: 1089,
            黑月游乐城: 1062,
            维蒂林场: 1035
        },
        type: "Craft",
        craft: {
            纯棉布料: 0.125,
            绣线: 0.125,
            棉花: 0.125
        }
    },
    {
        name: "真丝羽绒枕头",
        buyPrices: {},
        buyLot: {},
        sellPrices: {
            七号自由港: 3423,
            阿妮塔能源研究所: 3437,
            澄明数据中心: 3326,
            修格里城: 3132,
            荒原站: 2952,
            曼德矿场: 3049,
            淘金乐园: 3146,
            贡露城: 3423,
            海角城: 3714,
            岚心城: 3326,
            铁盟哨站: 3049,
            阿妮塔发射中心: 3534,
            阿妮塔战备工厂: 3243,
            云岫桥基地: 2772,
            汇流塔: 3812,
            远星大桥: 3437,
            栖羽站: 3229,
            塔图站: 3604,
            黑月游乐城: 3423,
            维蒂林场: 3326
        },
        type: "Craft",
        craft: {
            丝绸布料: 0.1875,
            绣线: 0.1875,
            羽绒: 0.375
        }
    },
    {
        name: "羊绒衫",
        buyPrices: {},
        buyLot: {},
        sellPrices: {
            七号自由港: 2687,
            阿妮塔能源研究所: 2755,
            澄明数据中心: 2619,
            修格里城: 2482,
            荒原站: 2414,
            曼德矿场: 2482,
            淘金乐园: 2550,
            贡露城: 2687,
            海角城: 2892,
            岚心城: 2619,
            铁盟哨站: 2482,
            阿妮塔发射中心: 2823,
            阿妮塔战备工厂: 2619,
            云岫桥基地: 2345,
            汇流塔: 2960,
            远星大桥: 2755,
            栖羽站: 2550,
            塔图站: 2755,
            黑月游乐城: 2687,
            维蒂林场: 2619
        },
        type: "Craft"
    },
    {
        name: "芳纶纤维",
        buyPrices: {
            汇流塔: 1201
        },
        buyLot: {
            汇流塔: 20
        },
        sellPrices: {
            七号自由港: 1477,
            阿妮塔能源研究所: 1357,
            澄明数据中心: 1573,
            修格里城: 1597,
            荒原站: 1657,
            曼德矿场: 1597,
            淘金乐园: 1597,
            贡露城: 1417,
            海角城: 1237,
            岚心城: 2018,
            铁盟哨站: 1657,
            阿妮塔发射中心: 1513,
            阿妮塔战备工厂: 1513,
            云岫桥基地: 1777,
            远星大桥: 1357,
            栖羽站: 1958,
            塔图站: 1717,
            黑月游乐城: 1657,
            维蒂林场: 1537,
            汇流塔: null
        },
        type: "Special"
    },
    {
        name: "山羊",
        buyPrices: {
            汇流塔: 400
        },
        buyLot: {
            汇流塔: 32
        },
        sellPrices: {
            七号自由港: 528,
            阿妮塔能源研究所: 464,
            澄明数据中心: 560,
            修格里城: 592,
            荒原站: 624,
            曼德矿场: 592,
            淘金乐园: 592,
            贡露城: 508,
            海角城: 400,
            岚心城: 816,
            铁盟哨站: 624,
            阿妮塔发射中心: 528,
            阿妮塔战备工厂: 528,
            云岫桥基地: 688,
            远星大桥: 464,
            栖羽站: 784,
            塔图站: 656,
            黑月游乐城: 624,
            维蒂林场: 572,
            汇流塔: null
        },
        type: "Normal"
    },
    {
        name: "羊绒",
        buyPrices: {},
        buyLot: {},
        sellPrices: {
            七号自由港: 2534,
            阿妮塔能源研究所: 2633,
            澄明数据中心: 2435,
            修格里城: 2237,
            荒原站: 2138,
            曼德矿场: 2237,
            淘金乐园: 2336,
            贡露城: 2534,
            海角城: 2831,
            岚心城: 2435,
            铁盟哨站: 2237,
            阿妮塔发射中心: 2732,
            阿妮塔战备工厂: 2435,
            云岫桥基地: 2039,
            汇流塔: 2930,
            远星大桥: 2633,
            栖羽站: 2336,
            塔图站: 2633,
            黑月游乐城: 2534,
            维蒂林场: 2435
        },
        type: "Craft",
        craft: {
            山羊: 0.375
        }
    },
    {
        name: "织锦缎",
        buyPrices: {},
        buyLot: {},
        sellPrices: {
            七号自由港: 4772,
            阿妮塔能源研究所: 4910,
            澄明数据中心: 4752,
            修格里城: 4475,
            荒原站: 4217,
            曼德矿场: 4356,
            淘金乐园: 4495,
            贡露城: 4891,
            海角城: 5306,
            岚心城: 4752,
            铁盟哨站: 4356,
            阿妮塔发射中心: 5049,
            阿妮塔战备工厂: 4633,
            云岫桥基地: 4079,
            汇流塔: 5326,
            远星大桥: 4910,
            栖羽站: 4613,
            塔图站: 5029,
            黑月游乐城: 4772,
            维蒂林场: 4633
        },
        type: "Craft",
        craft: {
            金丝: 0.1875,
            锦缎: 0.375,
            缝纫工具包: 0.1875
        }
    },
    {
        name: "法兰绒睡衣",
        buyPrices: {},
        buyLot: {},
        sellPrices: {
            七号自由港: 2192,
            阿妮塔能源研究所: 2263,
            澄明数据中心: 2174,
            修格里城: 2031,
            荒原站: 1907,
            曼德矿场: 1978,
            淘金乐园: 2049,
            贡露城: 2245,
            海角城: 2459,
            岚心城: 2121,
            铁盟哨站: 1978,
            阿妮塔发射中心: 2334,
            阿妮塔战备工厂: 2121,
            云岫桥基地: 1782,
            汇流塔: 2530,
            远星大桥: 2263,
            栖羽站: 2049,
            塔图站: 2263,
            黑月游乐城: 2192,
            维蒂林场: 2174
        },
        type: "Craft",
        craft: {
            法兰绒: 0.375,
            绣线: 0.1875
        }
    },
    {
        name: "西服",
        buyPrices: {},
        buyLot: {},
        sellPrices: {
            七号自由港: 3044,
            阿妮塔能源研究所: 3143,
            澄明数据中心: 3020,
            修格里城: 2822,
            荒原站: 2648,
            曼德矿场: 2747,
            淘金乐园: 2846,
            贡露城: 3119,
            海角城: 3416,
            岚心城: 3020,
            铁盟哨站: 2747,
            阿妮塔发射中心: 3242,
            阿妮塔战备工厂: 2945,
            云岫桥基地: 2549,
            汇流塔: 3440,
            远星大桥: 3143,
            栖羽站: 2921,
            塔图站: 3143,
            黑月游乐城: 3119,
            维蒂林场: 2945
        },
        type: "Craft",
        craft: {
            西服面料: 0.1875,
            缝纫工具包: 0.1875
        }
    },
    {
        name: "雪纺",
        buyPrices: {},
        buyLot: {},
        sellPrices: {
            七号自由港: 1153,
            阿妮塔能源研究所: 1198,
            澄明数据中心: 1135,
            修格里城: 1045,
            荒原站: 973,
            曼德矿场: 1018,
            淘金乐园: 1063,
            贡露城: 1180,
            海角城: 1315,
            岚心城: 1135,
            铁盟哨站: 1018,
            阿妮塔发射中心: 1243,
            阿妮塔战备工厂: 1108,
            云岫桥基地: 928,
            汇流塔: 1333,
            远星大桥: 1198,
            栖羽站: 1090,
            塔图站: 1225,
            黑月游乐城: 1180,
            维蒂林场: 1108
        },
        type: "Craft"
    },
    {
        name: "天鹅绒椅披",
        buyPrices: {},
        buyLot: {},
        sellPrices: {
            七号自由港: 4056,
            阿妮塔能源研究所: 4174,
            澄明数据中心: 4039,
            修格里城: 3804,
            荒原站: 3585,
            曼德矿场: 3703,
            淘金乐园: 3820,
            贡露城: 4157,
            海角城: 4510,
            岚心城: 4039,
            铁盟哨站: 3703,
            阿妮塔发射中心: 4292,
            阿妮塔战备工厂: 3938,
            云岫桥基地: 3467,
            汇流塔: 4527,
            远星大桥: 4174,
            栖羽站: 3921,
            塔图站: 4275,
            黑月游乐城: 4056,
            维蒂林场: 3938
        },
        type: "Craft",
        craft: {
            天鹅绒: 0.375,
            绣线: 0.1875,
            缝纫工具包: 0.1875
        }
    },
    {
        name: "天鹅绒",
        buyPrices: {},
        buyLot: {},
        sellPrices: {
            七号自由港: 3579,
            阿妮塔能源研究所: 3683,
            澄明数据中心: 3564,
            修格里城: 3356,
            荒原站: 3163,
            曼德矿场: 3267,
            淘金乐园: 3371,
            贡露城: 3668,
            海角城: 3980,
            岚心城: 3564,
            铁盟哨站: 3267,
            阿妮塔发射中心: 3787,
            阿妮塔战备工厂: 3475,
            云岫桥基地: 3059,
            汇流塔: 3995,
            远星大桥: 3683,
            栖羽站: 3460,
            塔图站: 3772,
            黑月游乐城: 3579,
            维蒂林场: 3475
        },
        type: "Craft",
        craft: {
            蚕丝: 0.5625,
            缝纫工具包: 0.1875
        }
    },
    {
        name: "真丝睡衣",
        buyPrices: {},
        buyLot: {},
        sellPrices: {
            七号自由港: 3154,
            阿妮塔能源研究所: 3234,
            澄明数据中心: 3154,
            修格里城: 2994,
            荒原站: 2833,
            曼德矿场: 2914,
            淘金乐园: 2994,
            贡露城: 3234,
            海角城: 3475,
            岚心城: 3154,
            铁盟哨站: 2914,
            阿妮塔发射中心: 3315,
            阿妮塔战备工厂: 3074,
            云岫桥基地: 2753,
            汇流塔: 3475,
            远星大桥: 3234,
            栖羽站: 3074,
            塔图站: 3315,
            黑月游乐城: 3154,
            维蒂林场: 3074
        },
        type: "Craft",
        craft: {
            丝绸布料: 0.375,
            绣线: 0.1875
        }
    },
    {
        name: "丝绸布料",
        buyPrices: {},
        buyLot: {},
        sellPrices: {
            七号自由港: 2863,
            阿妮塔能源研究所: 2946,
            澄明数据中心: 2851,
            修格里城: 2685,
            荒原站: 2530,
            曼德矿场: 2614,
            淘金乐园: 2697,
            贡露城: 2934,
            海角城: 3184,
            岚心城: 2851,
            铁盟哨站: 2614,
            阿妮塔发射中心: 3029,
            阿妮塔战备工厂: 2780,
            云岫桥基地: 2447,
            汇流塔: 3196,
            远星大桥: 2946,
            栖羽站: 2768,
            塔图站: 3018,
            黑月游乐城: 2863,
            维蒂林场: 2780
        },
        type: "Craft",
        craft: {
            蚕丝: 0.5625
        }
    },
    {
        name: "羽绒",
        buyPrices: {
            栖羽站: 495
        },
        buyLot: {
            栖羽站: 30
        },
        sellPrices: {
            七号自由港: 747,
            阿妮塔能源研究所: 777,
            澄明数据中心: 718,
            修格里城: 688,
            荒原站: 629,
            曼德矿场: 658,
            淘金乐园: 688,
            贡露城: 747,
            海角城: 837,
            岚心城: 554,
            铁盟哨站: 658,
            阿妮塔发射中心: 807,
            阿妮塔战备工厂: 747,
            云岫桥基地: 599,
            汇流塔: 866,
            远星大桥: 777,
            塔图站: 777,
            黑月游乐城: 747,
            维蒂林场: 718,
            栖羽站: null
        },
        type: "Special",
        craft: {
            鸭: 0.15
        }
    },
    {
        name: "蚕丝",
        buyPrices: {},
        buyLot: {},
        sellPrices: {
            七号自由港: 2020,
            阿妮塔能源研究所: 2097,
            澄明数据中心: 1990,
            修格里城: 1834,
            荒原站: 1709,
            曼德矿场: 1787,
            淘金乐园: 1864,
            贡露城: 2067,
            海角城: 2300,
            岚心城: 1990,
            铁盟哨站: 1787,
            阿妮塔发射中心: 2175,
            阿妮塔战备工厂: 1942,
            云岫桥基地: 1632,
            汇流塔: 2330,
            远星大桥: 2097,
            栖羽站: 1912,
            塔图站: 2145,
            黑月游乐城: 2020,
            维蒂林场: 1942
        },
        type: "Craft"
    },
    {
        name: "金丝",
        buyPrices: {},
        buyLot: {},
        sellPrices: {
            七号自由港: 3817,
            阿妮塔能源研究所: 3928,
            澄明数据中心: 3802,
            修格里城: 3580,
            荒原站: 3374,
            曼德矿场: 3485,
            淘金乐园: 3596,
            贡露城: 3912,
            海角城: 4245,
            岚心城: 3802,
            铁盟哨站: 3485,
            阿妮塔发射中心: 4039,
            阿妮塔战备工厂: 3707,
            云岫桥基地: 3263,
            汇流塔: 4261,
            远星大桥: 3928,
            栖羽站: 3691,
            塔图站: 4023,
            黑月游乐城: 3817,
            维蒂林场: 3707
        },
        type: "Craft",
        craft: {
            蚕丝: 0.375,
            沙金: 0.1875
        }
    },
    {
        name: "牛仔裤",
        buyPrices: {
            淘金乐园: 501
        },
        buyLot: {
            淘金乐园: 10
        },
        sellPrices: {
            七号自由港: 591,
            阿妮塔能源研究所: 591,
            澄明数据中心: 546,
            修格里城: 531,
            荒原站: 546,
            曼德矿场: 546,
            贡露城: 546,
            海角城: 591,
            岚心城: 621,
            铁盟哨站: 546,
            阿妮塔发射中心: 621,
            阿妮塔战备工厂: 576,
            云岫桥基地: 546,
            汇流塔: 606,
            远星大桥: 561,
            栖羽站: 606,
            塔图站: 531,
            黑月游乐城: 591,
            维蒂林场: 531,
            淘金乐园: null
        },
        type: "Normal",
        craft: {
            牛仔布: 0.07142857142857142,
            绣线: 0.10714285714285714
        }
    },
    {
        name: "纯棉T恤",
        buyPrices: {
            七号自由港: 499
        },
        buyLot: {
            七号自由港: 35
        },
        sellPrices: {
            阿妮塔能源研究所: 514,
            澄明数据中心: 529,
            修格里城: 529,
            荒原站: 559,
            曼德矿场: 559,
            淘金乐园: 574,
            贡露城: 574,
            海角城: 559,
            岚心城: 649,
            铁盟哨站: 544,
            阿妮塔发射中心: 529,
            阿妮塔战备工厂: 514,
            云岫桥基地: 574,
            汇流塔: 574,
            远星大桥: 544,
            栖羽站: 634,
            塔图站: 619,
            黑月游乐城: 574,
            维蒂林场: 589,
            七号自由港: null
        },
        type: "Normal",
        craft: {
            纯棉布料: 0.09375,
            绣线: 0.09375
        }
    },
    {
        name: "无纺布",
        buyPrices: {
            阿妮塔能源研究所: 551
        },
        buyLot: {
            阿妮塔能源研究所: 30
        },
        sellPrices: {
            七号自由港: 568,
            澄明数据中心: 617,
            修格里城: 617,
            荒原站: 650,
            曼德矿场: 634,
            淘金乐园: 634,
            贡露城: 584,
            海角城: 584,
            岚心城: 733,
            铁盟哨站: 650,
            阿妮塔发射中心: 601,
            阿妮塔战备工厂: 601,
            云岫桥基地: 650,
            汇流塔: 584,
            远星大桥: 601,
            栖羽站: 716,
            塔图站: 667,
            黑月游乐城: 650,
            维蒂林场: 634,
            阿妮塔能源研究所: null
        },
        type: "Normal",
        craft: {
            涤纶: 0.375
        }
    },
    {
        name: "花呢上衣",
        buyPrices: {
            澄明数据中心: 1881
        },
        buyLot: {
            澄明数据中心: 10
        },
        sellPrices: {
            七号自由港: 2088,
            阿妮塔能源研究所: 2220,
            修格里城: 2013,
            荒原站: 2144,
            曼德矿场: 2088,
            淘金乐园: 2220,
            贡露城: 2426,
            海角城: 2426,
            岚心城: 2652,
            铁盟哨站: 2013,
            阿妮塔发射中心: 2295,
            阿妮塔战备工厂: 2069,
            云岫桥基地: 2295,
            汇流塔: 2426,
            远星大桥: 2314,
            栖羽站: 2577,
            塔图站: 2502,
            黑月游乐城: 2201,
            维蒂林场: 2238,
            澄明数据中心: null
        },
        type: "Special",
        craft: {
            花呢: 0.375,
            缝纫工具包: 0.1875
        }
    },
    {
        name: "花呢",
        buyPrices: {},
        buyLot: {},
        sellPrices: {
            七号自由港: 1648,
            阿妮塔能源研究所: 1752,
            澄明数据中心: 1485,
            修格里城: 1589,
            荒原站: 1693,
            曼德矿场: 1648,
            淘金乐园: 1752,
            贡露城: 1916,
            海角城: 1916,
            岚心城: 2094,
            铁盟哨站: 1589,
            阿妮塔发射中心: 1812,
            阿妮塔战备工厂: 1634,
            云岫桥基地: 1812,
            汇流塔: 1916,
            远星大桥: 1827,
            栖羽站: 2034,
            塔图站: 1975,
            黑月游乐城: 1737,
            维蒂林场: 1767
        },
        type: "Craft",
        craft: {
            羊毛: 0.375,
            缝纫工具包: 0.1875
        }
    },
    {
        name: "纯棉布料",
        buyPrices: {
            修格里城: 825
        },
        buyLot: {
            修格里城: 21
        },
        sellPrices: {
            七号自由港: 875,
            阿妮塔能源研究所: 899,
            澄明数据中心: 850,
            荒原站: 850,
            曼德矿场: 850,
            淘金乐园: 875,
            贡露城: 949,
            海角城: 974,
            岚心城: 1023,
            铁盟哨站: 825,
            阿妮塔发射中心: 924,
            阿妮塔战备工厂: 875,
            云岫桥基地: 899,
            汇流塔: 998,
            远星大桥: 949,
            栖羽站: 998,
            塔图站: 949,
            黑月游乐城: 899,
            维蒂林场: 899,
            修格里城: null
        },
        type: "Normal",
        craft: {
            棉花: 0.3
        }
    },
    {
        name: "金制列车工艺品",
        buyPrices: {},
        buyLot: {},
        sellPrices: {
            七号自由港: 8346,
            阿妮塔能源研究所: 8736,
            澄明数据中心: 7800,
            修格里城: 8190,
            荒原站: 8346,
            曼德矿场: 8346,
            淘金乐园: 8502,
            贡露城: 9048,
            海角城: 9048,
            岚心城: 9516,
            铁盟哨站: 8190,
            阿妮塔发射中心: 8658,
            阿妮塔战备工厂: 8190,
            云岫桥基地: 8892,
            汇流塔: 8814,
            远星大桥: 8814,
            栖羽站: 9360,
            塔图站: 9204,
            黑月游乐城: 8580,
            维蒂林场: 8658
        },
        type: "Craft",
        craft: {
            银制列车工艺品: 0.375,
            金箔: 0.375,
            曼德工具箱: 0.375
        }
    },
    {
        name: "银制列车工艺品",
        buyPrices: {},
        buyLot: {},
        sellPrices: {
            七号自由港: 4251,
            阿妮塔能源研究所: 4485,
            澄明数据中心: 3900,
            修格里城: 4134,
            荒原站: 4251,
            曼德矿场: 4251,
            淘金乐园: 4368,
            贡露城: 4719,
            海角城: 4719,
            岚心城: 5070,
            铁盟哨站: 4134,
            阿妮塔发射中心: 4485,
            阿妮塔战备工厂: 4134,
            云岫桥基地: 4602,
            汇流塔: 4602,
            远星大桥: 4602,
            栖羽站: 4953,
            塔图站: 4836,
            黑月游乐城: 4368,
            维蒂林场: 4485
        },
        type: "Craft",
        craft: {
            银矿石: 0.375,
            曼德工具箱: 0.375
        }
    },
    {
        name: "帝王蟹",
        buyPrices: {
            汇流塔: 1280
        },
        buyLot: {
            汇流塔: 16
        },
        sellPrices: {
            七号自由港: 1728,
            阿妮塔能源研究所: 1562,
            修格里城: 1971,
            铁盟哨站: 2074,
            荒原站: 2074,
            曼德矿场: 1971,
            淘金乐园: 1971,
            澄明数据中心: 1869,
            阿妮塔战备工厂: 1766,
            阿妮塔发射中心: 1728,
            海角城: 1318,
            远星大桥: 1562,
            云岫桥基地: 2278,
            贡露城: 1702,
            岚心城: 2688,
            栖羽站: 2586,
            塔图站: 2214,
            黑月游乐城: 2074,
            维蒂林场: 1830,
            汇流塔: null
        },
        type: "Special"
    },
    {
        name: "太空棉",
        buyPrices: {},
        buyLot: {},
        sellPrices: {
            七号自由港: 2520,
            阿妮塔发射中心: 2250,
            阿妮塔能源研究所: 2453,
            阿妮塔战备工厂: 2520,
            澄明数据中心: 2588,
            贡露城: 2588,
            海角城: 2520,
            荒原站: 2723,
            汇流塔: 2588,
            远星大桥: 2520,
            岚心城: 3060,
            曼德矿场: 2723,
            淘金乐园: 2790,
            铁盟哨站: 2655,
            修格里城: 2588,
            云岫桥基地: 2790,
            栖羽站: 2993,
            塔图站: 2925,
            黑月游乐城: 2723,
            维蒂林场: 2655
        },
        type: "Craft"
    },
    {
        name: "岚心锦",
        buyPrices: {},
        buyLot: {},
        sellPrices: {
            七号自由港: 5518,
            阿妮塔能源研究所: 5655,
            修格里城: 5368,
            铁盟哨站: 5231,
            荒原站: 4969,
            曼德矿场: 5106,
            淘金乐园: 5243,
            澄明数据中心: 5380,
            阿妮塔战备工厂: 5518,
            阿妮塔发射中心: 5792,
            海角城: 5929,
            汇流塔: 6067,
            远星大桥: 5655,
            云岫桥基地: 4832,
            贡露城: 5904,
            岚心城: 4158,
            栖羽站: 4420,
            塔图站: 5780,
            黑月游乐城: 5655,
            维蒂林场: 5380
        },
        type: "Craft",
        craft: {
            金丝: 0.1875,
            锦缎: 0.375,
            缝纫工具包: 0.375
        }
    },
    {
        name: "岚心锦服",
        buyPrices: {
            岚心城: 5445
        },
        buyLot: {
            岚心城: 3
        },
        sellPrices: {
            七号自由港: 7226,
            阿妮塔能源研究所: 7405,
            修格里城: 7029,
            铁盟哨站: 6850,
            荒原站: 6507,
            曼德矿场: 6686,
            淘金乐园: 6866,
            澄明数据中心: 7046,
            阿妮塔战备工厂: 7226,
            阿妮塔发射中心: 7585,
            海角城: 7765,
            汇流塔: 7944,
            远星大桥: 7405,
            云岫桥基地: 6327,
            贡露城: 7732,
            栖羽站: 5788,
            塔图站: 7569,
            黑月游乐城: 7405,
            维蒂林场: 7046,
            岚心城: null
        },
        type: "Special",
        craft: {
            岚心锦: 0.375,
            金丝: 0.1875,
            缝纫工具包: 0.375
        }
    },
    {
        name: "宇航服",
        buyPrices: {},
        buyLot: {},
        sellPrices: {
            七号自由港: 11187,
            阿妮塔能源研究所: 11385,
            修格里城: 10593,
            铁盟哨站: 10593,
            荒原站: 10395,
            曼德矿场: 10593,
            淘金乐园: 10791,
            澄明数据中心: 10989,
            阿妮塔战备工厂: 10989,
            阿妮塔发射中心: 11583,
            海角城: 11781,
            汇流塔: 11979,
            远星大桥: 11385,
            云岫桥基地: 10197,
            贡露城: 11187,
            岚心城: 10989,
            栖羽站: 10791,
            塔图站: 11385,
            黑月游乐城: 11187,
            维蒂林场: 10989
        },
        type: "Craft",
        craft: {
            太空棉: 0.375,
            芳纶纤维: 0.375,
            碳纤维: 0.375,
            尼龙: 0.375,
            缝纫工具包: 0.375
        }
    },
    {
        name: "竹荚鱼",
        buyPrices: {
            远星大桥: 328
        },
        buyLot: {
            远星大桥: 32
        },
        sellPrices: {
            七号自由港: 407,
            阿妮塔能源研究所: 380,
            修格里城: 469,
            铁盟哨站: 433,
            荒原站: 433,
            曼德矿场: 407,
            淘金乐园: 407,
            澄明数据中心: 459,
            阿妮塔战备工厂: 407,
            阿妮塔发射中心: 407,
            海角城: 380,
            汇流塔: 380,
            云岫桥基地: 485,
            贡露城: 338,
            岚心城: 610,
            栖羽站: 584,
            塔图站: 479,
            黑月游乐城: 522,
            维蒂林场: 380,
            远星大桥: null
        },
        type: "Normal"
    },
    {
        name: "扇贝",
        buyPrices: {
            远星大桥: 168
        },
        buyLot: {
            远星大桥: 48
        },
        sellPrices: {
            七号自由港: 218,
            阿妮塔能源研究所: 202,
            修格里城: 257,
            铁盟哨站: 235,
            荒原站: 235,
            曼德矿场: 218,
            淘金乐园: 218,
            澄明数据中心: 252,
            阿妮塔战备工厂: 218,
            阿妮塔发射中心: 218,
            海角城: 202,
            汇流塔: 202,
            云岫桥基地: 269,
            贡露城: 173,
            岚心城: 341,
            栖羽站: 324,
            塔图站: 262,
            黑月游乐城: 291,
            维蒂林场: 202,
            远星大桥: null
        },
        type: "Normal"
    },
    {
        name: "鱼肝油",
        buyPrices: {
            汇流塔: 2680
        },
        buyLot: {
            汇流塔: 8
        },
        sellPrices: {
            七号自由港: 3296,
            阿妮塔能源研究所: 3028,
            修格里城: 3645,
            铁盟哨站: 3698,
            荒原站: 3698,
            曼德矿场: 3564,
            淘金乐园: 3564,
            澄明数据中心: 3430,
            阿妮塔战备工厂: 3296,
            阿妮塔发射中心: 3296,
            海角城: 2760,
            远星大桥: 3028,
            云岫桥基地: 4047,
            贡露城: 3243,
            岚心城: 4663,
            栖羽站: 4529,
            塔图站: 3993,
            黑月游乐城: 3859,
            维蒂林场: 3430,
            汇流塔: null
        },
        type: "Special"
    },
    {
        name: "黑毛牛排",
        buyPrices: {
            岚心城: 3333
        },
        buyLot: {
            岚心城: 6
        },
        sellPrices: {
            七号自由港: 5033,
            阿妮塔能源研究所: 5099,
            修格里城: 4700,
            铁盟哨站: 4533,
            荒原站: 4266,
            曼德矿场: 4533,
            淘金乐园: 4600,
            澄明数据中心: 4866,
            阿妮塔战备工厂: 4933,
            阿妮塔发射中心: 5266,
            海角城: 5533,
            汇流塔: 5699,
            远星大桥: 5099,
            云岫桥基地: 4100,
            贡露城: 5299,
            栖羽站: 3600,
            塔图站: 5199,
            黑月游乐城: 5099,
            维蒂林场: 4766,
            岚心城: null
        },
        type: "Special"
    },
    {
        name: "学会纪念品",
        buyPrices: {
            汇流塔: 2000
        },
        buyLot: {
            汇流塔: 12
        },
        sellPrices: {
            七号自由港: 2460,
            阿妮塔能源研究所: 2260,
            修格里城: 2660,
            铁盟哨站: 2760,
            荒原站: 2760,
            曼德矿场: 2660,
            淘金乐园: 2660,
            澄明数据中心: 2620,
            阿妮塔战备工厂: 2460,
            阿妮塔发射中心: 2460,
            海角城: 2060,
            远星大桥: 2260,
            云岫桥基地: 3020,
            贡露城: 2360,
            岚心城: 3420,
            栖羽站: 3320,
            塔图站: 2980,
            黑月游乐城: 2820,
            维蒂林场: 2560,
            汇流塔: null
        },
        type: "Special"
    },
    {
        name: "香薰蜡烛",
        buyPrices: {
            汇流塔: 864
        },
        buyLot: {
            汇流塔: 24
        },
        sellPrices: {
            七号自由港: 1063,
            阿妮塔能源研究所: 976,
            修格里城: 1175,
            铁盟哨站: 1192,
            荒原站: 1192,
            曼德矿场: 1149,
            淘金乐园: 1175,
            澄明数据中心: 1132,
            阿妮塔战备工厂: 1063,
            阿妮塔发射中心: 1063,
            海角城: 890,
            远星大桥: 976,
            云岫桥基地: 1305,
            贡露城: 1045,
            岚心城: 1477,
            栖羽站: 1434,
            塔图站: 1261,
            黑月游乐城: 1218,
            维蒂林场: 1106,
            汇流塔: null
        },
        type: "Special"
    },
    {
        name: "水银",
        buyPrices: {
            汇流塔: 964
        },
        buyLot: {
            汇流塔: 20
        },
        sellPrices: {
            七号自由港: 1118,
            阿妮塔能源研究所: 1041,
            修格里城: 1224,
            铁盟哨站: 1234,
            荒原站: 1263,
            曼德矿场: 1224,
            淘金乐园: 1195,
            澄明数据中心: 1186,
            阿妮塔战备工厂: 1147,
            阿妮塔发射中心: 1147,
            海角城: 993,
            远星大桥: 1041,
            云岫桥基地: 1340,
            贡露城: 1080,
            岚心城: 1494,
            栖羽站: 1456,
            塔图站: 1301,
            黑月游乐城: 1263,
            维蒂林场: 1157,
            汇流塔: null
        },
        type: "Normal"
    },
    {
        name: "马鲛鱼",
        buyPrices: {
            汇流塔: 264
        },
        buyLot: {
            汇流塔: 40
        },
        sellPrices: {
            七号自由港: 348,
            阿妮塔能源研究所: 306,
            修格里城: 399,
            铁盟哨站: 412,
            荒原站: 412,
            曼德矿场: 391,
            淘金乐园: 391,
            澄明数据中心: 370,
            阿妮塔战备工厂: 348,
            阿妮塔发射中心: 348,
            海角城: 264,
            远星大桥: 306,
            云岫桥基地: 454,
            贡露城: 335,
            岚心城: 546,
            栖羽站: 525,
            塔图站: 433,
            黑月游乐城: 412,
            维蒂林场: 370,
            汇流塔: null
        },
        type: "Normal"
    },
    {
        name: "贻贝",
        buyPrices: {
            汇流塔: 128
        },
        buyLot: {
            汇流塔: 48
        },
        sellPrices: {
            七号自由港: 169,
            阿妮塔能源研究所: 148,
            修格里城: 193,
            铁盟哨站: 200,
            荒原站: 200,
            曼德矿场: 189,
            淘金乐园: 189,
            澄明数据中心: 179,
            阿妮塔战备工厂: 169,
            阿妮塔发射中心: 169,
            海角城: 128,
            远星大桥: 148,
            云岫桥基地: 220,
            贡露城: 163,
            岚心城: 261,
            栖羽站: 251,
            塔图站: 210,
            黑月游乐城: 200,
            维蒂林场: 179,
            汇流塔: null
        },
        type: "Normal"
    },
    {
        name: "阿妮塔连体衣",
        buyPrices: {},
        buyLot: {},
        sellPrices: {
            七号自由港: 3376,
            阿妮塔发射中心: 3376,
            阿妮塔能源研究所: 3069,
            阿妮塔战备工厂: 3376,
            澄明数据中心: 3621,
            贡露城: 3407,
            海角城: 3407,
            荒原站: 3867,
            汇流塔: 3499,
            远星大桥: 3499,
            岚心城: 4481,
            曼德矿场: 3775,
            淘金乐园: 3775,
            铁盟哨站: 3744,
            修格里城: 3529,
            云岫桥基地: 3990,
            栖羽站: 4358,
            塔图站: 4205,
            黑月游乐城: 3867,
            维蒂林场: 3652
        },
        type: "Craft",
        craft: {
            芳纶纤维: 0.375,
            太空棉: 0.1875,
            缝纫工具包: 0.1875
        }
    },
    {
        name: "碳纤维索",
        buyPrices: {
            远星大桥: 2101
        },
        buyLot: {
            远星大桥: 16
        },
        sellPrices: {
            七号自由港: 2542,
            阿妮塔发射中心: 2542,
            阿妮塔能源研究所: 2437,
            阿妮塔战备工厂: 2542,
            澄明数据中心: 2689,
            贡露城: 2164,
            海角城: 2374,
            荒原站: 2584,
            汇流塔: 2437,
            岚心城: 3278,
            曼德矿场: 2542,
            淘金乐园: 2479,
            铁盟哨站: 2647,
            修格里城: 2752,
            云岫桥基地: 2920,
            栖羽站: 3173,
            塔图站: 2752,
            黑月游乐城: 3025,
            维蒂林场: 2374,
            远星大桥: null
        },
        type: "Special",
        craft: {
            碳纤维: 0.3,
            树脂: 0.15
        }
    },
    {
        name: "复合钢索",
        buyPrices: {
            远星大桥: 1440
        },
        buyLot: {
            远星大桥: 20
        },
        sellPrices: {
            七号自由港: 1699,
            阿妮塔发射中心: 1699,
            阿妮塔能源研究所: 1627,
            阿妮塔战备工厂: 1699,
            澄明数据中心: 1800,
            贡露城: 1440,
            海角城: 1584,
            荒原站: 1728,
            汇流塔: 1627,
            岚心城: 2203,
            曼德矿场: 1699,
            淘金乐园: 1656,
            铁盟哨站: 1771,
            修格里城: 1843,
            云岫桥基地: 1958,
            栖羽站: 2131,
            塔图站: 1843,
            黑月游乐城: 2030,
            维蒂林场: 1584,
            远星大桥: null
        },
        type: "Normal"
    },
    {
        name: "玄武岩纤维",
        buyPrices: {
            远星大桥: 1101
        },
        buyLot: {
            远星大桥: 24
        },
        sellPrices: {
            七号自由港: 1365,
            阿妮塔发射中心: 1365,
            阿妮塔能源研究所: 1299,
            阿妮塔战备工厂: 1365,
            澄明数据中心: 1497,
            贡露城: 1167,
            海角城: 1299,
            荒原站: 1398,
            汇流塔: 1299,
            岚心城: 1828,
            曼德矿场: 1332,
            淘金乐园: 1332,
            铁盟哨站: 1398,
            修格里城: 1497,
            云岫桥基地: 1530,
            栖羽站: 1729,
            塔图站: 1497,
            黑月游乐城: 1629,
            维蒂林场: 1266,
            远星大桥: null
        },
        type: "Special",
        craft: {
            玄武岩: 0.15
        }
    },
    {
        name: "象拔蚌",
        buyPrices: {
            远星大桥: 896
        },
        buyLot: {
            远星大桥: 16
        },
        sellPrices: {
            七号自由港: 1192,
            阿妮塔发射中心: 1192,
            阿妮塔能源研究所: 1129,
            阿妮塔战备工厂: 1219,
            澄明数据中心: 1398,
            贡露城: 977,
            海角城: 1102,
            荒原站: 1308,
            汇流塔: 1102,
            岚心城: 1873,
            曼德矿场: 1219,
            淘金乐园: 1219,
            铁盟哨站: 1308,
            修格里城: 1425,
            云岫桥基地: 1487,
            栖羽站: 1756,
            塔图站: 1425,
            黑月游乐城: 1577,
            维蒂林场: 1102,
            远星大桥: null
        },
        type: "Special"
    },
    {
        name: "索具",
        buyPrices: {
            远星大桥: 770
        },
        buyLot: {
            远星大桥: 24
        },
        sellPrices: {
            七号自由港: 909,
            阿妮塔发射中心: 909,
            阿妮塔能源研究所: 870,
            阿妮塔战备工厂: 909,
            澄明数据中心: 963,
            贡露城: 793,
            海角城: 870,
            荒原站: 924,
            汇流塔: 870,
            岚心城: 1178,
            曼德矿场: 909,
            淘金乐园: 886,
            铁盟哨站: 924,
            修格里城: 963,
            云岫桥基地: 1024,
            栖羽站: 1117,
            塔图站: 986,
            黑月游乐城: 1086,
            维蒂林场: 847,
            远星大桥: null
        },
        type: "Normal"
    },
    {
        name: "陨铁矿",
        buyPrices: {
            远星大桥: 560
        },
        buyLot: {
            远星大桥: 32
        },
        sellPrices: {
            七号自由港: 745,
            阿妮塔发射中心: 762,
            阿妮塔能源研究所: 706,
            阿妮塔战备工厂: 745,
            澄明数据中心: 857,
            贡露城: 577,
            海角城: 689,
            荒原站: 801,
            汇流塔: 689,
            岚心城: 1154,
            曼德矿场: 762,
            淘金乐园: 745,
            铁盟哨站: 801,
            修格里城: 857,
            云岫桥基地: 913,
            栖羽站: 1081,
            塔图站: 874,
            黑月游乐城: 969,
            维蒂林场: 689,
            远星大桥: null
        },
        type: "Special"
    },
    {
        name: "玄武岩",
        buyPrices: {
            远星大桥: 367
        },
        buyLot: {
            远星大桥: 40
        },
        sellPrices: {
            七号自由港: 422,
            阿妮塔发射中心: 433,
            阿妮塔能源研究所: 415,
            阿妮塔战备工厂: 433,
            澄明数据中心: 470,
            贡露城: 378,
            海角城: 404,
            荒原站: 440,
            汇流塔: 415,
            岚心城: 562,
            曼德矿场: 422,
            淘金乐园: 422,
            铁盟哨站: 440,
            修格里城: 459,
            云岫桥基地: 477,
            栖羽站: 532,
            塔图站: 470,
            黑月游乐城: 495,
            维蒂林场: 404,
            远星大桥: null
        },
        type: "Normal"
    },
    {
        name: "水泥",
        buyPrices: {
            远星大桥: 56
        },
        buyLot: {
            远星大桥: 56
        },
        sellPrices: {
            七号自由港: 64,
            阿妮塔发射中心: 66,
            阿妮塔能源研究所: 62,
            阿妮塔战备工厂: 64,
            澄明数据中心: 70,
            贡露城: 56,
            海角城: 62,
            荒原站: 67,
            汇流塔: 62,
            岚心城: 84,
            曼德矿场: 64,
            淘金乐园: 64,
            铁盟哨站: 67,
            修格里城: 70,
            云岫桥基地: 73,
            栖羽站: 81,
            塔图站: 70,
            黑月游乐城: 76,
            维蒂林场: 62,
            远星大桥: null
        },
        type: "Normal"
    },
    {
        name: "飞弹",
        buyPrices: {},
        buyLot: {},
        sellPrices: {
            七号自由港: 10056,
            阿妮塔发射中心: 10602,
            阿妮塔能源研究所: 10192,
            阿妮塔战备工厂: 10192,
            澄明数据中心: 9919,
            贡露城: 10056,
            海角城: 10738,
            荒原站: 9510,
            汇流塔: 10875,
            远星大桥: 10465,
            岚心城: 10192,
            曼德矿场: 9646,
            淘金乐园: 9783,
            铁盟哨站: 9919,
            修格里城: 9919,
            栖羽站: 10056,
            塔图站: 10465,
            黑月游乐城: 10056,
            维蒂林场: 9919
        },
        type: "Craft"
    },
    {
        name: "碳钢匕首",
        buyPrices: {
            栖羽站: 1573
        },
        buyLot: {
            栖羽站: 18
        },
        sellPrices: {
            七号自由港: 2249,
            阿妮塔发射中心: 2407,
            阿妮塔能源研究所: 2328,
            阿妮塔战备工厂: 2297,
            澄明数据中心: 2171,
            贡露城: 2297,
            海角城: 2485,
            荒原站: 1935,
            汇流塔: 2564,
            远星大桥: 2328,
            岚心城: 1699,
            曼德矿场: 2013,
            淘金乐园: 2092,
            铁盟哨站: 2061,
            修格里城: 2139,
            云岫桥基地: 1903,
            塔图站: 2375,
            黑月游乐城: 2249,
            维蒂林场: 2218,
            栖羽站: null
        },
        type: "Special"
    },
    {
        name: "鹅绒被",
        buyPrices: {
            栖羽站: 1188
        },
        buyLot: {
            栖羽站: 21
        },
        sellPrices: {
            七号自由港: 1794,
            阿妮塔发射中心: 1936,
            阿妮塔能源研究所: 1865,
            阿妮塔战备工厂: 1794,
            澄明数据中心: 1723,
            贡露城: 1794,
            海角城: 2008,
            荒原站: 1509,
            汇流塔: 2079,
            远星大桥: 1865,
            岚心城: 1331,
            曼德矿场: 1580,
            淘金乐园: 1651,
            铁盟哨站: 1580,
            修格里城: 1651,
            云岫桥基地: 1437,
            塔图站: 1865,
            黑月游乐城: 1794,
            维蒂林场: 1723,
            栖羽站: null
        },
        type: "Special",
        craft: {
            纯棉布料: 0.09375,
            鹅绒: 0.09375,
            缝纫工具包: 0.09375
        }
    },
    {
        name: "鹅绒",
        buyPrices: {
            栖羽站: 792
        },
        buyLot: {
            栖羽站: 24
        },
        sellPrices: {
            七号自由港: 1196,
            阿妮塔发射中心: 1291,
            阿妮塔能源研究所: 1243,
            阿妮塔战备工厂: 1196,
            澄明数据中心: 1148,
            贡露城: 1196,
            海角城: 1338,
            荒原站: 1006,
            汇流塔: 1386,
            远星大桥: 1243,
            岚心城: 887,
            曼德矿场: 1053,
            淘金乐园: 1101,
            铁盟哨站: 1053,
            修格里城: 1101,
            云岫桥基地: 958,
            塔图站: 1243,
            黑月游乐城: 1196,
            维蒂林场: 1148,
            栖羽站: null
        },
        type: "Special",
        craft: {
            鹅: 0.1875
        }
    },
    {
        name: "羽绒睡袋",
        buyPrices: {
            栖羽站: 891
        },
        buyLot: {
            栖羽站: 24
        },
        sellPrices: {
            七号自由港: 1319,
            阿妮塔发射中心: 1452,
            阿妮塔能源研究所: 1399,
            阿妮塔战备工厂: 1345,
            澄明数据中心: 1265,
            贡露城: 1345,
            海角城: 1479,
            荒原站: 1105,
            汇流塔: 1533,
            远星大桥: 1399,
            岚心城: 944,
            曼德矿场: 1158,
            淘金乐园: 1212,
            铁盟哨站: 1185,
            修格里城: 1212,
            云岫桥基地: 1078,
            塔图站: 1372,
            黑月游乐城: 1345,
            维蒂林场: 1292,
            栖羽站: null
        },
        type: "Special",
        craft: {
            纯棉布料: 0.10714285714285714,
            羽绒: 0.10714285714285714,
            缝纫工具包: 0.10714285714285714
        }
    },
    {
        name: "牛",
        buyPrices: {
            栖羽站: 513
        },
        buyLot: {
            栖羽站: 27
        },
        sellPrices: {
            七号自由港: 857,
            阿妮塔能源研究所: 882,
            澄明数据中心: 816,
            修格里城: 775,
            荒原站: 693,
            曼德矿场: 718,
            淘金乐园: 759,
            贡露城: 872,
            海角城: 964,
            岚心城: 569,
            铁盟哨站: 718,
            阿妮塔发射中心: 923,
            阿妮塔战备工厂: 841,
            云岫桥基地: 636,
            汇流塔: 1005,
            远星大桥: 882,
            塔图站: 898,
            黑月游乐城: 841,
            维蒂林场: 816,
            栖羽站: null
        },
        type: "Normal"
    },
    {
        name: "鹅",
        buyPrices: {
            栖羽站: 198
        },
        buyLot: {
            栖羽站: 36
        },
        sellPrices: {
            七号自由港: 362,
            阿妮塔能源研究所: 376,
            澄明数据中心: 337,
            修格里城: 323,
            荒原站: 283,
            曼德矿场: 303,
            淘金乐园: 323,
            贡露城: 362,
            海角城: 422,
            岚心城: 218,
            铁盟哨站: 297,
            阿妮塔发射中心: 396,
            阿妮塔战备工厂: 356,
            云岫桥基地: 263,
            汇流塔: 436,
            远星大桥: 376,
            塔图站: 382,
            黑月游乐城: 356,
            维蒂林场: 343,
            栖羽站: null
        },
        type: "Normal"
    },
    {
        name: "树脂",
        buyPrices: {
            栖羽站: 624,
            维蒂林场: 842
        },
        buyLot: {
            栖羽站: 24,
            维蒂林场: 24
        },
        sellPrices: {
            七号自由港: 892,
            阿妮塔发射中心: 955,
            阿妮塔能源研究所: 942,
            阿妮塔战备工厂: 911,
            澄明数据中心: 861,
            贡露城: 874,
            海角城: 967,
            荒原站: 749,
            汇流塔: 1017,
            岚心城: 693,
            曼德矿场: 799,
            淘金乐园: 811,
            铁盟哨站: 780,
            云岫桥基地: 736,
            远星大桥: 942,
            修格里城: 830,
            塔图站: 905,
            黑月游乐城: 892,
            栖羽站: null,
            维蒂林场: null
        },
        type: "Normal"
    },
    {
        name: "石蜡",
        buyPrices: {
            塔图站: 616
        },
        buyLot: {
            塔图站: 20
        },
        sellPrices: {
            七号自由港: 764,
            阿妮塔发射中心: 782,
            阿妮塔能源研究所: 764,
            阿妮塔战备工厂: 745,
            澄明数据中心: 745,
            贡露城: 727,
            海角城: 745,
            荒原站: 690,
            汇流塔: 782,
            岚心城: 801,
            曼德矿场: 690,
            栖羽站: 782,
            淘金乐园: 671,
            铁盟哨站: 708,
            修格里城: 708,
            远星大桥: 708,
            云岫桥基地: 745,
            黑月游乐城: 764,
            维蒂林场: 671,
            塔图站: null
        },
        type: "Normal"
    },
    {
        name: "石油",
        buyPrices: {
            塔图站: 518
        },
        buyLot: {
            塔图站: 20
        },
        sellPrices: {
            七号自由港: 730,
            阿妮塔发射中心: 798,
            阿妮塔能源研究所: 730,
            阿妮塔战备工厂: 746,
            澄明数据中心: 704,
            贡露城: 679,
            海角城: 730,
            荒原站: 653,
            汇流塔: 756,
            远星大桥: 679,
            岚心城: 808,
            曼德矿场: 627,
            淘金乐园: 601,
            铁盟哨站: 668,
            修格里城: 694,
            云岫桥基地: 704,
            栖羽站: 782,
            黑月游乐城: 756,
            维蒂林场: 627,
            塔图站: null
        },
        type: "Normal"
    },
    {
        name: "硅矿石",
        buyPrices: {
            塔图站: 420
        },
        buyLot: {
            塔图站: 32
        },
        sellPrices: {
            七号自由港: 521,
            阿妮塔发射中心: 546,
            阿妮塔能源研究所: 521,
            阿妮塔战备工厂: 521,
            澄明数据中心: 508,
            贡露城: 483,
            海角城: 533,
            荒原站: 470,
            汇流塔: 533,
            岚心城: 559,
            曼德矿场: 470,
            栖羽站: 533,
            淘金乐园: 445,
            铁盟哨站: 470,
            修格里城: 496,
            远星大桥: 483,
            云岫桥基地: 496,
            黑月游乐城: 521,
            维蒂林场: 458,
            塔图站: null
        },
        type: "Normal"
    },
    {
        name: "黄铁矿",
        buyPrices: {
            塔图站: 315
        },
        buyLot: {
            塔图站: 40
        },
        sellPrices: {
            七号自由港: 381,
            阿妮塔发射中心: 410,
            阿妮塔能源研究所: 381,
            阿妮塔战备工厂: 391,
            澄明数据中心: 372,
            贡露城: 362,
            海角城: 381,
            荒原站: 353,
            汇流塔: 391,
            岚心城: 410,
            曼德矿场: 353,
            栖羽站: 400,
            淘金乐园: 334,
            铁盟哨站: 362,
            修格里城: 362,
            远星大桥: 362,
            云岫桥基地: 381,
            黑月游乐城: 391,
            维蒂林场: 343,
            塔图站: null
        },
        type: "Normal"
    },
    {
        name: "石灰岩",
        buyPrices: {
            塔图站: 140
        },
        buyLot: {
            塔图站: 48
        },
        sellPrices: {
            七号自由港: 169,
            阿妮塔发射中心: 178,
            阿妮塔能源研究所: 169,
            阿妮塔战备工厂: 174,
            澄明数据中心: 165,
            贡露城: 161,
            海角城: 169,
            荒原站: 157,
            汇流塔: 174,
            岚心城: 182,
            曼德矿场: 157,
            栖羽站: 178,
            淘金乐园: 148,
            铁盟哨站: 161,
            修格里城: 165,
            远星大桥: 169,
            云岫桥基地: 165,
            黑月游乐城: 174,
            维蒂林场: 153,
            塔图站: null
        },
        type: "Normal"
    },
    {
        name: "游乐城主题配饰",
        buyPrices: {
            黑月游乐城: 1414
        },
        buyLot: {
            黑月游乐城: 12
        },
        sellPrices: {
            七号自由港: 1782,
            阿妮塔发射中心: 1881,
            阿妮塔能源研究所: 1810,
            阿妮塔战备工厂: 1669,
            澄明数据中心: 1640,
            贡露城: 2036,
            海角城: 1994,
            荒原站: 1739,
            汇流塔: 1951,
            岚心城: 2248,
            曼德矿场: 1782,
            栖羽站: 2022,
            塔图站: 2022,
            淘金乐园: 1852,
            铁盟哨站: 1669,
            修格里城: 1640,
            远星大桥: 1951,
            云岫桥基地: 1810,
            维蒂林场: 1881,
            黑月游乐城: null
        },
        type: "Special"
    },
    {
        name: "纪念卫衣",
        buyPrices: {
            黑月游乐城: 630
        },
        buyLot: {
            黑月游乐城: 24
        },
        sellPrices: {
            七号自由港: 794,
            阿妮塔发射中心: 838,
            阿妮塔能源研究所: 806,
            阿妮塔战备工厂: 743,
            澄明数据中心: 731,
            贡露城: 907,
            海角城: 888,
            荒原站: 775,
            汇流塔: 869,
            岚心城: 1002,
            曼德矿场: 794,
            栖羽站: 901,
            塔图站: 901,
            淘金乐园: 825,
            铁盟哨站: 743,
            修格里城: 731,
            远星大桥: 869,
            云岫桥基地: 806,
            维蒂林场: 838,
            黑月游乐城: null
        },
        type: "Normal"
    },
    {
        name: "限定公仔",
        buyPrices: {
            黑月游乐城: 2121
        },
        buyLot: {
            黑月游乐城: 9
        },
        sellPrices: {
            七号自由港: 2842,
            阿妮塔发射中心: 3075,
            阿妮塔能源研究所: 2991,
            阿妮塔战备工厂: 2630,
            澄明数据中心: 2545,
            贡露城: 3351,
            海角城: 3288,
            荒原站: 2779,
            汇流塔: 3224,
            岚心城: 3797,
            曼德矿场: 2842,
            栖羽站: 3372,
            塔图站: 3372,
            淘金乐园: 2991,
            铁盟哨站: 2630,
            修格里城: 2545,
            远星大桥: 3224,
            云岫桥基地: 2927,
            维蒂林场: 3075,
            黑月游乐城: null
        },
        type: "Special"
    },
    {
        name: "限定典藏游戏卡带",
        buyPrices: {
            黑月游乐城: 1295
        },
        buyLot: {
            黑月游乐城: 15
        },
        sellPrices: {
            七号自由港: 1645,
            阿妮塔发射中心: 1839,
            阿妮塔能源研究所: 1761,
            阿妮塔战备工厂: 1606,
            澄明数据中心: 1489,
            贡露城: 1917,
            海角城: 1917,
            荒原站: 1684,
            汇流塔: 1917,
            岚心城: 2150,
            曼德矿场: 1684,
            栖羽站: 1994,
            塔图站: 2033,
            淘金乐园: 1761,
            铁盟哨站: 1567,
            修格里城: 1489,
            远星大桥: 1878,
            云岫桥基地: 1800,
            维蒂林场: 1800,
            黑月游乐城: null
        },
        type: "Special"
    },
    {
        name: "游乐城纪念唱片",
        buyPrices: {
            黑月游乐城: 735
        },
        buyLot: {
            黑月游乐城: 18
        },
        sellPrices: {
            七号自由港: 1051,
            阿妮塔发射中心: 1220,
            阿妮塔能源研究所: 1147,
            阿妮塔战备工厂: 1000,
            澄明数据中心: 904,
            贡露城: 1294,
            海角城: 1294,
            荒原站: 1073,
            汇流塔: 1294,
            岚心城: 1514,
            曼德矿场: 1073,
            栖羽站: 1367,
            塔图站: 1389,
            淘金乐园: 1147,
            铁盟哨站: 978,
            修格里城: 904,
            远星大桥: 1272,
            云岫桥基地: 1169,
            维蒂林场: 1198,
            黑月游乐城: null
        },
        type: "Special"
    },
    {
        name: "城堡摆件",
        buyPrices: {
            黑月游乐城: 574
        },
        buyLot: {
            黑月游乐城: 30
        },
        sellPrices: {
            七号自由港: 723,
            阿妮塔发射中心: 746,
            阿妮塔能源研究所: 735,
            阿妮塔战备工厂: 660,
            澄明数据中心: 649,
            贡露城: 809,
            海角城: 809,
            荒原站: 689,
            汇流塔: 775,
            岚心城: 895,
            曼德矿场: 706,
            栖羽站: 804,
            塔图站: 804,
            淘金乐园: 735,
            铁盟哨站: 660,
            修格里城: 666,
            远星大桥: 775,
            云岫桥基地: 718,
            维蒂林场: 746,
            黑月游乐城: null
        },
        type: "Normal"
    },
    {
        name: "游乐城纪念徽章",
        buyPrices: {
            黑月游乐城: 231
        },
        buyLot: {
            黑月游乐城: 42
        },
        sellPrices: {
            七号自由港: 430,
            阿妮塔发射中心: 515,
            阿妮塔能源研究所: 476,
            阿妮塔战备工厂: 377,
            澄明数据中心: 337,
            贡露城: 575,
            海角城: 568,
            荒原站: 423,
            汇流塔: 561,
            岚心城: 714,
            曼德矿场: 430,
            栖羽站: 608,
            塔图站: 608,
            淘金乐园: 476,
            铁盟哨站: 377,
            修格里城: 337,
            远星大桥: 561,
            云岫桥基地: 469,
            维蒂林场: 515,
            黑月游乐城: null
        },
        type: "Special"
    },
    {
        name: "游乐城纪念文具",
        buyPrices: {
            黑月游乐城: 161
        },
        buyLot: {
            黑月游乐城: 54
        },
        sellPrices: {
            七号自由港: 198,
            阿妮塔发射中心: 209,
            阿妮塔能源研究所: 201,
            阿妮塔战备工厂: 185,
            澄明数据中心: 182,
            贡露城: 227,
            海角城: 227,
            荒原站: 193,
            汇流塔: 217,
            岚心城: 251,
            曼德矿场: 198,
            栖羽站: 225,
            塔图站: 225,
            淘金乐园: 206,
            铁盟哨站: 185,
            修格里城: 187,
            远星大桥: 217,
            云岫桥基地: 201,
            维蒂林场: 209,
            黑月游乐城: null
        },
        type: "Normal"
    },
    {
        name: "钛钢轨条",
        buyPrices: {},
        buyLot: {},
        sellPrices: {
            七号自由港: 3150,
            阿妮塔发射中心: 3150,
            阿妮塔能源研究所: 3150,
            阿妮塔战备工厂: 3150,
            澄明数据中心: 3150,
            贡露城: 3150,
            海角城: 3150,
            黑月游乐城: 3150,
            荒原站: 3150,
            汇流塔: 3150,
            岚心城: 3150,
            曼德矿场: 3150,
            栖羽站: 3150,
            塔图站: 3150,
            淘金乐园: 3150,
            铁盟哨站: 3150,
            修格里城: 3150,
            远星大桥: 3150,
            云岫桥基地: 3150
        },
        type: "Craft",
        craft: {
            钛合金: 0.75,
            铁轨用特种钢材: 0.375
        }
    },
    {
        name: "黑胡桃木座钟",
        buyPrices: {
            维蒂林场: 3375
        },
        buyLot: {
            维蒂林场: 8
        },
        sellPrices: {
            贡露城: 3713,
            维蒂林场: null
        },
        type: "Special",
        craft: {
            胡桃木: 0.375,
            精密木构件: 0.1875,
            曼德工具箱: 0.1875
        }
    },
    {
        name: "优质松木",
        buyPrices: {
            维蒂林场: 775
        },
        buyLot: {
            维蒂林场: 28
        },
        sellPrices: {
            贡露城: 837,
            维蒂林场: null
        },
        type: "Normal"
    },
    {
        name: "白蜡木",
        buyPrices: {
            维蒂林场: 1075
        },
        buyLot: {
            维蒂林场: 20
        },
        sellPrices: {
            贡露城: 1193,
            维蒂林场: null
        },
        type: "Normal"
    },
    {
        name: "胡桃木",
        buyPrices: {
            维蒂林场: 1475
        },
        buyLot: {
            维蒂林场: 16
        },
        sellPrices: {
            贡露城: 1637,
            维蒂林场: null
        },
        type: "Special"
    },
    {
        name: "精密木构件",
        buyPrices: {
            维蒂林场: 975
        },
        buyLot: {
            维蒂林场: 24
        },
        sellPrices: {
            贡露城: 1053,
            维蒂林场: null
        },
        type: "Normal"
    },
    {
        name: "树脂复合木板",
        buyPrices: {
            维蒂林场: 675
        },
        buyLot: {
            维蒂林场: 1
        },
        sellPrices: {
            贡露城: 695,
            维蒂林场: null
        },
        type: "Normal",
        craft: {
            优质松木: 0.0625,
            树脂: 0.125
        }
    },
    {
        name: "精钢伐木斧",
        buyPrices: {
            维蒂林场: 1775
        },
        buyLot: {
            维蒂林场: 16
        },
        sellPrices: {
            贡露城: 1828,
            维蒂林场: null
        },
        type: "Normal",
        craft: {
            白蜡木: 0.125,
            精钢: 0.125
        }
    },
    {
        name: "高山云杉",
        buyPrices: {
            维蒂林场: 2175
        },
        buyLot: {
            维蒂林场: 12
        },
        sellPrices: {
            贡露城: 2414,
            维蒂林场: null
        },
        type: "Special"
    },
    {
        name: "烟熏橡木",
        buyPrices: {
            维蒂林场: 1275
        },
        buyLot: {
            维蒂林场: 16
        },
        sellPrices: {
            贡露城: 1415,
            维蒂林场: null
        },
        type: "Special"
    },
    {
        name: "松香",
        buyPrices: {
            维蒂林场: 375
        },
        buyLot: {
            维蒂林场: 36
        },
        sellPrices: {
            贡露城: 405,
            维蒂林场: null
        },
        type: "Normal"
    }
]