import { Product, ProductUnlockConditions } from "../interfaces/product";
import {
  GOODS_UNLOCK_CONDITIONS as goodsUnlockConditions,
  PRODUCTS as pdtData,
} from "resonance-data-columba/dist/columbabuild";

export var products_default = [
  {
    name: "发动机",
    buyPrices: {
      修格里城: 3363
    },
    buyLot: {
      修格里城: 9
    },
    sellPrices: {
      七号自由港: 3666,
      曼德矿场: 3565,
      海角城: 4069,
      荒原站: 3565,
      淘金乐园: 3767,
      阿妮塔发射中心: 3867,
      阿妮塔战备工厂: 3666,
      阿妮塔能源研究所: 3867,
      澄明数据中心: 3565,
      铁盟哨站: 3464,
      修格里城: null
    },
    type: "Special"
  },
  {
    name: "弹丸加速装置",
    buyPrices: {
      修格里城: 2147,
      铁盟哨站: 2147
    },
    buyLot: {
      修格里城: 18,
      铁盟哨站: 18
    },
    sellPrices: {
      七号自由港: 2383,
      曼德矿场: 2297,
      海角城: 2705,
      荒原站: 2297,
      淘金乐园: 2448,
      阿妮塔发射中心: 2555,
      阿妮塔战备工厂: 2448,
      阿妮塔能源研究所: 2469,
      澄明数据中心: 2297,
      修格里城: null,
      铁盟哨站: null
    },
    type: "Special"
  },
  {
    name: "家电",
    buyPrices: {
      修格里城: 1088
    },
    buyLot: {
      修格里城: 21
    },
    sellPrices: {
      七号自由港: 1153,
      曼德矿场: 1121,
      海角城: 1251,
      荒原站: 1153,
      淘金乐园: 1186,
      阿妮塔发射中心: 1219,
      阿妮塔战备工厂: 1153,
      阿妮塔能源研究所: 1186,
      澄明数据中心: 1153,
      铁盟哨站: 1088,
      修格里城: null
    },
    type: "Normal"
  },
  {
    name: "纯棉布料",
    buyPrices: {
      修格里城: 825
    },
    buyLot: {
      修格里城: 21
    },
    sellPrices: {
      七号自由港: 875,
      曼德矿场: 850,
      海角城: 974,
      荒原站: 850,
      淘金乐园: 875,
      阿妮塔发射中心: 924,
      阿妮塔战备工厂: 875,
      阿妮塔能源研究所: 899,
      澄明数据中心: 850,
      铁盟哨站: 825,
      修格里城: null
    },
    type: "Special"
  },
  {
    name: "汽配零件",
    buyPrices: {
      修格里城: 720
    },
    buyLot: {
      修格里城: 24
    },
    sellPrices: {
      七号自由港: 814,
      曼德矿场: 756,
      海角城: 922,
      荒原站: 778,
      淘金乐园: 792,
      阿妮塔发射中心: 886,
      阿妮塔战备工厂: 792,
      阿妮塔能源研究所: 828,
      澄明数据中心: 756,
      铁盟哨站: 742,
      修格里城: null
    },
    type: "Normal"
  },
  {
    name: "红茶",
    buyPrices: {
      修格里城: 688
    },
    buyLot: {
      修格里城: 30
    },
    sellPrices: {
      七号自由港: 874,
      曼德矿场: 791,
      海角城: 1142,
      荒原站: 791,
      淘金乐园: 874,
      阿妮塔发射中心: 1039,
      阿妮塔战备工厂: 874,
      阿妮塔能源研究所: 956,
      澄明数据中心: 791,
      铁盟哨站: 709,
      修格里城: null
    },
    type: "Special"
  },
  {
    name: "高档餐具",
    buyPrices: {
      修格里城: 368
    },
    buyLot: {
      修格里城: 36
    },
    sellPrices: {
      七号自由港: 397,
      曼德矿场: 383,
      海角城: 442,
      荒原站: 383,
      淘金乐园: 397,
      阿妮塔发射中心: 427,
      阿妮塔战备工厂: 397,
      阿妮塔能源研究所: 412,
      澄明数据中心: 383,
      铁盟哨站: 368,
      修格里城: null
    },
    type: "Normal"
  },
  {
    name: "沃德烤鸡",
    buyPrices: {
      修格里城: 298
    },
    buyLot: {
      修格里城: 39
    },
    sellPrices: {
      七号自由港: 465,
      曼德矿场: 390,
      海角城: 688,
      荒原站: 381,
      淘金乐园: 465,
      阿妮塔发射中心: 614,
      阿妮塔战备工厂: 456,
      阿妮塔能源研究所: 539,
      澄明数据中心: 381,
      铁盟哨站: 316,
      修格里城: null
    },
    type: "Special"
  },
  {
    name: "罐头",
    buyPrices: {
      修格里城: 105
    },
    buyLot: {
      修格里城: 45
    },
    sellPrices: {
      七号自由港: 116,
      曼德矿场: 113,
      海角城: 131,
      荒原站: 110,
      淘金乐园: 119,
      阿妮塔发射中心: 129,
      阿妮塔战备工厂: 116,
      阿妮塔能源研究所: 124,
      澄明数据中心: 113,
      铁盟哨站: 108,
      修格里城: null
    },
    type: "Normal"
  },
  {
    name: "沃德山泉",
    buyPrices: {
      修格里城: 50
    },
    buyLot: {
      修格里城: 60
    },
    sellPrices: {
      七号自由港: 70,
      曼德矿场: 60,
      海角城: 100,
      荒原站: 60,
      淘金乐园: 70,
      阿妮塔发射中心: 90,
      阿妮塔战备工厂: 70,
      阿妮塔能源研究所: 80,
      澄明数据中心: 62,
      铁盟哨站: 52,
      修格里城: null
    },
    type: "Normal"
  },
  {
    name: "修格里严选礼包",
    sellPrices: {
      修格里城: 1888,
      七号自由港: 2190,
      曼德矿场: 2096,
      海角城: 2473,
      荒原站: 2096,
      淘金乐园: 2190,
      阿妮塔发射中心: 2379,
      阿妮塔战备工厂: 2190,
      阿妮塔能源研究所: 2284,
      澄明数据中心: 2096,
      铁盟哨站: 2001
    },
    type: "Craft",
    craft: {
      红茶: 0.3333333333333333,
      沃德烤鸡: 0.3333333333333333,
      罐头: 0.3333333333333333,
      沃德山泉: 0.3333333333333333
    },
    buyPrices: {
      修格里城: 99999
    }
  },
  {
    name: "防弹背心",
    sellPrices: {
      修格里城: 2932,
      七号自由港: 3359,
      曼德矿场: 2932,
      海角城: 3701,
      荒原站: 2932,
      淘金乐园: 3246,
      阿妮塔发射中心: 3587,
      阿妮塔战备工厂: 3246,
      阿妮塔能源研究所: 3473,
      澄明数据中心: 3132,
      铁盟哨站: null
    },
    type: "Special",
    buyPrices: {
      铁盟哨站: 2847
    },
    buyLot: {
      铁盟哨站: 10
    }
  },
  {
    name: "炮弹",
    sellPrices: {
      修格里城: 1710,
      七号自由港: 1915,
      曼德矿场: 1761,
      海角城: 2069,
      荒原站: 1761,
      淘金乐园: 1864,
      阿妮塔发射中心: 2069,
      阿妮塔战备工厂: 1915,
      阿妮塔能源研究所: 1967,
      澄明数据中心: 1813,
      铁盟哨站: null
    },
    type: "Normal",
    buyPrices: {
      铁盟哨站: 1710
    },
    buyLot: {
      铁盟哨站: 15
    }
  },
  {
    name: "精钢",
    sellPrices: {
      修格里城: 1411,
      七号自由港: 1658,
      曼德矿场: 1452,
      海角城: 1863,
      荒原站: 1411,
      淘金乐园: 1589,
      阿妮塔发射中心: 1795,
      阿妮塔战备工厂: 1589,
      阿妮塔能源研究所: 1726,
      澄明数据中心: 1480,
      铁盟哨站: null
    },
    type: "Special",
    buyPrices: {
      铁盟哨站: 1370
    },
    buyLot: {
      铁盟哨站: 17
    }
  },
  {
    name: "塑胶炸药",
    sellPrices: {
      修格里城: 827,
      七号自由港: 951,
      曼德矿场: 852,
      海角城: 1075,
      荒原站: 852,
      淘金乐园: 943,
      阿妮塔发射中心: 1042,
      阿妮塔战备工厂: 943,
      阿妮塔能源研究所: 984,
      澄明数据中心: 885,
      铁盟哨站: null
    },
    type: "Normal",
    buyPrices: {
      铁盟哨站: 827
    },
    buyLot: {
      铁盟哨站: 20
    }
  },
  {
    name: "子弹",
    sellPrices: {
      修格里城: 677,
      七号自由港: 758,
      曼德矿场: 697,
      海角城: 839,
      荒原站: 697,
      淘金乐园: 758,
      阿妮塔发射中心: 819,
      阿妮塔战备工厂: 758,
      阿妮塔能源研究所: 779,
      澄明数据中心: 718,
      铁盟哨站: null
    },
    type: "Normal",
    buyPrices: {
      铁盟哨站: 677
    },
    buyLot: {
      铁盟哨站: 20
    }
  },
  {
    name: "汽油",
    sellPrices: {
      修格里城: 587,
      七号自由港: 656,
      曼德矿场: 587,
      海角城: 707,
      荒原站: 587,
      淘金乐园: 638,
      阿妮塔发射中心: 707,
      阿妮塔战备工厂: 638,
      阿妮塔能源研究所: 673,
      澄明数据中心: 604,
      铁盟哨站: null
    },
    type: "Normal",
    buyPrices: {
      铁盟哨站: 570
    },
    buyLot: {
      铁盟哨站: 27
    }
  },
  {
    name: "靛红五月军用食品",
    sellPrices: {
      修格里城: 182,
      七号自由港: 204,
      曼德矿场: 177,
      海角城: 235,
      荒原站: 177,
      淘金乐园: 195,
      阿妮塔发射中心: 227,
      阿妮塔战备工厂: 200,
      阿妮塔能源研究所: 218,
      澄明数据中心: 191,
      铁盟哨站: null
    },
    type: "Normal",
    buyPrices: {
      铁盟哨站: 177
    },
    buyLot: {
      铁盟哨站: 47
    }
  },
  {
    name: "桦石发财树",
    sellPrices: {
      修格里城: 5279,
      曼德矿场: 5523,
      海角城: 5401,
      荒原站: 5523,
      淘金乐园: 5792,
      阿妮塔发射中心: 5279,
      阿妮塔战备工厂: 5157,
      阿妮塔能源研究所: 5157,
      澄明数据中心: 5279,
      铁盟哨站: 5401,
      七号自由港: null
    },
    type: "Special",
    buyPrices: {
      七号自由港: 4888
    },
    buyLot: {
      七号自由港: 7
    }
  },
  {
    name: "石墨烯",
    sellPrices: {
      修格里城: 2557,
      曼德矿场: 2811,
      海角城: 2650,
      荒原站: 2742,
      淘金乐园: 2834,
      阿妮塔发射中心: 2557,
      阿妮塔战备工厂: 2465,
      阿妮塔能源研究所: 2534,
      澄明数据中心: 2627,
      铁盟哨站: 2719,
      七号自由港: null
    },
    type: "Special",
    buyPrices: {
      七号自由港: 2304
    },
    buyLot: {
      七号自由港: 7
    },
    craft: {
      石墨: 0.375
    }
  },
  {
    name: "人工晶花",
    sellPrices: {
      修格里城: 1997,
      曼德矿场: 2164,
      海角城: 2081,
      荒原站: 2164,
      淘金乐园: 2301,
      阿妮塔发射中心: 1997,
      阿妮塔战备工厂: 1914,
      阿妮塔能源研究所: 1914,
      澄明数据中心: 1997,
      铁盟哨站: 2081,
      七号自由港: null
    },
    type: "Special",
    buyPrices: {
      七号自由港: 1777
    },
    buyLot: {
      七号自由港: 14
    }
  },
  {
    name: "电子配件",
    sellPrices: {
      修格里城: 1137,
      曼德矿场: 1249,
      海角城: 1178,
      荒原站: 1219,
      淘金乐园: 1260,
      阿妮塔发射中心: 1137,
      阿妮塔战备工厂: 1096,
      阿妮塔能源研究所: 1096,
      澄明数据中心: 1167,
      铁盟哨站: 1208,
      七号自由港: null
    },
    type: "Normal",
    buyPrices: {
      七号自由港: 1024
    },
    buyLot: {
      七号自由港: 21
    }
  },
  {
    name: "航天纪念品",
    sellPrices: {
      修格里城: 862,
      曼德矿场: 925,
      海角城: 917,
      荒原站: 901,
      淘金乐园: 932,
      阿妮塔发射中心: 839,
      阿妮塔战备工厂: 808,
      阿妮塔能源研究所: 808,
      澄明数据中心: 862,
      铁盟哨站: 894,
      七号自由港: null
    },
    type: "Normal",
    buyPrices: {
      七号自由港: 777
    },
    buyLot: {
      七号自由港: 28
    }
  },
  {
    name: "斑节虾",
    sellPrices: {
      修格里城: 782,
      曼德矿场: 958,
      海角城: 870,
      荒原站: 958,
      淘金乐园: 1047,
      阿妮塔发射中心: 782,
      阿妮塔战备工厂: 694,
      阿妮塔能源研究所: 694,
      澄明数据中心: 782,
      铁盟哨站: 870,
      七号自由港: null
    },
    type: "Special",
    buyPrices: {
      七号自由港: 588
    },
    buyLot: {
      七号自由港: 35
    }
  },
  {
    name: "纯棉T恤",
    sellPrices: {
      修格里城: 529,
      曼德矿场: 559,
      海角城: 559,
      荒原站: 559,
      淘金乐园: 574,
      阿妮塔发射中心: 529,
      阿妮塔战备工厂: 514,
      阿妮塔能源研究所: 514,
      澄明数据中心: 529,
      铁盟哨站: 544,
      七号自由港: null
    },
    type: "Special",
    buyPrices: {
      七号自由港: 499
    },
    buyLot: {
      七号自由港: 35
    }
  },
  {
    name: "坚果",
    sellPrices: {
      修格里城: 237,
      曼德矿场: 265,
      海角城: 242,
      荒原站: 252,
      淘金乐园: 275,
      阿妮塔发射中心: 231,
      阿妮塔战备工厂: 221,
      阿妮塔能源研究所: 221,
      澄明数据中心: 237,
      铁盟哨站: 254,
      七号自由港: null
    },
    type: "Normal",
    buyPrices: {
      七号自由港: 210
    },
    buyLot: {
      七号自由港: 42
    }
  },
  {
    name: "啤酒",
    sellPrices: {
      修格里城: 133,
      曼德矿场: 149,
      海角城: 143,
      荒原站: 142,
      淘金乐园: 148,
      阿妮塔发射中心: 130,
      阿妮塔战备工厂: 124,
      阿妮塔能源研究所: 127,
      澄明数据中心: 133,
      铁盟哨站: 146,
      七号自由港: null
    },
    type: "Normal",
    buyPrices: {
      七号自由港: 118
    },
    buyLot: {
      七号自由港: 56
    }
  },
  {
    name: "海盐",
    sellPrices: {
      修格里城: 99,
      曼德矿场: 109,
      海角城: 104,
      荒原站: 109,
      淘金乐园: 114,
      阿妮塔发射中心: 99,
      阿妮塔战备工厂: 93,
      阿妮塔能源研究所: 93,
      澄明数据中心: 101,
      铁盟哨站: 104,
      七号自由港: null
    },
    type: "Normal",
    buyPrices: {
      七号自由港: 88
    },
    buyLot: {
      七号自由港: 70
    }
  },
  {
    name: "年货大礼包",
    sellPrices: {
      修格里城: 2888,
      七号自由港: 3292,
      曼德矿场: 3177,
      海角城: 3639,
      荒原站: 3177,
      淘金乐园: 3292,
      阿妮塔发射中心: 3523,
      阿妮塔战备工厂: 3292,
      阿妮塔能源研究所: 3408,
      澄明数据中心: 3177,
      铁盟哨站: 3061
    },
    type: "Craft",
    craft: {
      红茶: 0.1111111111111111,
      沃德烤鸡: 0.1111111111111111,
      罐头: 0.1111111111111111,
      沃德山泉: 0.1111111111111111,
      坚果: 0.3333333333333333,
      斑节虾: 0.3333333333333333
    },
    buyPrices: {
      七号自由港: 99999
    }
  },
  {
    name: "游戏机",
    sellPrices: {
      修格里城: 3424,
      七号自由港: 3552,
      曼德矿场: 3648,
      海角城: 4032,
      荒原站: 3648,
      淘金乐园: 3776,
      阿妮塔发射中心: 3904,
      阿妮塔战备工厂: 3520,
      阿妮塔能源研究所: 3776,
      铁盟哨站: 3424,
      澄明数据中心: null
    },
    type: "Special",
    buyPrices: {
      澄明数据中心: 3200
    },
    buyLot: {
      澄明数据中心: 10
    }
  },
  {
    name: "银矿石",
    sellPrices: {
      修格里城: 2650,
      七号自由港: 2725,
      曼德矿场: 2725,
      海角城: 3025,
      荒原站: 2725,
      淘金乐园: 2800,
      阿妮塔发射中心: 2875,
      阿妮塔战备工厂: 2650,
      阿妮塔能源研究所: 2875,
      铁盟哨站: 2650,
      澄明数据中心: null
    },
    type: "Special",
    buyPrices: {
      澄明数据中心: 2500
    },
    buyLot: {
      澄明数据中心: 10
    }
  },
  {
    name: "花呢上衣",
    sellPrices: {
      修格里城: 2013,
      七号自由港: 2088,
      曼德矿场: 2088,
      海角城: 2426,
      荒原站: 2144,
      淘金乐园: 2220,
      阿妮塔发射中心: 2295,
      阿妮塔战备工厂: 2069,
      阿妮塔能源研究所: 2220,
      铁盟哨站: 2013,
      澄明数据中心: null
    },
    type: "Normal",
    buyPrices: {
      澄明数据中心: 1881
    },
    buyLot: {
      澄明数据中心: 10
    }
  },
  {
    name: "扬声器",
    sellPrices: {
      修格里城: 1037,
      七号自由港: 1056,
      曼德矿场: 1085,
      海角城: 1200,
      荒原站: 1056,
      淘金乐园: 1133,
      阿妮塔发射中心: 1152,
      阿妮塔战备工厂: 1008,
      阿妮塔能源研究所: 1104,
      铁盟哨站: 1037,
      澄明数据中心: null
    },
    type: "Special",
    buyPrices: {
      澄明数据中心: 960
    },
    buyLot: {
      澄明数据中心: 20
    }
  },
  {
    name: "游戏卡带",
    sellPrices: {
      修格里城: 732,
      七号自由港: 797,
      曼德矿场: 816,
      海角城: 1011,
      荒原站: 816,
      淘金乐园: 881,
      阿妮塔发射中心: 946,
      阿妮塔战备工厂: 752,
      阿妮塔能源研究所: 881,
      铁盟哨站: 732,
      澄明数据中心: null
    },
    type: "Special",
    buyPrices: {
      澄明数据中心: 648
    },
    buyLot: {
      澄明数据中心: 30
    }
  },
  {
    name: "录像带",
    sellPrices: {
      修格里城: 543,
      七号自由港: 543,
      曼德矿场: 543,
      海角城: 589,
      荒原站: 543,
      淘金乐园: 558,
      阿妮塔发射中心: 573,
      阿妮塔战备工厂: 527,
      阿妮塔能源研究所: 558,
      铁盟哨站: 543,
      澄明数据中心: null
    },
    type: "Normal",
    buyPrices: {
      澄明数据中心: 512
    },
    buyLot: {
      澄明数据中心: 30
    }
  },
  {
    name: "荧光棒",
    sellPrices: {
      修格里城: 449,
      七号自由港: 470,
      曼德矿场: 470,
      海角城: 532,
      荒原站: 458,
      淘金乐园: 478,
      阿妮塔发射中心: 499,
      阿妮塔战备工厂: 437,
      阿妮塔能源研究所: 478,
      铁盟哨站: 449,
      澄明数据中心: null
    },
    type: "Normal",
    buyPrices: {
      澄明数据中心: 416
    },
    buyLot: {
      澄明数据中心: 35
    }
  },
  {
    name: "火车玩具",
    sellPrices: {
      修格里城: 336,
      七号自由港: 362,
      曼德矿场: 362,
      海角城: 400,
      荒原站: 352,
      淘金乐园: 378,
      阿妮塔发射中心: 384,
      阿妮塔战备工厂: 336,
      阿妮塔能源研究所: 368,
      铁盟哨站: 336,
      澄明数据中心: null
    },
    type: "Normal",
    buyPrices: {
      澄明数据中心: 320
    },
    buyLot: {
      澄明数据中心: 40
    }
  },
  {
    name: "录音带",
    sellPrices: {
      修格里城: 271,
      七号自由港: 271,
      曼德矿场: 271,
      海角城: 294,
      荒原站: 271,
      淘金乐园: 279,
      阿妮塔发射中心: 287,
      阿妮塔战备工厂: 264,
      阿妮塔能源研究所: 279,
      铁盟哨站: 271,
      澄明数据中心: null
    },
    type: "Normal",
    buyPrices: {
      澄明数据中心: 256
    },
    buyLot: {
      澄明数据中心: 50
    }
  },
  {
    name: "火澄石",
    sellPrices: {
      修格里城: 7560,
      七号自由港: 7385,
      曼德矿场: 7735,
      海角城: 7735,
      荒原站: 7735,
      淘金乐园: 8120,
      阿妮塔发射中心: 7770,
      阿妮塔能源研究所: 7595,
      澄明数据中心: 7385,
      铁盟哨站: 7770,
      阿妮塔战备工厂: null
    },
    type: "Special",
    buyPrices: {
      阿妮塔战备工厂: 7e3
    },
    buyLot: {
      阿妮塔战备工厂: 2
    }
  },
  {
    name: "负片炮弹",
    sellPrices: {
      修格里城: 4536,
      七号自由港: 4431,
      曼德矿场: 4641,
      海角城: 4641,
      荒原站: 4641,
      淘金乐园: 4746,
      阿妮塔发射中心: 4536,
      阿妮塔能源研究所: 4431,
      澄明数据中心: 4431,
      铁盟哨站: 4662,
      阿妮塔战备工厂: null
    },
    type: "Special",
    buyPrices: {
      阿妮塔战备工厂: 4200
    },
    buyLot: {
      阿妮塔战备工厂: 4
    }
  },
  {
    name: "阿妮塔202军用无人机",
    sellPrices: {
      修格里城: 3815,
      七号自由港: 3710,
      曼德矿场: 3920,
      海角城: 3920,
      荒原站: 3920,
      淘金乐园: 4025,
      阿妮塔发射中心: 3815,
      阿妮塔能源研究所: 3710,
      澄明数据中心: 3710,
      铁盟哨站: 3920,
      阿妮塔战备工厂: null
    },
    type: "Special",
    buyPrices: {
      阿妮塔战备工厂: 3500
    },
    buyLot: {
      阿妮塔战备工厂: 7
    }
  },
  {
    name: "抗污染防护服",
    sellPrices: {
      修格里城: 3108,
      七号自由港: 2996,
      曼德矿场: 3220,
      海角城: 3220,
      荒原站: 3304,
      淘金乐园: 3416,
      阿妮塔发射中心: 3108,
      阿妮塔能源研究所: 2996,
      澄明数据中心: 3080,
      铁盟哨站: 3192,
      阿妮塔战备工厂: null
    },
    type: "Special",
    buyPrices: {
      阿妮塔战备工厂: 2800
    },
    buyLot: {
      阿妮塔战备工厂: 11
    }
  },
  {
    name: "钛合金",
    sellPrices: {
      修格里城: 2797,
      七号自由港: 2772,
      曼德矿场: 2898,
      海角城: 2898,
      荒原站: 2898,
      淘金乐园: 2999,
      阿妮塔发射中心: 2873,
      阿妮塔能源研究所: 2772,
      澄明数据中心: 2696,
      铁盟哨站: 2873,
      阿妮塔战备工厂: null
    },
    type: "Special",
    buyPrices: {
      阿妮塔战备工厂: 2520
    },
    buyLot: {
      阿妮塔战备工厂: 11
    },
    craft: {
      钛矿石: 0.25
    }
  },
  {
    name: "碳纤维",
    sellPrices: {
      修格里城: 1555,
      七号自由港: 1499,
      曼德矿场: 1611,
      海角城: 1611,
      荒原站: 1611,
      淘金乐园: 1667,
      阿妮塔发射中心: 1597,
      阿妮塔能源研究所: 1541,
      澄明数据中心: 1499,
      铁盟哨站: 1597,
      阿妮塔战备工厂: null
    },
    type: "Special",
    buyPrices: {
      阿妮塔战备工厂: 1401
    },
    buyLot: {
      阿妮塔战备工厂: 18
    }
  },
  {
    name: "形态共振瞄准器",
    sellPrices: {
      修格里城: 1155,
      七号自由港: 1103,
      曼德矿场: 1208,
      海角城: 1208,
      荒原站: 1239,
      淘金乐园: 1292,
      阿妮塔发射中心: 1155,
      阿妮塔能源研究所: 1103,
      澄明数据中心: 1103,
      铁盟哨站: 1187,
      阿妮塔战备工厂: null
    },
    type: "Normal",
    buyPrices: {
      阿妮塔战备工厂: 1050
    },
    buyLot: {
      阿妮塔战备工厂: 18
    }
  },
  {
    name: "高导磁硅钢片",
    sellPrices: {
      修格里城: 949,
      七号自由港: 907,
      曼德矿场: 1016,
      海角城: 966,
      荒原站: 966,
      淘金乐园: 1033,
      阿妮塔发射中心: 949,
      阿妮塔能源研究所: 907,
      澄明数据中心: 907,
      铁盟哨站: 949,
      阿妮塔战备工厂: null
    },
    type: "Normal",
    buyPrices: {
      阿妮塔战备工厂: 840
    },
    buyLot: {
      阿妮塔战备工厂: 29
    }
  },
  {
    name: "黄铜线圈",
    sellPrices: {
      修格里城: 791,
      七号自由港: 756,
      曼德矿场: 805,
      海角城: 805,
      荒原站: 805,
      淘金乐园: 840,
      阿妮塔发射中心: 791,
      阿妮塔能源研究所: 756,
      澄明数据中心: 756,
      铁盟哨站: 770,
      阿妮塔战备工厂: null
    },
    type: "Normal",
    buyPrices: {
      阿妮塔战备工厂: 700
    },
    buyLot: {
      阿妮塔战备工厂: 47
    },
    craft: {
      黄铜: 0.25
    }
  },
  {
    name: "阿妮塔小型桦树发电机",
    sellPrices: {
      修格里城: 7741,
      七号自由港: 7465,
      曼德矿场: 8018,
      海角城: 7603,
      荒原站: 8018,
      淘金乐园: 8018,
      阿妮塔发射中心: 7465,
      阿妮塔战备工厂: 7465,
      澄明数据中心: 7741,
      铁盟哨站: 7880,
      阿妮塔能源研究所: null
    },
    type: "Special",
    buyPrices: {
      阿妮塔能源研究所: 6912
    },
    buyLot: {
      阿妮塔能源研究所: 1
    }
  },
  {
    name: "石墨烯电池",
    sellPrices: {
      修格里城: 4416,
      七号自由港: 4070,
      曼德矿场: 4646,
      海角城: 4301,
      荒原站: 4531,
      淘金乐园: 4646,
      阿妮塔发射中心: 4070,
      阿妮塔战备工厂: 4070,
      澄明数据中心: 4416,
      铁盟哨站: 4531,
      阿妮塔能源研究所: null
    },
    type: "Special",
    buyPrices: {
      阿妮塔能源研究所: 3840
    },
    buyLot: {
      阿妮塔能源研究所: 7
    },
    craft: {
      石墨: 0.09375,
      锂电池: 0.75
    }
  },
  {
    name: "阿妮塔101民用无人机",
    sellPrices: {
      修格里城: 1859,
      七号自由港: 1659,
      曼德矿场: 2012,
      海角城: 1782,
      荒原站: 1966,
      淘金乐园: 2012,
      阿妮塔发射中心: 1659,
      阿妮塔战备工厂: 1659,
      澄明数据中心: 1859,
      铁盟哨站: 1935,
      阿妮塔能源研究所: null
    },
    type: "Special",
    buyPrices: {
      阿妮塔能源研究所: 1536
    },
    buyLot: {
      阿妮塔能源研究所: 14
    }
  },
  {
    name: "家用太阳能电池组",
    sellPrices: {
      修格里城: 1394,
      七号自由港: 1244,
      曼德矿场: 1475,
      海角城: 1302,
      荒原站: 1475,
      淘金乐园: 1475,
      阿妮塔发射中心: 1244,
      阿妮塔战备工厂: 1244,
      澄明数据中心: 1394,
      铁盟哨站: 1452,
      阿妮塔能源研究所: null
    },
    type: "Special",
    buyPrices: {
      阿妮塔能源研究所: 1152
    },
    buyLot: {
      阿妮塔能源研究所: 21
    }
  },
  {
    name: "锂电池",
    sellPrices: {
      修格里城: 860,
      七号自由港: 822,
      曼德矿场: 922,
      海角城: 829,
      荒原站: 922,
      淘金乐园: 945,
      阿妮塔发射中心: 799,
      阿妮塔战备工厂: 799,
      澄明数据中心: 906,
      铁盟哨站: 914,
      阿妮塔能源研究所: null
    },
    type: "Normal",
    buyPrices: {
      阿妮塔能源研究所: 768
    },
    buyLot: {
      阿妮塔能源研究所: 28
    }
  },
  {
    name: "无纺布",
    sellPrices: {
      修格里城: 617,
      七号自由港: 568,
      曼德矿场: 634,
      海角城: 584,
      荒原站: 650,
      淘金乐园: 634,
      阿妮塔发射中心: 601,
      阿妮塔战备工厂: 601,
      澄明数据中心: 617,
      铁盟哨站: 650,
      阿妮塔能源研究所: null
    },
    type: "Special",
    buyPrices: {
      阿妮塔能源研究所: 551
    },
    buyLot: {
      阿妮塔能源研究所: 30
    }
  },
  {
    name: "充电电池",
    sellPrices: {
      修格里城: 323,
      七号自由港: 308,
      曼德矿场: 346,
      海角城: 311,
      荒原站: 346,
      淘金乐园: 354,
      阿妮塔发射中心: 300,
      阿妮塔战备工厂: 300,
      澄明数据中心: 340,
      铁盟哨站: 343,
      阿妮塔能源研究所: null
    },
    type: "Normal",
    buyPrices: {
      阿妮塔能源研究所: 288
    },
    buyLot: {
      阿妮塔能源研究所: 42
    }
  },
  {
    name: "琥珀",
    sellPrices: {
      修格里城: 2419,
      七号自由港: 2822,
      曼德矿场: 2419,
      海角城: 3158,
      淘金乐园: 2598,
      阿妮塔发射中心: 2979,
      阿妮塔战备工厂: 2643,
      阿妮塔能源研究所: 2867,
      澄明数据中心: 2598,
      铁盟哨站: 2307,
      荒原站: null
    },
    type: "Special",
    buyPrices: {
      荒原站: 2240
    },
    buyLot: {
      荒原站: 13
    }
  },
  {
    name: "孔雀石",
    sellPrices: {
      修格里城: 1782,
      七号自由港: 2079,
      曼德矿场: 1782,
      海角城: 2327,
      淘金乐园: 1865,
      阿妮塔发射中心: 2195,
      阿妮塔战备工厂: 1947,
      阿妮塔能源研究所: 2112,
      澄明数据中心: 1865,
      铁盟哨站: 1700,
      荒原站: null
    },
    type: "Special",
    buyPrices: {
      荒原站: 1650
    },
    buyLot: {
      荒原站: 17
    }
  },
  {
    name: "绿松石",
    sellPrices: {
      修格里城: 1247,
      七号自由港: 1487,
      曼德矿场: 1247,
      海角城: 1693,
      淘金乐园: 1316,
      阿妮塔发射中心: 1590,
      阿妮塔战备工厂: 1384,
      阿妮塔能源研究所: 1522,
      澄明数据中心: 1316,
      铁盟哨站: 1178,
      荒原站: null
    },
    type: "Special",
    buyPrices: {
      荒原站: 1144
    },
    buyLot: {
      荒原站: 19
    }
  },
  {
    name: "棉花",
    sellPrices: {
      修格里城: 848,
      七号自由港: 1095,
      曼德矿场: 848,
      海角城: 1343,
      淘金乐园: 945,
      阿妮塔发射中心: 1268,
      阿妮塔战备工厂: 1020,
      阿妮塔能源研究所: 1193,
      澄明数据中心: 923,
      铁盟哨站: 773,
      荒原站: null
    },
    type: "Special",
    buyPrices: {
      荒原站: 750
    },
    buyLot: {
      荒原站: 23
    }
  },
  {
    name: "铅矿石",
    sellPrices: {
      修格里城: 719,
      七号自由港: 780,
      曼德矿场: 698,
      海角城: 841,
      淘金乐园: 739,
      阿妮塔发射中心: 800,
      阿妮塔战备工厂: 759,
      阿妮塔能源研究所: 820,
      澄明数据中心: 739,
      铁盟哨站: 698,
      荒原站: null
    },
    type: "Normal",
    buyPrices: {
      荒原站: 678
    },
    buyLot: {
      荒原站: 29
    }
  },
  {
    name: "石墨",
    sellPrices: {
      修格里城: 407,
      七号自由港: 453,
      曼德矿场: 396,
      海角城: 476,
      淘金乐园: 419,
      阿妮塔发射中心: 465,
      阿妮塔战备工厂: 430,
      阿妮塔能源研究所: 465,
      澄明数据中心: 419,
      铁盟哨站: 396,
      荒原站: null
    },
    type: "Normal",
    buyPrices: {
      荒原站: 384
    },
    buyLot: {
      荒原站: 37
    }
  },
  {
    name: "土豆",
    sellPrices: {
      修格里城: 66,
      七号自由港: 82,
      曼德矿场: 66,
      海角城: 99,
      淘金乐园: 71,
      阿妮塔发射中心: 90,
      阿妮塔战备工厂: 76,
      阿妮塔能源研究所: 87,
      澄明数据中心: 73,
      铁盟哨站: 63,
      荒原站: null
    },
    type: "Normal",
    buyPrices: {
      荒原站: 61
    },
    buyLot: {
      荒原站: 53
    }
  },
  {
    name: "图形加速卡",
    sellPrices: {
      修格里城: 3410,
      七号自由港: 3871,
      海角城: 4024,
      荒原站: 3318,
      淘金乐园: 3318,
      阿妮塔发射中心: 4086,
      阿妮塔战备工厂: 3625,
      阿妮塔能源研究所: 3932,
      澄明数据中心: 3564,
      铁盟哨站: 3256,
      曼德矿场: null
    },
    type: "Special",
    buyPrices: {
      曼德矿场: 3072
    },
    buyLot: {
      曼德矿场: 12
    }
  },
  {
    name: "钛矿石",
    sellPrices: {
      修格里城: 1750,
      七号自由港: 2041,
      海角城: 2074,
      荒原站: 1750,
      淘金乐园: 1750,
      阿妮塔发射中心: 2203,
      阿妮塔战备工厂: 1960,
      阿妮塔能源研究所: 2122,
      澄明数据中心: 1831,
      铁盟哨站: 1717,
      曼德矿场: null
    },
    type: "Normal",
    buyPrices: {
      曼德矿场: 1620
    },
    buyLot: {
      曼德矿场: 15
    }
  },
  {
    name: "铁轨用特种钢材",
    sellPrices: {
      修格里城: 1166,
      七号自由港: 1328,
      海角城: 1382,
      荒原站: 1166,
      淘金乐园: 1166,
      阿妮塔发射中心: 1436,
      阿妮塔战备工厂: 1274,
      阿妮塔能源研究所: 1382,
      澄明数据中心: 1220,
      铁盟哨站: 1112,
      曼德矿场: null
    },
    type: "Normal",
    buyPrices: {
      曼德矿场: 1080
    },
    buyLot: {
      曼德矿场: 24
    }
  },
  {
    name: "曼德工具箱",
    sellPrices: {
      修格里城: 1021,
      七号自由港: 1285,
      海角城: 1373,
      荒原站: 994,
      淘金乐园: 994,
      阿妮塔发射中心: 1461,
      阿妮塔战备工厂: 1197,
      阿妮塔能源研究所: 1373,
      澄明数据中心: 1109,
      铁盟哨站: 933,
      曼德矿场: null
    },
    type: "Special",
    buyPrices: {
      曼德矿场: 880
    },
    buyLot: {
      曼德矿场: 27
    }
  },
  {
    name: "黄铜",
    sellPrices: {
      修格里城: 657,
      七号自由港: 694,
      海角城: 713,
      荒原站: 639,
      淘金乐园: 639,
      阿妮塔发射中心: 750,
      阿妮塔战备工厂: 694,
      阿妮塔能源研究所: 732,
      澄明数据中心: 676,
      铁盟哨站: 639,
      曼德矿场: null
    },
    type: "Normal",
    buyPrices: {
      曼德矿场: 620
    },
    buyLot: {
      曼德矿场: 30
    }
  },
  {
    name: "钢筋混凝土轨枕",
    sellPrices: {
      修格里城: 583,
      七号自由港: 664,
      海角城: 691,
      荒原站: 583,
      淘金乐园: 583,
      阿妮塔发射中心: 718,
      阿妮塔战备工厂: 637,
      阿妮塔能源研究所: 691,
      澄明数据中心: 610,
      铁盟哨站: 556,
      曼德矿场: null
    },
    type: "Normal",
    buyPrices: {
      曼德矿场: 540
    },
    buyLot: {
      曼德矿场: 36
    }
  },
  {
    name: "建材",
    sellPrices: {
      修格里城: 482,
      七号自由港: 522,
      海角城: 540,
      荒原站: 482,
      淘金乐园: 468,
      阿妮塔发射中心: 558,
      阿妮塔战备工厂: 504,
      阿妮塔能源研究所: 554,
      澄明数据中心: 500,
      铁盟哨站: 464,
      曼德矿场: null
    },
    type: "Normal",
    buyPrices: {
      曼德矿场: 450
    },
    buyLot: {
      曼德矿场: 30
    }
  },
  {
    name: "铁矿石",
    sellPrices: {
      修格里城: 361,
      七号自由港: 392,
      海角城: 403,
      荒原站: 361,
      阿妮塔发射中心: 413,
      阿妮塔战备工厂: 392,
      阿妮塔能源研究所: 413,
      澄明数据中心: 371,
      铁盟哨站: 361,
      曼德矿场: null,
      淘金乐园: null
    },
    type: "Normal",
    buyPrices: {
      曼德矿场: 350,
      淘金乐园: 361
    },
    buyLot: {
      曼德矿场: 36,
      淘金乐园: 36
    }
  },
  {
    name: "石材",
    sellPrices: {
      修格里城: 189,
      七号自由港: 216,
      海角城: 225,
      荒原站: 189,
      淘金乐园: 189,
      阿妮塔发射中心: 234,
      阿妮塔战备工厂: 207,
      阿妮塔能源研究所: 225,
      澄明数据中心: 203,
      铁盟哨站: 180,
      曼德矿场: null
    },
    type: "Normal",
    buyPrices: {
      曼德矿场: 180
    },
    buyLot: {
      曼德矿场: 45
    }
  },
  {
    name: "砂石",
    sellPrices: {
      修格里城: 32,
      七号自由港: 36,
      海角城: 38,
      荒原站: 32,
      淘金乐园: 32,
      阿妮塔发射中心: 39,
      阿妮塔战备工厂: 35,
      阿妮塔能源研究所: 38,
      澄明数据中心: 33,
      铁盟哨站: 30,
      曼德矿场: null
    },
    type: "Normal",
    buyPrices: {
      曼德矿场: 30
    },
    buyLot: {
      曼德矿场: 72
    }
  },
  {
    name: "沙金",
    sellPrices: {
      修格里城: 2943,
      七号自由港: 3186,
      曼德矿场: 2862,
      海角城: 3186,
      荒原站: 2943,
      阿妮塔发射中心: 3348,
      阿妮塔战备工厂: 3105,
      阿妮塔能源研究所: 3267,
      澄明数据中心: 3024,
      铁盟哨站: 2943,
      淘金乐园: null
    },
    type: "Special",
    buyPrices: {
      淘金乐园: 2700
    },
    buyLot: {
      淘金乐园: 11
    }
  },
  {
    name: "青金石",
    sellPrices: {
      修格里城: 2170,
      七号自由港: 2458,
      曼德矿场: 2074,
      海角城: 2515,
      荒原站: 2170,
      阿妮塔发射中心: 2650,
      阿妮塔战备工厂: 2362,
      阿妮塔能源研究所: 2458,
      澄明数据中心: 2266,
      铁盟哨站: 2170,
      淘金乐园: null
    },
    type: "Special",
    buyPrices: {
      淘金乐园: 1920
    },
    buyLot: {
      淘金乐园: 13
    }
  },
  {
    name: "玛瑙",
    sellPrices: {
      修格里城: 1953,
      七号自由港: 2212,
      曼德矿场: 1866,
      海角城: 2264,
      荒原站: 1953,
      阿妮塔发射中心: 2385,
      阿妮塔战备工厂: 2125,
      阿妮塔能源研究所: 2212,
      澄明数据中心: 2039,
      铁盟哨站: 1953,
      淘金乐园: null
    },
    type: "Special",
    buyPrices: {
      淘金乐园: 1728
    },
    buyLot: {
      淘金乐园: 17
    }
  },
  {
    name: "漆黑矿渣",
    sellPrices: {
      修格里城: 622,
      七号自由港: 738,
      曼德矿场: 588,
      海角城: 722,
      荒原站: 622,
      阿妮塔发射中心: 805,
      阿妮塔战备工厂: 705,
      阿妮塔能源研究所: 738,
      澄明数据中心: 672,
      铁盟哨站: 655,
      淘金乐园: null
    },
    type: "Normal",
    buyPrices: {
      淘金乐园: 555
    },
    buyLot: {
      淘金乐园: 37
    }
  },
  {
    name: "牛仔裤",
    sellPrices: {
      修格里城: 531,
      七号自由港: 591,
      曼德矿场: 546,
      海角城: 591,
      荒原站: 546,
      阿妮塔发射中心: 621,
      阿妮塔战备工厂: 576,
      阿妮塔能源研究所: 591,
      澄明数据中心: 546,
      铁盟哨站: 546,
      淘金乐园: null
    },
    type: "Normal",
    buyPrices: {
      淘金乐园: 501
    },
    buyLot: {
      淘金乐园: 10
    }
  },
  {
    name: "石英砂",
    sellPrices: {
      修格里城: 266,
      七号自由港: 322,
      曼德矿场: 249,
      海角城: 322,
      荒原站: 266,
      阿妮塔发射中心: 347,
      阿妮塔战备工厂: 298,
      阿妮塔能源研究所: 315,
      澄明数据中心: 289,
      铁盟哨站: 273,
      淘金乐园: null
    },
    type: "Normal",
    buyPrices: {
      淘金乐园: 233
    },
    buyLot: {
      淘金乐园: 47
    }
  },
  {
    name: "纯金线材",
    sellPrices: {
      修格里城: 7517,
      七号自由港: 8208,
      曼德矿场: 7358,
      海角城: 7992,
      荒原站: 7517,
      淘金乐园: 7200,
      阿妮塔发射中心: 8525,
      阿妮塔战备工厂: 8050,
      阿妮塔能源研究所: 8208,
      澄明数据中心: 7891,
      铁盟哨站: 7517
    },
    type: "Craft",
    craft: {
      沙金: 0.75
    },
    buyPrices: {
      淘金乐园: 99999
    }
  },
  {
    name: "金箔",
    sellPrices: {
      修格里城: 3888,
      七号自由港: 4158,
      曼德矿场: 3798,
      海角城: 4158,
      荒原站: 3888,
      淘金乐园: 3600,
      阿妮塔发射中心: 4338,
      阿妮塔战备工厂: 4068,
      阿妮塔能源研究所: 4266,
      澄明数据中心: 3978,
      铁盟哨站: 3888
    },
    type: "Craft",
    craft: {
      沙金: 0.5
    },
    buyPrices: {
      淘金乐园: 99999
    }
  },
  {
    name: "航天半导体",
    sellPrices: {
      修格里城: 8593,
      七号自由港: 8515,
      曼德矿场: 8902,
      海角城: 8438,
      荒原站: 8902,
      淘金乐园: 9057,
      阿妮塔战备工厂: 8515,
      阿妮塔能源研究所: 8360,
      澄明数据中心: 8825,
      铁盟哨站: 8980,
      阿妮塔发射中心: null
    },
    type: "Special",
    buyPrices: {
      阿妮塔发射中心: 7741
    },
    buyLot: {
      阿妮塔发射中心: 3
    }
  },
  {
    name: "太阳电池阵",
    sellPrices: {
      修格里城: 5979,
      七号自由港: 5873,
      曼德矿场: 6243,
      海角城: 5847,
      荒原站: 6402,
      淘金乐园: 6534,
      阿妮塔战备工厂: 5873,
      阿妮塔能源研究所: 5741,
      澄明数据中心: 5979,
      铁盟哨站: 6270,
      阿妮塔发射中心: null
    },
    type: "Special",
    buyPrices: {
      阿妮塔发射中心: 5291
    },
    buyLot: {
      阿妮塔发射中心: 5
    }
  },
  {
    name: "蜂窝防热烧蚀材料",
    sellPrices: {
      修格里城: 4302,
      七号自由港: 4190,
      曼德矿场: 4527,
      海角城: 4190,
      荒原站: 4527,
      淘金乐园: 4751,
      阿妮塔战备工厂: 4190,
      阿妮塔能源研究所: 4078,
      澄明数据中心: 4414,
      铁盟哨站: 4527,
      阿妮塔发射中心: null
    },
    type: "Special",
    buyPrices: {
      阿妮塔发射中心: 3741
    },
    buyLot: {
      阿妮塔发射中心: 8
    }
  },
  {
    name: "高导热陶瓷",
    sellPrices: {
      修格里城: 1941,
      七号自由港: 1859,
      曼德矿场: 2071,
      海角城: 1876,
      荒原站: 2071,
      淘金乐园: 2137,
      阿妮塔战备工厂: 1859,
      阿妮塔能源研究所: 1794,
      澄明数据中心: 1941,
      铁盟哨站: 2055,
      阿妮塔发射中心: null
    },
    type: "Normal",
    buyPrices: {
      阿妮塔发射中心: 1631
    },
    buyLot: {
      阿妮塔发射中心: 13
    },
    craft: {
      石英砂: 0.375,
      石墨: 0.375
    }
  },
  {
    name: "镍基高温合金",
    sellPrices: {
      修格里城: 1691,
      七号自由港: 1620,
      曼德矿场: 1805,
      海角城: 1634,
      荒原站: 1805,
      淘金乐园: 1862,
      阿妮塔战备工厂: 1620,
      阿妮塔能源研究所: 1563,
      澄明数据中心: 1691,
      铁盟哨站: 1790,
      阿妮塔发射中心: null
    },
    type: "Normal",
    buyPrices: {
      阿妮塔发射中心: 1421
    },
    buyLot: {
      阿妮塔发射中心: 13
    }
  },
  {
    name: "液氧甲烷燃料",
    sellPrices: {
      修格里城: 1001,
      七号自由港: 908,
      曼德矿场: 1043,
      海角城: 942,
      荒原站: 1043,
      淘金乐园: 1076,
      阿妮塔战备工厂: 934,
      阿妮塔能源研究所: 875,
      澄明数据中心: 976,
      铁盟哨站: 1034,
      阿妮塔发射中心: null
    },
    type: "Normal",
    buyPrices: {
      阿妮塔发射中心: 841
    },
    buyLot: {
      阿妮塔发射中心: 21
    }
  },
  {
    name: "无刷电机",
    sellPrices: {
      修格里城: 904,
      七号自由港: 845,
      曼德矿场: 963,
      海角城: 852,
      荒原站: 941,
      淘金乐园: 993,
      阿妮塔战备工厂: 845,
      阿妮塔能源研究所: 815,
      澄明数据中心: 882,
      铁盟哨站: 934,
      阿妮塔发射中心: null
    },
    type: "Normal",
    buyPrices: {
      阿妮塔发射中心: 741
    },
    buyLot: {
      阿妮塔发射中心: 34
    }
  },
  {
    name: "火箭拼装玩具",
    sellPrices: {
      修格里城: 668,
      七号自由港: 640,
      曼德矿场: 696,
      海角城: 628,
      荒原站: 712,
      淘金乐园: 752,
      阿妮塔战备工厂: 640,
      阿妮塔能源研究所: 617,
      澄明数据中心: 651,
      铁盟哨站: 673,
      阿妮塔发射中心: null
    },
    type: "Normal",
    buyPrices: {
      阿妮塔发射中心: 561
    },
    buyLot: {
      阿妮塔发射中心: 55
    }
  },
  {
    name: "珍珠",
    sellPrices: {
      修格里城: 4920,
      七号自由港: 4600,
      曼德矿场: 4920,
      荒原站: 5240,
      淘金乐园: 5040,
      阿妮塔发射中心: 4600,
      阿妮塔战备工厂: 4600,
      阿妮塔能源研究所: 4440,
      澄明数据中心: 4920,
      铁盟哨站: 5080,
      海角城: null
    },
    type: "Special",
    buyPrices: {
      海角城: 4e3
    },
    buyLot: {
      海角城: 8
    }
  },
  {
    name: "蕾丝连衣裙",
    sellPrices: {
      修格里城: 2823,
      七号自由港: 2639,
      曼德矿场: 2823,
      荒原站: 3075,
      淘金乐园: 2892,
      阿妮塔发射中心: 2708,
      阿妮塔战备工厂: 2708,
      阿妮塔能源研究所: 2616,
      澄明数据中心: 2823,
      铁盟哨站: 2915,
      海角城: null
    },
    type: "Normal",
    buyPrices: {
      海角城: 2295
    },
    buyLot: {
      海角城: 8
    }
  },
  {
    name: "单晶硅",
    sellPrices: {
      修格里城: 1869,
      七号自由港: 1664,
      曼德矿场: 1869,
      荒原站: 2035,
      淘金乐园: 1830,
      阿妮塔发射中心: 1664,
      阿妮塔战备工厂: 1664,
      阿妮塔能源研究所: 1600,
      澄明数据中心: 1907,
      铁盟哨站: 1971,
      海角城: null
    },
    type: "Special",
    buyPrices: {
      海角城: 1280
    },
    buyLot: {
      海角城: 16
    }
  },
  {
    name: "大龙虾",
    sellPrices: {
      修格里城: 1460,
      七号自由港: 1270,
      曼德矿场: 1460,
      荒原站: 1620,
      淘金乐园: 1460,
      阿妮塔发射中心: 1300,
      阿妮塔战备工厂: 1300,
      阿妮塔能源研究所: 1220,
      澄明数据中心: 1460,
      铁盟哨站: 1540,
      海角城: null
    },
    type: "Special",
    buyPrices: {
      海角城: 1e3
    },
    buyLot: {
      海角城: 24
    }
  },
  {
    name: "学会书籍",
    sellPrices: {
      修格里城: 978,
      七号自由港: 834,
      曼德矿场: 978,
      荒原站: 1122,
      淘金乐园: 978,
      阿妮塔发射中心: 834,
      阿妮塔战备工厂: 834,
      阿妮塔能源研究所: 762,
      澄明数据中心: 996,
      铁盟哨站: 1050,
      海角城: null
    },
    type: "Special",
    buyPrices: {
      海角城: 600
    },
    buyLot: {
      海角城: 32
    }
  },
  {
    name: "行李箱包",
    sellPrices: {
      修格里城: 590,
      七号自由港: 552,
      曼德矿场: 590,
      荒原站: 614,
      淘金乐园: 576,
      阿妮塔发射中心: 538,
      阿妮塔战备工厂: 538,
      阿妮塔能源研究所: 518,
      澄明数据中心: 576,
      铁盟哨站: 610,
      海角城: null
    },
    type: "Normal",
    buyPrices: {
      海角城: 480
    },
    buyLot: {
      海角城: 32
    }
  },
  {
    name: "户外用品",
    sellPrices: {
      修格里城: 443,
      七号自由港: 403,
      曼德矿场: 443,
      荒原站: 461,
      淘金乐园: 432,
      阿妮塔发射中心: 403,
      阿妮塔战备工厂: 403,
      阿妮塔能源研究所: 389,
      澄明数据中心: 432,
      铁盟哨站: 457,
      海角城: null
    },
    type: "Normal",
    buyPrices: {
      海角城: 360
    },
    buyLot: {
      海角城: 32
    }
  },
  {
    name: "带鱼",
    sellPrices: {
      修格里城: 360,
      七号自由港: 312,
      曼德矿场: 360,
      荒原站: 408,
      淘金乐园: 360,
      阿妮塔发射中心: 312,
      阿妮塔战备工厂: 312,
      阿妮塔能源研究所: 288,
      澄明数据中心: 367,
      铁盟哨站: 384,
      海角城: null
    },
    type: "Normal",
    buyPrices: {
      海角城: 240
    },
    buyLot: {
      海角城: 48
    }
  },
  {
    name: "鱿鱼",
    sellPrices: {
      修格里城: 280,
      七号自由港: 248,
      曼德矿场: 280,
      荒原站: 312,
      淘金乐园: 280,
      阿妮塔发射中心: 248,
      阿妮塔战备工厂: 248,
      阿妮塔能源研究所: 232,
      澄明数据中心: 286,
      铁盟哨站: 296,
      海角城: null
    },
    type: "Normal",
    buyPrices: {
      海角城: 200
    },
    buyLot: {
      海角城: 48
    }
  },
  {
    name: "海角辣椒",
    sellPrices: {
      修格里城: 117,
      七号自由港: 104,
      曼德矿场: 114,
      荒原站: 125,
      淘金乐园: 112,
      阿妮塔发射中心: 99,
      阿妮塔战备工厂: 99,
      阿妮塔能源研究所: 93,
      澄明数据中心: 114,
      铁盟哨站: 123,
      海角城: null
    },
    type: "Normal",
    buyPrices: {
      海角城: 80
    },
    buyLot: {
      海角城: 48
    }
  },
  {
    name: "海角水产礼盒",
    sellPrices: {
      修格里城: 4704,
      七号自由港: 4471,
      曼德矿场: 4704,
      海角城: 3888,
      荒原站: 4938,
      淘金乐园: 4704,
      阿妮塔发射中心: 4471,
      阿妮塔战备工厂: 4471,
      阿妮塔能源研究所: 4355,
      澄明数据中心: 4704,
      铁盟哨站: 4821
    },
    type: "Craft",
    craft: {
      大龙虾: 0.5,
      带鱼: 1,
      鱿鱼: 1
    },
    buyPrices: {
      海角城: 99999
    }
  }
];

export var PRODUCT_UNLOCK_CONDITIONS: ProductUnlockConditions = goodsUnlockConditions;

const pdts: Product[] = Object.values(pdtData) as Product[];

export var PRODUCTS: Product[] = pdts;

export function products_set (pdtData, goodsUnlockConditions){
  const pdts: Product[] = Object.values(pdtData) as Product[];
  PRODUCTS = pdts
  PRODUCT_UNLOCK_CONDITIONS = goodsUnlockConditions;
}
